{
  "Bloomberg": [
    {
      "heading": "Ex-Goldman Sachs Star Banker Leissner Goes to Prison in 1MDB Fraud",
      "date": "2026-02-06",
      "tickers": [
        "GS"
      ],
      "summary": "Former Goldman Sachs banker Tim Leissner began serving a two-year federal prison sentence related to the 1MDB sovereign wealth fund scandal. He surrendered Friday at a federal facility in Allenwood, Pennsylvania, after pleading guilty eight years ago to his role in embezzling $4.5 billion from Malaysia’s 1MDB fund. The scandal led to the collapse of the Malaysian government and forced Goldman Sachs to pay more than $5 billion in settlements over misconduct claims.\n\nLeissner, 56, a German-born financier, admitted to participating in a scheme orchestrated by Malaysian financier Jho Low, who remains a fugitive after being charged in 2018. Leissner testified in the 2022 US trial of former Goldman colleague Roger Ng, revealing that $6.5 billion was raised for 1MDB bond transactions, of which at least $4.5 billion was embezzled. According to Leissner’s testimony, Low paid approximately $2 billion in bribes to foreign officials, and around $1 billion was paid as kickbacks. Leissner also admitted to personally receiving around $73.4 million from 1MDB and $80 million from Low.\n\nSince his May sentencing, Leissner received several delays in reporting to prison, but a US District Judge rejected his final request for postponement. Roger Ng was sentenced to 10 years but was transferred to Malaysia for trial shortly before starting his US prison term. In December, Malaysia announced it was seeking Leissner’s extradition. Leissner has filed a pardon application with the US Justice Department, with his lawyer citing his cooperation in exposing wrongdoing by Goldman Sachs and others."
    },
    {
      "heading": "Goldman, JPMorgan Bankers See Bonus Pools Rise at Least 10%",
      "date": "2026-02-06",
      "tickers": [
        "JPM",
        "GS",
        "BAC"
      ],
      "summary": "JPMorgan Chase, Goldman Sachs, and Bank of America have increased their bonus pools for bankers and traders by at least 10%, reflecting a strong year in dealmaking and market activity. The three banks reported a combined investment banking revenue of $25.7 billion, up 12%, and trading revenue of $87.7 billion, up 16% from the previous year. This performance contributed to the largest annual profits for these firms since 2021. Volatility linked to former President Trump’s economic policies bolstered trading, especially in equities, while dealmaking revived following a tariff-related slowdown earlier in the previous year.\n\nWhile bonuses increased, firms are also focusing on expense management, leveraging artificial intelligence to improve efficiency and scrutinizing staffing and compensation. HSBC in Europe is reportedly adopting a stricter bonus approach, with some bankers receiving little or no bonuses to align with Wall Street standards. Paris-based BNP Paribas is considering a near 10% bonus increase for its global markets division due to a record year, though overall bonus growth for the bank is expected to be modest, with some units facing lower payouts after missing targets.\n\nWall Street year-end bonuses are known for their volatility, with individual payouts potentially reaching millions in strong years. Compensation consultants had predicted 10% to 15% bonus increases for investment bankers and traders this cycle. In the previous year, Wall Street bonuses rose significantly, with the total payout pool reaching a record $47.5 billion and average bonuses increasing by nearly a third to $244,700, marking the first major post-pandemic rise. Representatives for JPMorgan, Goldman Sachs, and Bank of America did not comment on the current bonus decisions."
    },
    {
      "heading": "Google Employees Call on Company to End ICE, CBP Contracts",
      "date": "2026-02-06",
      "tickers": [
        "GOOGL",
        "MSFT"
      ],
      "summary": "Over 900 Google employees have signed a petition urging Alphabet Inc. to end its contracts with the U.S. Department of Homeland Security (DHS) agencies Immigration and Customs Enforcement (ICE) and Customs and Border Protection (CBP). The petition emerges amid renewed criticism following recent mass deportation efforts under the Trump administration and fatal shootings in Minneapolis, linking Google’s technology to \"state violence and repression.\" Approximately 30% of the signatories work in Google Cloud, which they claim supports border surveillance and enhances operational efficiency for these agencies through generative AI.\n\nThis protest aligns with broader tech industry activism against collaborations with immigration enforcement bodies. Since early January, over 1,700 tech workers have signed a separate petition calling on companies to sever ICE contracts and pressure the White House to withdraw ICE from cities. Palantir Technologies, a provider of surveillance software to ICE, has faced intense public protests and scrutiny, including from New York pension funds.\n\nGoogle declined to comment on the petition. Past employee activism at Google has included protests against Project Maven, an AI drone surveillance contract, which Google canceled in 2018 and pledged to avoid AI applications in weapons and surveillance—though that pledge has since been rescinded. The current petition demands an immediate Q&A session addressing Google's DHS and military contracts and calls for transparency about the company's involvement in state enforcement activities and clear limits on its product uses related to violence and repression."
    },
    {
      "heading": "Trump Is Remaking the Global Oil Market, and Exxon and Chevron Want In",
      "date": "2026-02-06",
      "tickers": [],
      "summary": "Exxon Mobil and Chevron are pursuing expanded oil production in OPEC-related countries, including high-risk geopolitical regions, supported by the Trump administration’s assertive foreign policy. Venezuela, with the world’s largest reserves, is a key focus after US control over its crude exports. Both companies are also negotiating in Iraq, Libya, Algeria, Azerbaijan, and Kazakhstan, often with U.S. government involvement. This represents a shift from prior US strategies focused on domestic shale growth, as political and commercial conditions improve abroad, alongside US diplomatic backing.\n\nWhile operating in OPEC+ countries has historically been challenging due to nationalization, strict contracts, and instability, recent efforts seek to tap into aging fields by offering more favorable terms to international investors, including Exxon and Chevron. These deals align with the US goal of “energy dominance” and aim to secure fossil fuel supplies through the 2040s. Examples include agreements to explore Iraq’s Majnoon and Nasiriyah fields, interest in West Qurna 2, and talks with Libya to boost production. US companies see advantage over European peers due to direct government support.\n\nBeyond the Middle East, Exxon and Chevron have expanded in Angola, Greece, Egypt, Trinidad & Tobago, Suriname, Kazakhstan, and Turkey. They are carefully selecting projects balancing geology, commercial terms, and geopolitical risks. Increased negotiation leverage arises from pursuing multiple opportunities simultaneously. However, past experiences warn of risks like nationalization, political instability, and volatile oil markets, which require cautious strategic choices."
    },
    {
      "heading": "US Probes Netflix Tactics in Review of Warner Deal, WSJ Says",
      "date": "2026-02-06",
      "tickers": [
        "NFLX"
      ],
      "summary": "The U.S. Justice Department is investigating Netflix Inc.'s business practices in connection with its proposed acquisition of Warner Bros. Discovery Inc.'s studios and HBO Max streaming service, according to the Wall Street Journal. The agency has issued a subpoena to an unspecified competitor, requesting information on whether Netflix has engaged in exclusionary conduct that could consolidate market or monopoly power. The Justice Department is also examining a competing acquisition proposal by Paramount Skydance Corp. to buy Warner Bros., which Warner has urged shareholders to reject. The subpoena seeks input on whether either deal might harm competition. Netflix has characterized the inquiry as a routine review of its merger proposal and stated it is unaware of any investigation beyond the standard process. The Justice Department declined to comment on the matter."
    },
    {
      "heading": "Watchlist - Bloomberg",
      "date": "2026-02-06",
      "tickers": [],
      "summary": "Please provide the financial news article text you would like summarized."
    }
  ],
  "WSJ": [
    {
      "heading": "Corning Stock Has First Record Close Since the Dot-Com Bubble",
      "date": "2026-02-06",
      "tickers": [],
      "summary": "Corning Inc. stock closed at a record high of $122.16 on Friday, rising 8.3% and surpassing its previous peak of $113.10 set on September 1, 2000. The stock has increased roughly 40% since the beginning of the year and is up 131% over the last 12 months. This surge follows Corning’s announcement on January 27 of a multiyear agreement to supply Meta Platforms with cabling, optical fiber, and connectivity solutions for data centers across the U.S., which initially drove the stock up 16%. Despite strong fourth-quarter earnings and revenue reported on January 28, shares fell 5% that day, likely due to profit-taking after the prior day’s gains.\n\nCorning manufactures glass products, including those used in Apple’s iPhone screens, as well as optical fiber and cabling—key components for data centers supporting artificial intelligence (AI) infrastructure. The company’s growth prospects are tied to the AI sector’s expansion, with analysts highlighting multiple long-term opportunities. Oppenheimer analyst Martin Yang maintains an Outperform rating and a $120 price target, noting that the Meta deal is part of broader growth potential in Corning’s Optical segment, positioning the company as an AI infrastructure investment.\n\nThe recent rise in Corning’s stock reflects strong investor interest in AI-related technology companies, with the current price reaching levels not seen in over 20 years."
    },
    {
      "heading": "Stock Market Survives AI Panic, Even as Tech Collapses. It’s a Monster of Our Own Making.",
      "date": "2026-02-06",
      "tickers": [],
      "summary": "The stock market experienced volatility this past week, largely driven by shifting investor sentiment toward artificial intelligence (AI). Despite concerns and declines in AI-related and software stocks, the Dow Jones Industrial Average surpassed 50,000 points for the first time. Several companies, including Thomson Reuters, PayPal, and Verisk Analytics, saw their worst weekly performances, dropping over 15%, while sectors like information technology fell more than 2%. Investor skepticism grew as firms that announced large AI infrastructure spending, notably Amazon and Alphabet, saw their shares fall sharply. Amazon plans to spend $200 billion on AI this year, while Alphabet estimates $175 billion to $185 billion in AI-related expenses. The broader consumer discretionary and communications sectors also declined alongside technology. \n\nLabor market concerns added to market jitters, with U.S. job cuts in January rising to 108,435, the highest for the month since 2009. About 7% of these layoffs cited AI as a factor, signaling early impacts of automation on employment. Despite these challenges, defensive sectors like consumer staples gained, and areas such as energy, industrials, and materials saw gains above 4%, aided by strong performances from companies including Caterpillar and 3M.\n\nEarnings reports underscored overall corporate health, and the recent market correction helped adjust valuations. The S&P 500, Dow, and Nasdaq rebounded on Friday, indicating investors were willing to buy the recent dip, although the Nasdaq remains down for the year. Overall, market fundamentals remain solid, and while caution around AI spending persists, the broader economic outlook appears stable."
    },
    {
      "heading": "Elon Is Always Selling . . . Like any Revolutionary",
      "date": "2026-02-06",
      "tickers": [
        "TSLA"
      ],
      "summary": "Elon Musk, once a vocal advocate for climate issues, has recently shifted focus away from environmental rhetoric, notably absent during the announcement of the merger between his SpaceX and xAI companies. This merger aims to develop AI data centers in space powered by carbon-free solar energy, aligning with climate benefits. Musk’s strategic timing coincides with preparations for a SpaceX initial public offering (IPO) expected in June. Although SpaceX partners are primarily space enthusiasts, they may be less supportive of the financially struggling social media and AI aspects of Musk’s portfolio, including the rebranded Twitter, X, which reportedly loses about $1 billion monthly.\n\nMusk’s success relies heavily on his controlling stakes in these ventures and his ability to maintain investor confidence, despite uncertainties about Tesla’s future profits, which currently values the company at $1.3 trillion. His persistence and maneuvering have revolutionized industries—from electric vehicles to space launch—despite regulatory and political challenges. Four years after buying Twitter at a high cost, Musk’s move to merge SpaceX with his AI initiatives signals an intent to eventually relist the technology publicly, positioning space as the optimal location for AI power in the next three years.\n\nThe article also references growing opposition from political figures like Gov. Ron DeSantis and Sen. Bernie Sanders to the proliferation of resource-intensive AI data centers on Earth, reflecting broader societal unease about AI’s expansion. Analysts increasingly view SpaceX as Musk’s most significant achievement in delivering his visionary goals, compared to his more volatile ventures. The historical analogy to Samuel Insull, a 1920s utility tycoon whose fortunes collapsed amid technological upheaval, is drawn to highlight the risks Musk faces amid rapid innovation and market volatility."
    },
    {
      "heading": "Molina Healthcare Stock Notches Lowest Close in Six Years. Why Its Earnings Outlook Is So Bleak.",
      "date": "2026-02-06",
      "tickers": [],
      "summary": "Shares of Molina Healthcare dropped 26% to $131.72, the largest single-day percentage decline since June 2012 and its lowest close since March 2020, following a disappointing earnings outlook for 2026. The insurer reported a fourth-quarter loss of $2.75 per share on revenue of $11.4 billion, missing Wall Street expectations of a 34-cent profit on $10.9 billion in revenue. Molina’s full-year earnings guidance of $5 per share sharply missed the $13.22 analyst consensus.\n\nThe company attributed the weak outlook to a new Medicaid contract and underperformance in its Medicare Advantage Part D product. Molina also projected a decline in Affordable Care Act Marketplace membership from 713,000 at the end of Q3 to 220,000 by the end of 2026. CEO Joe Zubretsky cited persistent medical cost pressures in Medicare and the Marketplace segment, describing 2026 as a “trough year” for Medicaid margins. He expressed confidence in the company’s long-term operating platform as market rates normalize.\n\nThe broader healthcare insurer sector showed mixed reactions. Centene’s shares fell 3.7% after reporting a narrower-than-expected fourth-quarter loss and issuing 2026 earnings guidance around $3 per share, aligning with expectations. Elevance Health gained 2%, with management also calling 2026 a “trough year” as per their January earnings report. UnitedHealth Group rose 3%, despite reporting softer-than-expected Q4 revenue and an underwhelming full-year outlook last month.\n\nThe sector faces ongoing uncertainty amid the Trump administration’s proposal for flat Medicare rates in 2027, below analyst forecasts, and recent weak earnings reports from major insurers."
    },
    {
      "heading": "Stock Market Survives AI Panic, Even as Tech Collapses. It’s a Monster of Our Own Making.",
      "date": "2026-02-06",
      "tickers": [
        "AMZN",
        "GOOGL",
        "CAT"
      ],
      "summary": "Last week, despite investor concerns over artificial intelligence (AI), the Dow Jones Industrial Average surpassed 50,000 points for the first time. The market experienced notable declines, especially in software and tech-related sectors, as companies like Thomson Reuters, PayPal, and Verisk Analytics recorded their worst weekly performances, each dropping over 15%. Other firms including Oracle, S&P Global, and Booking Holdings also saw significant losses, with the information technology sector falling more than 2%.\n\nInvestor sentiment toward AI shifted, with increased skepticism about companies heavily investing in AI without clear returns. Amazon and Alphabet shares fell sharply following announcements of large AI infrastructure expenditures—$200 billion for Amazon and up to $185 billion for Alphabet—impacting consumer discretionary and communications services sectors. Bitcoin also experienced a substantial drop during the week but rebounded somewhat on Friday.\n\nLabor market concerns added pressure, as U.S. job cut announcements in January doubled compared to the previous year, reaching the highest January total since 2009. About 7% of these layoffs were attributed to AI-related productivity improvements.\n\nBy week’s end, the market recovered, with consumer staples leading gains and energy, industrials, and materials sectors rising over 4%. Companies like Caterpillar and 3M contributed to the Dow’s positive momentum. Overall, earnings reports indicated stable company fundamentals, and the recent market pullback helped adjust valuations. The S&P 500, Dow, and Nasdaq rebounded on Friday, suggesting investors capitalized on lower prices, although the Nasdaq remained down 0.9% for the year.\n\nIn summary, while AI concerns influenced a volatile week, broad market fundamentals remain solid, and the market showed resilience with a rebound in several sectors."
    }
  ],
  "Reuters": [
    {
      "heading": "Apple plans to allow external voice-controlled AI chatbots in CarPlay, Bloomberg News reports",
      "date": "2026-02-06",
      "tickers": [
        "AAPL",
        "GOOGL"
      ],
      "summary": "Apple is preparing to allow third-party voice-controlled AI applications to operate through its CarPlay interface, Bloomberg News reported, citing sources. This marks a departure from Apple's previous policy of exclusively permitting its Siri assistant for voice control in CarPlay. Users will be able to interact with AI chatbots from other companies, including OpenAI, Anthropic, and Alphabet’s Google, within the CarPlay environment. However, Apple will not permit users to replace the dedicated Siri button or change the Siri wake word; instead, activation of third-party voice control will require opening the respective app. Apple plans to support these apps in CarPlay within the next month, enabling developers to create apps that launch directly into voice mode when opened. Apple declined to comment on the report."
    },
    {
      "heading": "Dow Jones Industrial Average breaks 50,000 level for first time",
      "date": "2026-02-06",
      "tickers": [
        "CAT",
        "GS",
        "NVDA"
      ],
      "summary": "On February 6, 2026, the Dow Jones Industrial Average closed above the 50,000 mark for the first time, finishing at 50,115.67, up 1,206.95 points or 2.47% for the day. This milestone reflects the Dow’s strong performance, rising 4.3% year-to-date, compared to the S&P 500’s 1.3% gain and the Nasdaq’s 0.9% decline for 2026. Caterpillar was the top contributor, increasing 7.1% to $726.20 and gaining approximately 27% so far this year after a 50% gain in 2025. Other notable contributors included Goldman Sachs, up 4.3%, and Nvidia, which rose 7.9% after recent losses but remains down 0.6% year-to-date. Nvidia replaced Intel in the Dow in November 2024, enhancing the index’s exposure to AI-related stocks.\n\nThe Dow’s price-weighted structure and its mix of blue-chip and economically sensitive companies have attracted investors diversifying away from tech stocks amid recent market volatility linked to artificial intelligence concerns. This shift has benefited companies like Caterpillar, which also sees gains from AI-related investments. Positive market sentiment was supported by expectations that the Federal Reserve will continue lowering interest rates in 2026 without hindering economic growth, a factor that previously helped the Dow surpass 40,000 points in May 2024."
    },
    {
      "heading": "Exclusive: Vista Equity Partners and Intel to lead investment in AI chip startup SambaNova, sources say",
      "date": "2026-02-06",
      "tickers": [
        "NVDA",
        "INTC"
      ],
      "summary": "Private equity firm Vista Equity Partners is leading a Series E funding round of over $350 million in AI chip startup SambaNova Systems, marking Vista’s rare investment outside its usual enterprise software focus. Vista is partnering with venture capital firm Cambium Capital. Existing investor Intel Corp plans to invest about $100 million, potentially increasing to $150 million, in the oversubscribed round. SambaNova aims to use the funds to compete with Nvidia in the AI inference chip market amid growing demand.\n\nThe valuation of this round was not disclosed, and fundraising terms may change. Intel CEO Lip-Bu Tan, also SambaNova’s executive chairman, had earlier discussed a potential $1.6 billion acquisition of SambaNova, but talks stalled. SambaNova, valued at $5 billion in 2021, has faced challenges including layoffs in 2024 and has shifted focus to AI inference and cloud services, reporting it recently surpassed its fiscal year sales targets.\n\nThis investment occurs as software stocks experience significant selloffs following a reevaluation of AI’s impact, while interest in AI hardware grows. Other AI chipmakers like Cerebras Systems and Groq have recently secured substantial funding or deals, highlighting competition in the AI hardware sector. SambaNova has raised over $1 billion in total since its 2017 founding. Vista, with $100 billion in assets, is known for large software acquisitions, including Citrix Systems in 2022 and Nexthink in 2025."
    },
    {
      "heading": "My News",
      "date": "2026-02-06",
      "tickers": [],
      "summary": "Please provide the financial news article you would like summarized."
    },
    {
      "heading": "Super Bowl LX highlights more than just San Francisco in the Bay Area",
      "date": "2026-02-06",
      "tickers": [
        "NVDA",
        "AMD",
        "INTC"
      ],
      "summary": "The Super Bowl LX between the New England Patriots and Seattle Seahawks is officially hosted in Santa Clara, California, located about 50 miles south of San Francisco. While San Francisco receives much of the public attention for its large parties, celebrity presence, and fan events near downtown, key game activities are centered in Santa Clara and neighboring San Jose.\n\nSan Jose, with over one million residents, is hosting a weeklong series of Super Bowl-related events including concerts and drone shows. Mayor Matt Mahan, who recently launched a campaign for California governor, emphasized San Jose’s growing role in leveraging the event’s economic benefits, contrasting it with Super Bowl 50 when most benefits went to San Francisco. The city has booked nearly all hotel rooms in anticipation of the influx.\n\nSanta Clara, with a population of about 130,000, is home to Levi’s Stadium, the game venue, and major Silicon Valley tech companies such as Nvidia, AMD, and Intel. The city expects over 100,000 visitors on game day for attendance and related festivities. Mayor Lisa Gillmor highlighted Santa Clara’s experience hosting NFL games and large events, noting that the Super Bowl and upcoming FIFA World Cup events are even larger undertakings requiring extensive coordination.\n\nDespite these activities, San Francisco continues to receive more media attention during the Super Bowl. Santa Clara officials express a need for greater recognition reflecting their central role."
    },
    {
      "heading": "Union approves contract negotiated with Marathon for 30,000 oil industry workers",
      "date": "2026-02-06",
      "tickers": [],
      "summary": "The United Steelworkers (USW) union has approved a new four-year national contract with Marathon Petroleum, covering approximately 30,000 oil industry workers at refineries and chemical plants. The agreement includes a 15% total wage increase for hourly employees, comprising 4% raises in the first and fourth years and 3.5% raises in the second and third years. A $2,500 signing bonus is also part of the deal. \n\nMarathon Petroleum led negotiations on behalf of 26 U.S. refining and chemical companies, including ExxonMobil, Chevron, and Valero Energy. The USW represents workers at facilities responsible for around two-thirds of U.S. crude oil refining capacity. \n\nEarlier proposals were rejected during negotiations that began in late January. Union officials consulted with local unions before accepting what Marathon described as its final offer. Initial union demands sought a 16% wage increase, while some members aimed for a 25% raise with cost-of-living adjustments tied to inflation.\n\nThe agreement will gradually replace the existing contract as it is adopted across worksites. The previous contract had been extended on a rolling basis just prior to its expiration on February 1. The average inside operator at a refinery currently earns about $50 per hour."
    }
  ]
}