{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nsales, company, iphone, other, during, tariffs, fiscal, measures, financial, results\n\nTEXT: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nTEXT: The following discussion should be read in conjunction with the consolidated financial statements and accompanying notes included in Part II, Item 8 of this Form 10-K. This Item generally discusses 2025 and 2024 items and year-to-year comparisons between 2025 and 2024. Discussions of 2023 items and year-to-year comparisons between 2024 and 2023 are not included, and can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended September 28, 2024.\nTITLE: Product, Service and Software Announcements\nTEXT: The Company announces new product, service and software offerings at various times during the year. Significant announcements during fiscal year 2025 included the following:\nTEXT: •iOS 26, macOS Tahoe 26, iPadOS 26, watchOS 26, visionOS 26 and tvOS 26\nTEXT: •iPhone 17, iPhone Air, iPhone 17 Pro and iPhone 17 Pro Max\nTEXT: •Apple Watch Series 11, Apple Watch SE 3 and Apple Watch Ultra 3\nTITLE: Fiscal Period\nTEXT: The Company’s fiscal year is the 52- or 53-week period that ends on the last Saturday of September. An additional week is included in the first fiscal quarter every five or six years to realign the Company’s fiscal quarters with calendar quarters, which occurred in the first quarter of 2023. The Company’s fiscal years 2025 and 2024 spanned 52 weeks each, whereas fiscal year 2023 spanned 53 weeks.\nTITLE: Macroeconomic Conditions\nTEXT: Macroeconomic conditions, including inflation, interest rates and currency fluctuations, have directly and indirectly impacted, and could in the future materially impact, the Company’s results of operations and financial condition.\nTEXT: Apple Inc. | 2025 Form 10-K | 21\nTITLE: Tariffs and Other Measures\nTEXT: Beginning in the second quarter of 2025, new U.S. Tariffs were announced, including additional tariffs on imports from China, India, Japan, South Korea, Taiwan, Vietnam and the EU, among others. In response, several countries have imposed, or threatened to impose, reciprocal tariffs on imports from the U.S. and other retaliatory measures. Various modifications to the U.S. Tariffs have been announced and further changes could be made in the future, which may include additional sector-based tariffs or other measures. For example, the U.S. Department of Commerce has initiated an investigation under Section 232 of the Trade Expansion Act of 1962, as amended, into, among other things, imports of semiconductors, semiconductor manufacturing equipment, and their derivative products, including downstream products that contain semiconductors. Tariffs and other measures that are applied to the Company’s products or their components can have a material adverse impact on the Company’s business, results of operations and financial condition, including impacting the Company’s supply chain, the availability of rare earths and other raw materials and components, pricing and gross margin. The ultimate impact remains uncertain and will depend on several factors, including whether additional or incremental U.S. Tariffs or other measures are announced or imposed, to what extent other countries implement tariffs or other retaliatory measures in response, and the overall magnitude and duration of these measures. Trade and other international disputes can have an adverse impact on the overall macroeconomic environment and result in shifts and reductions in consumer spending and negative consumer sentiment for the Company’s products and services, all of which can further adversely affect the Company’s business and results of operations.\nTITLE: Segment Operating Performance\nTEXT: The following table shows net sales by reportable segment for 2025, 2024 and 2023 (dollars in millions):\nTEXT: 2025Change2024Change2023Americas$178,353 7 %$167,045 3 %$162,560 Europe111,032 10 %101,328 7 %94,294 Greater China64,377 (4)%66,952 (8)%72,559 Japan28,703 15 %25,052 3 %24,257 Rest of Asia Pacific33,696 10 %30,658 4 %29,615 Total net sales$416,161 6 %$391,035 2 %$383,285\nTABLE: TABLE_ROW: Americas — 2025: 178,353; 2024: 7; 2023: 167,045\nTABLE_ROW: Europe — 2025: 111,032; 2024: 10; 2023: 101,328\nTABLE_ROW: Greater China — 2025: 64,377; 2024: (4); 2023: 66,952\nTABLE_ROW: Japan — 2025: 28,703; 2024: 15; 2023: 25,052\nTABLE_ROW: Rest of Asia Pacific — 2025: 33,696; 2024: 10; 2023: 30,658\nTABLE_ROW: Total net sales — 2025: 416,161; 2024: 6; 2023: 391,035\nTITLE: 2025Change2024Change2023\nTITLE: 2025\nTITLE: Change\nTITLE: 2024\nTITLE: Change\nTITLE: 2023\nTEXT: Americas net sales increased during 2025 compared to 2024 primarily due to higher net sales of iPhone and Services. The weakness in foreign currencies relative to the U.S. dollar had an unfavorable year-over-year impact on Americas net sales during 2025.\nTEXT: Europe net sales increased during 2025 compared to 2024 primarily due to higher net sales of Services, iPhone and Mac.\nTEXT: Greater China net sales decreased during 2025 compared to 2024 primarily due to lower net sales of iPhone, partially offset by higher net sales of Mac.\nTEXT: Japan net sales increased during 2025 compared to 2024 primarily due to higher net sales of iPhone, Services and iPad.\nTEXT: Rest of Asia Pacific net sales increased during 2025 compared to 2024 primarily due to higher net sales of iPhone, Services and Mac.\nTEXT: Apple Inc. | 2025 Form 10-K | 22\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nsales, services, gross, during, primarily, margin, products, percentage, total, increased\n\nTITLE: Products and Services Performance\nTEXT: The following table shows net sales by category for 2025, 2024 and 2023 (dollars in millions):\nTEXT: 2025Change2024Change2023iPhone$209,586 4 %$201,183 — %$200,583 Mac33,708 12 %29,984 2 %29,357 iPad28,023 5 %26,694 (6)%28,300 Wearables, Home and Accessories35,686 (4)%37,005 (7)%39,845 Services (1)109,158 14 %96,169 13 %85,200 Total net sales$416,161 6 %$391,035 2 %$383,285\nTABLE: TABLE_ROW: iPhone — 2025: 209,586; 2024: 4; 2023: 201,183\nTABLE_ROW: Mac — 2025: 33,708; 2024: 12; 2023: 29,984\nTABLE_ROW: iPad — 2025: 28,023; 2024: 5; 2023: 26,694\nTABLE_ROW: Wearables, Home and Accessories — 2025: 35,686; 2024: (4); 2023: 37,005\nTABLE_ROW: Services (1) — 2025: 109,158; 2024: 14; 2023: 96,169\nTABLE_ROW: Total net sales — 2025: 416,161; 2024: 6; 2023: 391,035\nTITLE: 2025Change2024Change2023\nTITLE: 2025\nTITLE: Change\nTITLE: 2024\nTITLE: Change\nTITLE: 2023\nTEXT: (1)Services net sales include amortization of the deferred value of services bundled in the sales price of certain products.\nTEXT: iPhone net sales increased during 2025 compared to 2024 due to higher net sales of Pro models.\nTEXT: Mac net sales increased during 2025 compared to 2024 primarily due to higher net sales of laptops and desktops.\nTEXT: iPad net sales increased during 2025 compared to 2024 primarily due to higher net sales of iPad Air, iPad mini and iPad, partially offset by lower net sales of iPad Pro.\nTEXT: Wearables, Home and Accessories\nTEXT: Wearables, Home and Accessories net sales decreased during 2025 compared to 2024 primarily due to lower net sales of Accessories and Wearables.\nTEXT: Services net sales increased during 2025 compared to 2024 primarily due to higher net sales from advertising, the App Store and cloud services.\nTEXT: Apple Inc. | 2025 Form 10-K | 23\nTITLE: Gross Margin\nTEXT: Products and Services gross margin and gross margin percentage for 2025, 2024 and 2023 were as follows (dollars in millions):\nTEXT: 202520242023Gross margin:Products$112,887 $109,633 $108,803 Services82,314 71,050 60,345 Total gross margin$195,201 $180,683 $169,148\nTABLE: TABLE_ROW: Products — 2025: 112,887; 2024: 109,633; 2023: 108,803\nTABLE_ROW: Services — 2025: 82,314; 2024: 71,050; 2023: 60,345\nTABLE_ROW: Total gross margin — 2025: 195,201; 2024: 180,683; 2023: 169,148\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTEXT: Gross margin percentage:Products36.8%37.2%36.5%Services75.4%73.9%70.8%Total gross margin percentage46.9%46.2%44.1%\nTABLE: TABLE: Products 36.8 % 37.2 % 36.5 %; Services 75.4 % 73.9 % 70.8 %; Total gross margin percentage 46.9 % 46.2 % 44.1 %.\nTEXT: Products gross margin increased during 2025 compared to 2024 primarily due to favorable costs and a different mix of products, partially offset by tariff costs.\nTEXT: Products gross margin percentage decreased during 2025 compared to 2024 primarily due to a different mix of products and tariff costs, partially offset by other favorable costs.\nTEXT: Services gross margin increased during 2025 compared to 2024 primarily due to higher Services net sales and a different mix of services.\nTEXT: Services gross margin percentage increased during 2025 compared to 2024 primarily due to a different mix of services, partially offset by higher costs.\nTEXT: The Company’s future gross margins can be impacted by a variety of factors, as discussed in Part I, Item 1A of this Form 10-K under the heading “Risk Factors.” As a result, the Company believes, in general, gross margins will be subject to volatility and downward pressure.\nTITLE: Operating Expenses\nTEXT: Operating expenses for 2025, 2024 and 2023 were as follows (dollars in millions):\nTEXT: 2025Change2024Change2023Research and development$34,550 10 %$31,370 5 %$29,915 Percentage of total net sales8%8%8%Selling, general and administrative$27,601 6 %$26,097 5 %$24,932 Percentage of total net sales7%7%7%Total operating expenses$62,151 8 %$57,467 5 %$54,847 Percentage of total net sales15%15%14%\nTABLE: TABLE_ROW: Research and development — 2025: 34,550; 2024: 10; 2023: 31,370\nTABLE_ROW: Percentage of total net sales — 2025: 8; 2024: 8; 2023: 8\nTABLE_ROW: Selling, general and administrative — 2025: 27,601; 2024: 6; 2023: 26,097\nTABLE_ROW: Percentage of total net sales — 2025: 7; 2024: 7; 2023: 7\nTABLE_ROW: Total operating expenses — 2025: 62,151; 2024: 8; 2023: 57,467\nTABLE_ROW: Percentage of total net sales — 2025: 15; 2024: 15; 2023: 14\nTITLE: 2025Change2024Change2023\nTITLE: 2025\nTITLE: Change\nTITLE: 2024\nTITLE: Change\nTITLE: 2023\nTEXT: The growth in R&D expense during 2025 compared to 2024 was primarily driven by increases in headcount-related expenses and infrastructure-related costs.\nTEXT: Selling, General and Administrative\nTEXT: The growth in selling, general and administrative expense during 2025 compared to 2024 was primarily driven by increases in headcount-related expenses and variable selling expenses.\nTEXT: Apple Inc. | 2025 Form 10-K | 24\nTITLE: Provision for Income Taxes\nTEXT: Provision for income taxes, effective tax rate and statutory federal income tax rate for 2025, 2024 and 2023 were as follows (dollars in millions):\nTEXT: 202520242023Provision for income taxes$20,719 $29,749 $16,741 Effective tax rate15.6%24.1%14.7%Statutory federal income tax rate21%21%21%\nTABLE: TABLE_ROW: Provision for income taxes — 2025: 20,719; 2024: 29,749; 2023: 16,741\nTABLE_ROW: Effective tax rate — 2025: 15.6; 2024: 24.1; 2023: 14.7\nTABLE_ROW: Statutory federal income tax rate — 2025: 21; 2024: 21; 2023: 21\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, payable, september, months, obligations, cash, within, rate, share, notes\n\nTITLE: 2023\nTEXT: The Company’s effective tax rate for 2025 was lower than the statutory federal income tax rate primarily due to a lower effective tax rate on foreign earnings, including the impact of changes in unrecognized tax benefits, the impact of the U.S. federal R&D credit, and tax benefits from share-based compensation, partially offset by a change in valuation allowance and state income taxes.\nTEXT: The Company’s effective tax rate for 2025 was lower compared to 2024 due to a $10.7 billion year-over-year decrease in the provision for income taxes related to the State Aid Decision (refer to Note 7, “Income Taxes” in the Notes to Consolidated Financial Statements in Part II, Item 8 of this Form 10-K) and the impact of changes in unrecognized tax benefits, partially offset by a change in valuation allowance and a higher effective tax rate on foreign earnings.\nTITLE: Liquidity and Capital Resources\nTEXT: The Company believes its balances of cash, cash equivalents and marketable securities, which totaled $132.4 billion as of September 27, 2025, along with cash generated by ongoing operations and continued access to debt markets, will be sufficient to satisfy its cash requirements and capital return program over the next 12 months and beyond.\nTEXT: The Company’s material cash requirements include the following contractual obligations:\nTEXT: As of September 27, 2025, the Company had outstanding fixed-rate notes with varying maturities for an aggregate principal amount of $91.3 billion (collectively the “Notes”), with $12.4 billion payable within 12 months. Future interest payments associated with the Notes total $37.0 billion, with $2.6 billion payable within 12 months.\nTEXT: The Company also issues unsecured short-term promissory notes pursuant to a commercial paper program. As of September 27, 2025, the Company had $8.0 billion of commercial paper outstanding, which was payable within 12 months.\nTEXT: The Company has lease arrangements for certain equipment and facilities, including corporate, data center, manufacturing and retail space. As of September 27, 2025, the Company had fixed lease payment obligations of $16.8 billion, with $2.6 billion payable within 12 months.\nTEXT: Manufacturing Purchase Obligations\nTEXT: The Company utilizes several outsourcing partners to manufacture subassemblies for the Company’s products and to perform final assembly and testing of finished products. The Company also obtains individual components for its products from a wide variety of individual suppliers. As of September 27, 2025, the Company had manufacturing purchase obligations of $56.2 billion, with $55.4 billion payable within 12 months.\nTEXT: The Company’s other purchase obligations primarily consist of noncancelable obligations to acquire capital assets, including assets related to product manufacturing, and noncancelable obligations related to supplier arrangements, licensed intellectual property and content, and distribution rights. As of September 27, 2025, the Company had other purchase obligations of $14.8 billion, with $7.0 billion payable within 12 months.\nTEXT: Deemed Repatriation Tax Payable\nTEXT: As of September 27, 2025, the balance of the deemed repatriation tax payable imposed by the U.S. Tax Cuts and Jobs Act of 2017 (“TCJA”) was $8.8 billion, which was payable within 12 months.\nTEXT: Apple Inc. | 2025 Form 10-K | 25\nTEXT: In addition to its contractual cash requirements, the Company has an authorized share repurchase program. The program does not obligate the Company to acquire a minimum amount of shares. As of September 27, 2025, the Company’s quarterly cash dividend was $0.26 per share. The Company intends to increase its dividend on an annual basis, subject to declaration by the Board.\nTEXT: In May 2025, the Company announced a new share repurchase program of up to $100 billion and raised its quarterly dividend from $0.25 to $0.26 per share beginning in May 2025. During 2025, the Company repurchased $89.3 billion of its common stock and paid dividends and dividend equivalents of $15.4 billion.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, income, will, financial, accounting, software, which, management, disaggregation, require\n\nTITLE: Recent Accounting Pronouncements\nTEXT: In September 2025, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) No. 2025-06, Intangibles—Goodwill and Other—Internal-Use Software (Subtopic 350-40): Targeted Improvements to the Accounting for Internal-Use Software (“ASU 2025-06”), which modernizes the accounting for internal-use software. ASU 2025-06 removes all references to software development stages and requires capitalization of software costs when management has committed to the software project and it is probable the software will be completed and perform its intended use. ASU 2025-06 will be effective for the Company in its first quarter of 2029, and early adoption is permitted. The Company is currently evaluating the timing and method of its adoption of ASU 2025-06.\nTEXT: Disaggregation of Income Statement Expenses\nTEXT: In November 2024, the FASB issued ASU No. 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses (“ASU 2024-03”) and in January 2025, the FASB issued ASU No. 2025-01, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Clarifying the Effective Date, which clarified the effective date of ASU 2024-03. ASU 2024-03 will require the Company to disclose the amounts of purchases of inventory, employee compensation, depreciation and intangible asset amortization, as applicable, included in certain expense captions in the Consolidated Statements of Operations, as well as qualitatively describe remaining amounts included in those captions. ASU 2024-03 will also require the Company to disclose both the amount and the Company’s definition of selling expenses. The Company will adopt ASU 2024-03 in its fourth quarter of 2028 using a prospective transition method.\nTEXT: In December 2023, the FASB issued ASU No. 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures (“ASU 2023-09”), which will require the Company to disclose specified additional information in its income tax rate reconciliation and provide additional information for reconciling items that meet a quantitative threshold. ASU 2023-09 will also require the Company to disaggregate its income taxes paid disclosure by federal, state and foreign taxes, with further disaggregation required for significant individual jurisdictions. The Company will adopt ASU 2023-09 in its fourth quarter of 2026 using a prospective transition method.\nTITLE: Critical Accounting Estimates\nTEXT: The preparation of financial statements and related disclosures in conformity with U.S. generally accepted accounting principles (“GAAP”) and the Company’s discussion and analysis of its financial condition and operating results require the Company’s management to make judgments, assumptions and estimates that affect the amounts reported. Note 1, “Summary of Significant Accounting Policies” of the Notes to Consolidated Financial Statements in Part II, Item 8 of this Form 10-K describes the significant accounting policies and methods used in the preparation of the Company’s consolidated financial statements. Management bases its estimates on historical experience and on various other assumptions it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities.\nTEXT: The Company is subject to income taxes in the U.S. and numerous foreign jurisdictions. The evaluation of the Company’s uncertain tax positions involves significant judgment in the interpretation and application of GAAP and complex domestic and international tax laws, including the TCJA and the allocation of international taxation rights between countries. Although management believes the Company’s reserves are reasonable, no assurance can be given that the final outcome of these uncertainties will not be different from that reflected in the Company’s reserves. Reserves are adjusted considering changing facts and circumstances, such as the closing of a tax examination. Resolution of these uncertainties in a manner inconsistent with management’s expectations could have a material impact on the Company’s financial condition and operating results.\nTEXT: Apple Inc. | 2025 Form 10-K | 26\nTEXT: The Company is subject to various legal proceedings and claims that arise in the ordinary course of business, the outcomes of which are inherently uncertain. The Company records a liability when it is probable a loss has been incurred and the amount is reasonably estimable, the determination of which requires significant judgment. Resolution of legal matters in a manner inconsistent with management’s expectations could have a material impact on the Company’s financial condition and operating results.\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nseptember, consolidated, statements, income, financial, notes, sales, share, total, operating\n\nTEXT: Financial Statements and Supplementary Data\nTEXT: Index to Consolidated Financial StatementsPageConsolidated Statements of Operations for the years ended September 27, 2025, September 28, 2024 and September 30, 202329Consolidated Statements of Comprehensive Income for the years ended September 27, 2025, September 28, 2024 and September 30, 202330Consolidated Balance Sheets as of September 27, 2025 and September 28, 202431Consolidated Statements of Shareholders’ Equity for the years ended September 27, 2025, September 28, 2024 and September 30, 202332Consolidated Statements of Cash Flows for the years ended September 27, 2025, September 28, 2024 and September 30, 202333Notes to Consolidated Financial Statements34Reports of Independent Registered Public Accounting Firm49\nTABLE: TABLE: Index to Consolidated Financial Statements Page; Consolidated Statements of Operations for the years ended September 27, 2025, September 28, 2024 and September 30, 2023 29; Consolidated Statements of Comprehensive Income for the years ended September 27, 2025, September 28, 2024 and September 30, 2023 30; Consolidated Balance Sheets as of September 27, 2025 and September 28, 2024 31; Consolidated Statements of Shareholders’ Equity for the years ended September 27, 2025, September 28, 2024 and September 30, 2023 32; Consolidated Statements of Cash Flows for the years ended September 27, 2025, September 28, 2024 and September 30, 2023 33; Notes to Consolidated Financial Statements 34; Reports of Independent Registered Public Accounting Firm 49.\nTITLE: Index to Consolidated Financial StatementsPage\nTITLE: Index to Consolidated Financial Statements\nTITLE: Page\nTEXT: Consolidated Statements of Operations for the years ended September 27, 2025, September 28, 2024 and September 30, 2023\nTEXT: Consolidated Statements of Comprehensive Income for the years ended September 27, 2025, September 28, 2024 and September 30, 2023\nTEXT: Consolidated Balance Sheets as of September 27, 2025 and September 28, 2024\nTEXT: Consolidated Statements of Shareholders’ Equity for the years ended September 27, 2025, September 28, 2024 and September 30, 2023\nTEXT: Consolidated Statements of Cash Flows for the years ended September 27, 2025, September 28, 2024 and September 30, 2023\nTEXT: Notes to Consolidated Financial Statements\nTEXT: Reports of Independent Registered Public Accounting Firm\nTEXT: All financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the consolidated financial statements and accompanying notes.\nTEXT: Apple Inc. | 2025 Form 10-K | 28\nTITLE: Apple Inc.\nTITLE: CONSOLIDATED STATEMENTS OF OPERATIONS\nTEXT: (In millions, except number of shares, which are reflected in thousands, and per-share amounts)\nTEXT: Years endedSeptember 27,2025September 28,2024September 30,2023Net sales: Products$307,003 $294,866 $298,085 Services109,158 96,169 85,200 Total net sales416,161 391,035 383,285 Cost of sales: Products194,116 185,233 189,282 Services26,844 25,119 24,855 Total cost of sales220,960 210,352 214,137 Gross margin195,201 180,683 169,148 Operating expenses:Research and development34,550 31,370 29,915 Selling, general and administrative27,601 26,097 24,932 Total operating expenses62,151 57,467 54,847 Operating income133,050 123,216 114,301 Other income/(expense), net(321)269 (565)Income before provision for income taxes132,729 123,485 113,736 Provision for income taxes20,719 29,749 16,741 Net income$112,010 $93,736 $96,995 Earnings per share:Basic$7.49 $6.11 $6.16 Diluted$7.46 $6.08 $6.13 Shares used in computing earnings per share:Basic14,948,500 15,343,783 15,744,231 Diluted15,004,697 15,408,095 15,812,547\nTABLE: TABLE: September 27,2025 September 28,2024 September 30,2023; Products $ 307,003 $ 294,866 $ 298,085; Services 109,158 96,169 85,200; Total net sales 416,161 391,035 383,285; Products 194,116 185,233 189,282; Services 26,844 25,119 24,855; Total cost of sales 220,960 210,352 214,137; Gross margin 195,201 180,683 169,148; Research and development 34,550 31,370 29,915; Selling, general and administrative 27,601 26,097 24,932; Total operating expenses 62,151 57,467 54,847; Operating income 133,050 123,216 114,301; Other income/(expense), net (321) 269 (565); Income before provision for income taxes 132,729 123,485 113,736; Provision for income taxes 20,719 29,749 16,741; Net income $ 112,010 $ 93,736 $ 96,995; Basic $ 7.49 $ 6.11 $ 6.16; Diluted $ 7.46 $ 6.08 $ 6.13; Basic 14,948,500 15,343,783 15,744,231; Diluted 15,004,697 15,408,095 15,812,547.\nTITLE: Years ended\nTITLE: September 27,2025September 28,2024September 30,2023\nTITLE: September 27,2025\nTITLE: September 28,2024\nTITLE: September 30,2023\nTEXT: See accompanying Notes to Consolidated Financial Statements.\nTEXT: Apple Inc. | 2025 Form 10-K | 29\nTITLE: Apple Inc.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ntotal, current, liabilities, assets, other, change, income, gains, losses, value\n\nTITLE: CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nTEXT: Years endedSeptember 27,2025September 28,2024September 30,2023Net income$112,010 $93,736 $96,995 Other comprehensive income/(loss):Change in foreign currency translation, net of tax(267)395 (765)Change in unrealized gains/losses on derivative instruments, net of tax:Change in fair value of derivative instruments849 (832)323 Adjustment for net (gains)/losses realized and included in net income(212)(1,337)(1,717)Total change in unrealized gains/losses on derivative instruments637 (2,169)(1,394)Change in unrealized gains/losses on marketable debt securities, net of tax:Change in fair value of marketable debt securities817 5,850 1,563 Adjustment for net (gains)/losses realized and included in net income414 204 253 Total change in unrealized gains/losses on marketable debt securities1,231 6,054 1,816 Total other comprehensive income/(loss)1,601 4,280 (343)Total comprehensive income$113,611 $98,016 $96,652\nTABLE: TABLE: September 27,2025 September 28,2024 September 30,2023; Net income $ 112,010 $ 93,736 $ 96,995; Change in foreign currency translation, net of tax (267) 395 (765); Change in fair value of derivative instruments 849 (832) 323; Adjustment for net (gains)/losses realized and included in net income (212) (1,337) (1,717); Total change in unrealized gains/losses on derivative instruments 637 (2,169) (1,394); Change in fair value of marketable debt securities 817 5,850 1,563; Adjustment for net (gains)/losses realized and included in net income 414 204 253; Total change in unrealized gains/losses on marketable debt securities 1,231 6,054 1,816; Total other comprehensive income/(loss) 1,601 4,280 (343); Total comprehensive income $ 113,611 $ 98,016 $ 96,652.\nTITLE: Years ended\nTITLE: September 27,2025September 28,2024September 30,2023\nTITLE: September 27,2025\nTITLE: September 28,2024\nTITLE: September 30,2023\nTEXT: See accompanying Notes to Consolidated Financial Statements.\nTEXT: Apple Inc. | 2025 Form 10-K | 30\nTITLE: Apple Inc.\nTITLE: CONSOLIDATED BALANCE SHEETS\nTEXT: (In millions, except number of shares, which are reflected in thousands, and par value)\nTEXT: September 27,2025September 28,2024ASSETS:Current assets:Cash and cash equivalents$35,934 $29,943 Marketable securities18,763 35,228 Accounts receivable, net39,777 33,410 Vendor non-trade receivables33,180 32,833 Inventories5,718 7,286 Other current assets14,585 14,287 Total current assets147,957 152,987 Non-current assets:Marketable securities77,723 91,479 Property, plant and equipment, net49,834 45,680 Other non-current assets83,727 74,834 Total non-current assets211,284 211,993 Total assets$359,241 $364,980 LIABILITIES AND SHAREHOLDERS’ EQUITY:Current liabilities:Accounts payable$69,860 $68,960 Other current liabilities66,387 78,304 Deferred revenue9,055 8,249 Commercial paper7,979 9,967 Term debt12,350 10,912 Total current liabilities165,631 176,392 Non-current liabilities:Term debt78,328 85,750 Other non-current liabilities41,549 45,888 Total non-current liabilities119,877 131,638 Total liabilities285,508 308,030 Commitments and contingenciesShareholders’ equity:Common stock and additional paid-in capital, $0.00001 par value: 50,400,000 shares authorized; 14,773,260 and 15,116,786 shares issued and outstanding, respectively93,568 83,276 Accumulated deficit(14,264)(19,154)Accumulated other comprehensive loss(5,571)(7,172)Total shareholders’ equity73,733 56,950 Total liabilities and shareholders’ equity$359,241 $364,980\nTABLE: TABLE: September 27,2025 September 28,2024; Cash and cash equivalents $ 35,934 $ 29,943; Marketable securities 18,763 35,228; Accounts receivable, net 39,777 33,410; Vendor non-trade receivables 33,180 32,833; Inventories 5,718 7,286; Other current assets 14,585 14,287; Total current assets 147,957 152,987; Marketable securities 77,723 91,479; Property, plant and equipment, net 49,834 45,680; Other non-current assets 83,727 74,834; Total non-current assets 211,284 211,993; Total assets $ 359,241 $ 364,980; Accounts payable $ 69,860 $ 68,960; Other current liabilities 66,387 78,304; Deferred revenue 9,055 8,249; Commercial paper 7,979 9,967; Term debt 12,350 10,912; Total current liabilities 165,631 176,392; Term debt 78,328 85,750; Other non-current liabilities 41,549 45,888; Total non-current liabilities 119,877 131,638; Total liabilities 285,508 308,030; Common stock and additional paid-in capital, $0.00001 par value: 50,400,000 shares authorized; 14,773,260 and 15,116,786 shares issued and outstanding, respectively 93,568 83,276; Accumulated deficit (14,264) (19,154); Accumulated other comprehensive loss (5,571) (7,172); Total shareholders’ equity 73,733 56,950; Total liabilities and shareholders’ equity $ 359,241 $ 364,980.\nTITLE: September 27,2025September 28,2024\nTITLE: September 27,2025\nTITLE: September 28,2024\nTITLE: ASSETS:\nTITLE: LIABILITIES AND SHAREHOLDERS’ EQUITY:\nTEXT: Common stock and additional paid-in capital, $0.00001 par value: 50,400,000 shares authorized; 14,773,260 and 15,116,786 shares issued and outstanding, respectively\nTEXT: See accompanying Notes to Consolidated Financial Statements.\nTEXT: Apple Inc. | 2025 Form 10-K | 31\nTITLE: Apple Inc.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nbalances, share, common, stock, equity, beginning, ending, september, total, shareholders\n\nTITLE: CONSOLIDATED STATEMENTS OF SHAREHOLDERS’ EQUITY\nTEXT: (In millions, except per-share amounts)\nTEXT: Years endedSeptember 27,2025September 28,2024September 30,2023Total shareholders’ equity, beginning balances$56,950 $62,146 $50,672 Common stock and additional paid-in capital:Beginning balances83,276 73,812 64,849 Common stock issued1,498 1,423 1,346 Common stock withheld related to net share settlement of equity awards(4,452)(3,993)(3,521)Share-based compensation13,246 12,034 11,138 Ending balances93,568 83,276 73,812 Accumulated deficit:Beginning balances(19,154)(214)(3,068)Net income112,010 93,736 96,995 Dividends and dividend equivalents declared(15,413)(15,218)(14,996)Common stock withheld related to net share settlement of equity awards(1,655)(1,612)(2,099)Common stock repurchased(90,052)(95,846)(77,046)Ending balances(14,264)(19,154)(214)Accumulated other comprehensive loss:Beginning balances(7,172)(11,452)(11,109)Other comprehensive income/(loss)1,601 4,280 (343)Ending balances(5,571)(7,172)(11,452)Total shareholders’ equity, ending balances$73,733 $56,950 $62,146 Dividends and dividend equivalents declared per share or RSU$1.02 $0.98 $0.94\nTABLE: TABLE: September 27,2025 September 28,2024 September 30,2023; Total shareholders’ equity, beginning balances $ 56,950 $ 62,146 $ 50,672; Beginning balances 83,276 73,812 64,849; Common stock issued 1,498 1,423 1,346; Common stock withheld related to net share settlement of equity awards (4,452) (3,993) (3,521); Share-based compensation 13,246 12,034 11,138; Ending balances 93,568 83,276 73,812; Beginning balances (19,154) (214) (3,068); Net income 112,010 93,736 96,995; Dividends and dividend equivalents declared (15,413) (15,218) (14,996); Common stock withheld related to net share settlement of equity awards (1,655) (1,612) (2,099); Common stock repurchased (90,052) (95,846) (77,046); Ending balances (14,264) (19,154) (214); Beginning balances (7,172) (11,452) (11,109); Other comprehensive income/(loss) 1,601 4,280 (343); Ending balances (5,571) (7,172) (11,452); Total shareholders’ equity, ending balances $ 73,733 $ 56,950 $ 62,146; Dividends and dividend equivalents declared per share or RSU $ 1.02 $ 0.98 $ 0.94.\nTITLE: Years ended\nTITLE: September 27,2025September 28,2024September 30,2023\nTITLE: September 27,2025\nTITLE: September 28,2024\nTITLE: September 30,2023\nTEXT: See accompanying Notes to Consolidated Financial Statements.\nTEXT: Apple Inc. | 2025 Form 10-K | 32\nTITLE: Apple Inc.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, company, fiscal, equivalents, activities, operating, other, current, segment, september\n\nTITLE: CONSOLIDATED STATEMENTS OF CASH FLOWS\nTEXT: Years endedSeptember 27,2025September 28,2024September 30,2023Cash, cash equivalents, and restricted cash and cash equivalents, beginning balances$29,943 $30,737 $24,977 Operating activities:Net income112,010 93,736 96,995 Adjustments to reconcile net income to cash generated by operating activities:Depreciation and amortization11,698 11,445 11,519 Share-based compensation expense12,863 11,688 10,833 Other(89)(2,266)(2,227)Changes in operating assets and liabilities:Accounts receivable, net(6,682)(3,788)(1,688)Vendor non-trade receivables(347)(1,356)1,271 Inventories1,400 (1,046)(1,618)Other current and non-current assets(9,197)(11,731)(5,684)Accounts payable902 6,020 (1,889)Other current and non-current liabilities(11,076)15,552 3,031 Cash generated by operating activities111,482 118,254 110,543 Investing activities:Purchases of marketable securities(24,407)(48,656)(29,513)Proceeds from maturities of marketable securities40,907 51,211 39,686 Proceeds from sales of marketable securities12,890 11,135 5,828 Payments for acquisition of property, plant and equipment(12,715)(9,447)(10,959)Other(1,480)(1,308)(1,337)Cash generated by investing activities15,195 2,935 3,705 Financing activities:Payments for taxes related to net share settlement of equity awards(5,960)(5,441)(5,431)Payments for dividends and dividend equivalents(15,421)(15,234)(15,025)Repurchases of common stock(90,711)(94,949)(77,550)Proceeds from issuance of term debt, net4,481 — 5,228 Repayments of term debt(10,932)(9,958)(11,151)Proceeds from/(Repayments of) commercial paper, net(2,032)3,960 (3,978)Other(111)(361)(581)Cash used in financing activities(120,686)(121,983)(108,488)Increase/(Decrease) in cash, cash equivalents, and restricted cash and cash equivalents5,991 (794)5,760 Cash, cash equivalents, and restricted cash and cash equivalents, ending balances$35,934 $29,943 $30,737 Supplemental cash flow disclosure:Cash paid for income taxes, net$43,369 $26,102 $18,679\nTABLE: TABLE: September 27,2025 September 28,2024 September 30,2023; Cash, cash equivalents, and restricted cash and cash equivalents, beginning balances $ 29,943 $ 30,737 $ 24,977; Net income 112,010 93,736 96,995; Depreciation and amortization 11,698 11,445 11,519; Share-based compensation expense 12,863 11,688 10,833; Other (89) (2,266) (2,227); Accounts receivable, net (6,682) (3,788) (1,688); Vendor non-trade receivables (347) (1,356) 1,271; Inventories 1,400 (1,046) (1,618); Other current and non-current assets (9,197) (11,731) (5,684); Accounts payable 902 6,020 (1,889); Other current and non-current liabilities (11,076) 15,552 3,031; Cash generated by operating activities 111,482 118,254 110,543; Purchases of marketable securities (24,407) (48,656) (29,513); Proceeds from maturities of marketable securities 40,907 51,211 39,686; Proceeds from sales of marketable securities 12,890 11,135 5,828; Payments for acquisition of property, plant and equipment (12,715) (9,447) (10,959); Other (1,480) (1,308) (1,337); Cash generated by investing activities 15,195 2,935 3,705; Payments for taxes related to net share settlement of equity awards (5,960) (5,441) (5,431); Payments for dividends and dividend equivalents (15,421) (15,234) (15,025); Repurchases of common stock (90,711) (94,949) (77,550); Proceeds from issuance of term debt, net 4,481 — 5,228; Repayments of term debt (10,932) (9,958) (11,151); Proceeds from/(Repayments of) commercial paper, net (2,032) 3,960 (3,978); Other (111) (361) (581); Cash used in financing activities (120,686) (121,983) (108,488); Increase/(Decrease) in cash, cash equivalents, and restricted cash and cash equivalents 5,991 (794) 5,760; Cash, cash equivalents, and restricted cash and cash equivalents, ending balances $ 35,934 $ 29,943 $ 30,737; Cash paid for income taxes, net $ 43,369 $ 26,102 $ 18,679.\nTITLE: Years ended\nTITLE: September 27,2025September 28,2024September 30,2023\nTITLE: September 27,2025\nTITLE: September 28,2024\nTITLE: September 30,2023\nTEXT: See accompanying Notes to Consolidated Financial Statements.\nTEXT: Apple Inc. | 2025 Form 10-K | 33\nTITLE: Apple Inc.\nTITLE: Basis of Presentation and Preparation\nTEXT: The consolidated financial statements include the accounts of Apple Inc. and its wholly owned subsidiaries. The preparation of these consolidated financial statements and accompanying notes in conformity with GAAP requires the use of management estimates. Certain prior period amounts in the notes to consolidated financial statements have been reclassified to conform to the current period’s presentation.\nTEXT: The Company’s fiscal year is the 52- or 53-week period that ends on the last Saturday of September. An additional week is included in the first fiscal quarter every five or six years to realign the Company’s fiscal quarters with calendar quarters, which occurred in the first fiscal quarter of 2023. The Company’s fiscal years 2025 and 2024 spanned 52 weeks each, whereas fiscal year 2023 spanned 53 weeks. Unless otherwise stated, references to particular years, quarters, months and periods refer to the Company’s fiscal years ended in September and the associated quarters, months and periods of those fiscal years.\nTITLE: Recently Adopted Accounting Pronouncements\nTEXT: Beginning with the 2025 annual reporting period, the Company adopted the FASB’s ASU No. 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures (“ASU 2023-07”), which requires the Company to disclose segment expenses that are significant and regularly provided to the Company’s chief operating decision maker (“CODM”). In addition, ASU 2023-07 requires the Company to disclose the title and position of its CODM and how the CODM uses segment profit or loss information in assessing segment performance and deciding how to allocate resources. The Company adopted ASU 2023-07 using a retrospective transition method.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, securities, revenue, september, deferred, sales, three, cash, certain, total\n\nTITLE: RevenueThe Company records revenue net of taxes collected from customers that are remitted to governmental authorities.\nTITLE: Revenue\nTEXT: The Company records revenue net of taxes collected from customers that are remitted to governmental authorities.\nTITLE: Share-Based Compensation\nTEXT: The Company recognizes share-based compensation expense on a straight-line basis for its estimate of equity awards that will ultimately vest.\nTITLE: Cash Equivalents\nTEXT: All highly liquid investments with maturities of three months or less at the date of purchase are treated as cash equivalents.\nTITLE: Trade ReceivablesTrade receivables are stated at transaction price.\nTITLE: Trade Receivables\nTEXT: Trade receivables are stated at transaction price.\nTITLE: Marketable SecuritiesThe cost of securities sold is determined using the specific identification method.\nTITLE: Marketable Securities\nTEXT: The cost of securities sold is determined using the specific identification method.\nTITLE: InventoriesInventories are measured using the first-in, first-out method.\nTITLE: Inventories\nTEXT: Inventories are measured using the first-in, first-out method.\nTITLE: Property, Plant and Equipment\nTEXT: Property, plant and equipment are stated at cost. Depreciation on property, plant and equipment is recognized on a straight-line basis.\nTEXT: Apple Inc. | 2025 Form 10-K | 34\nTITLE: Derivative InstrumentsThe Company presents derivative assets and liabilities at their gross fair values in the Consolidated Balance Sheets.\nTITLE: Derivative Instruments\nTEXT: The Company presents derivative assets and liabilities at their gross fair values in the Consolidated Balance Sheets.\nTITLE: Income Taxes\nTEXT: The Company records certain deferred tax assets and liabilities in connection with the minimum tax on certain foreign earnings created by the TCJA.\nTITLE: Leases\nTEXT: The Company combines and accounts for lease and nonlease components as a single lease component for leases of corporate and retail facilities.\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTEXT: Wearables, Home and Accessories\nTEXT: (1)Services net sales include amortization of the deferred value of services bundled in the sales price of certain products.\nTEXT: The Company’s proportion of net sales by disaggregated revenue source was generally consistent for each reportable segment in Note 13, “Segment Information and Geographic Data” for 2025, 2024 and 2023, except in Greater China, where iPhone revenue represented a moderately higher proportion of net sales.\nTEXT: As of September 27, 2025 and September 28, 2024, the Company had total deferred revenue of $13.7 billion and $12.8 billion, respectively. As of September 27, 2025, the Company expects 66% of total deferred revenue to be realized in less than a year, 23% within one-to-two years, 9% within two-to-three years and 2% in greater than three years.\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTEXT: Approximately 24 million restricted stock units (“RSUs”) were excluded from the computation of diluted earnings per share for 2023 because their effect would have been antidilutive.\nTEXT: Apple Inc. | 2025 Form 10-K | 36\nTITLE: Cash, Cash Equivalents and Marketable Securities\nTEXT: The following tables show the Company’s cash, cash equivalents and marketable securities by significant investment category as of September 27, 2025 and September 28, 2024 (in millions):\nTEXT: 2025AdjustedCostUnrealizedGainsUnrealizedLossesFairValueCash andCashEquivalentsCurrentMarketableSecuritiesNon-CurrentMarketableSecuritiesCash$28,267 $— $— $28,267 $28,267 $— $— Level 1:Money market funds5,272 — — 5,272 5,272 — — Mutual funds679 177 (2)854 — 854 — Subtotal5,951 177 (2)6,126 5,272 854 — Level 2 (1):U.S. Treasury securities16,074 56 (282)15,848 1,190 3,712 10,946 U.S. agency securities5,269 — (149)5,120 251 2,456 2,413 Non-U.S. government securities6,586 111 (424)6,273 — 855 5,418 Certificates of deposit and time deposits917 — — 917 904 — 13 Commercial paper100 — — 100 50 50 — Corporate debt securities47,210 266 (916)46,560 — 10,623 35,937 Municipal securities207 — (2)205 — 119 86 Mortgage- and asset-backed securities24,130 126 (1,252)23,004 — 94 22,910 Subtotal100,493 559 (3,025)98,027 2,395 17,909 77,723 Total$134,711 $736 $(3,027)$132,420 $35,934 $18,763 $77,723\nTABLE: TABLE: AdjustedCost UnrealizedGains UnrealizedLosses FairValue Cash andCashEquivalents CurrentMarketableSecurities Non-CurrentMarketableSecurities; Cash $ 28,267 $ — $ — $ 28,267 $ 28,267 $ — $ —; Money market funds 5,272 — — 5,272 5,272 — —; Mutual funds 679 177 (2) 854 — 854 —; Subtotal 5,951 177 (2) 6,126 5,272 854 —; U.S. Treasury securities 16,074 56 (282) 15,848 1,190 3,712 10,946; U.S. agency securities 5,269 — (149) 5,120 251 2,456 2,413; Non-U.S. government securities 6,586 111 (424) 6,273 — 855 5,418; Certificates of deposit and time deposits 917 — — 917 904 — 13; Commercial paper 100 — — 100 50 50 —; Corporate debt securities 47,210 266 (916) 46,560 — 10,623 35,937; Municipal securities 207 — (2) 205 — 119 86; Mortgage- and asset-backed securities 24,130 126 (1,252) 23,004 — 94 22,910; Subtotal 100,493 559 (3,025) 98,027 2,395 17,909 77,723; Total $ 134,711 $ 736 $ (3,027) $ 132,420 $ 35,934 $ 18,763 $ 77,723.\nTITLE: 2025\nTITLE: AdjustedCostUnrealizedGainsUnrealizedLossesFairValueCash andCashEquivalentsCurrentMarketableSecuritiesNon-CurrentMarketableSecurities\nTITLE: AdjustedCost\nTITLE: UnrealizedGains\nTITLE: UnrealizedLosses\nTITLE: FairValue\nTITLE: Cash andCashEquivalents\nTITLE: CurrentMarketableSecurities\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsecurities, company, current, marketable, debt, september, cash, restricted, level, market\n\nTITLE: Non-CurrentMarketableSecurities\nTEXT: 2024AdjustedCostUnrealizedGainsUnrealizedLossesFairValueCash andCashEquivalentsCurrentMarketableSecuritiesNon-CurrentMarketableSecuritiesCash$27,199 $— $— $27,199 $27,199 $— $— Level 1:Money market funds778 — — 778 778 — — Mutual funds515 105 (3)617 — 617 — Subtotal1,293 105 (3)1,395 778 617 — Level 2 (1):U.S. Treasury securities16,150 45 (516)15,679 212 4,087 11,380 U.S. agency securities5,431 — (272)5,159 155 703 4,301 Non-U.S. government securities17,959 93 (484)17,568 1,158 10,810 5,600 Certificates of deposit and time deposits873 — — 873 387 478 8 Commercial paper1,066 — — 1,066 28 1,038 — Corporate debt securities65,622 270 (1,953)63,939 26 16,027 47,886 Municipal securities412 — (7)405 — 190 215 Mortgage- and asset-backed securities24,595 175 (1,403)23,367 — 1,278 22,089 Subtotal132,108 583 (4,635)128,056 1,966 34,611 91,479 Total (2)(3)$160,600 $688 $(4,638)$156,650 $29,943 $35,228 $91,479\nTABLE: TABLE: AdjustedCost UnrealizedGains UnrealizedLosses FairValue Cash andCashEquivalents CurrentMarketableSecurities Non-CurrentMarketableSecurities; Cash $ 27,199 $ — $ — $ 27,199 $ 27,199 $ — $ —; Money market funds 778 — — 778 778 — —; Mutual funds 515 105 (3) 617 — 617 —; Subtotal 1,293 105 (3) 1,395 778 617 —; U.S. Treasury securities 16,150 45 (516) 15,679 212 4,087 11,380; U.S. agency securities 5,431 — (272) 5,159 155 703 4,301; Non-U.S. government securities 17,959 93 (484) 17,568 1,158 10,810 5,600; Certificates of deposit and time deposits 873 — — 873 387 478 8; Commercial paper 1,066 — — 1,066 28 1,038 —; Corporate debt securities 65,622 270 (1,953) 63,939 26 16,027 47,886; Municipal securities 412 — (7) 405 — 190 215; Mortgage- and asset-backed securities 24,595 175 (1,403) 23,367 — 1,278 22,089; Subtotal 132,108 583 (4,635) 128,056 1,966 34,611 91,479; Total (2)(3) $ 160,600 $ 688 $ (4,638) $ 156,650 $ 29,943 $ 35,228 $ 91,479.\nTITLE: 2024\nTITLE: AdjustedCostUnrealizedGainsUnrealizedLossesFairValueCash andCashEquivalentsCurrentMarketableSecuritiesNon-CurrentMarketableSecurities\nTITLE: AdjustedCost\nTITLE: UnrealizedGains\nTITLE: UnrealizedLosses\nTITLE: FairValue\nTITLE: Cash andCashEquivalents\nTITLE: CurrentMarketableSecurities\nTITLE: Non-CurrentMarketableSecurities\nTEXT: (1)The valuation techniques used to measure the fair values of the Company’s Level 2 financial instruments, which generally have counterparties with high credit ratings, are based on quoted market prices or model-driven valuations using significant inputs derived from or corroborated by observable market data.\nTEXT: (2)As of September 28, 2024, cash and cash equivalents included $2.6 billion held in escrow and restricted from general use. These restricted cash and cash equivalents were designated to settle the Company’s obligation related to the State Aid Decision (refer to Note 7, “Income Taxes”).\nTEXT: (3)As of September 28, 2024, current marketable securities included $13.2 billion held in escrow and restricted from general use. These restricted marketable securities were designated to settle the Company’s obligation related to the State Aid Decision (refer to Note 7, “Income Taxes”).\nTEXT: Apple Inc. | 2025 Form 10-K | 37\nTEXT: As of September 27, 2025, 80% of the Company’s non-current marketable debt securities other than mortgage- and asset-backed securities had maturities between 1 and 5 years, 15% between 5 and 10 years, and 5% greater than 10 years. As of September 27, 2025, 13% of the Company’s non-current mortgage- and asset-backed securities had maturities between 1 and 5 years, 14% between 5 and 10 years, and 73% greater than 10 years.\nTEXT: The Company’s investments in marketable debt securities have been classified and accounted for as available-for-sale. The Company classifies marketable debt securities as either current or non-current based on each instrument’s underlying maturity.\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, instruments, foreign, hedges, derivative, september, hedge, fair, value, cash\n\nTITLE: Derivative Instruments and Hedging\nTEXT: The Company may use derivative instruments to partially offset its business exposure to foreign exchange and interest rate risk. However, the Company may choose not to hedge certain exposures for a variety of reasons including accounting considerations or the prohibitive economic cost of hedging particular exposures. There can be no assurance the hedges will offset more than a portion of the financial impact resulting from movements in foreign exchange or interest rates.\nTEXT: All derivative instruments are recorded in the Consolidated Balance Sheets at fair value. The accounting treatment for derivative gains and losses is based on intended use and hedge designation.\nTEXT: Gains and losses arising from amounts that are included in the assessment of cash flow hedge effectiveness are initially deferred in accumulated other comprehensive income/(loss) and subsequently reclassified into earnings when the hedged transaction affects earnings, and in the same line item in the Consolidated Statements of Operations. Gains and losses arising from amounts that are included in the assessment of fair value hedge effectiveness are recognized in the Consolidated Statements of Operations line item to which the hedge relates along with offsetting losses and gains related to the change in value of the hedged item.\nTEXT: For derivative instruments designated as cash flow and fair value hedges, amounts excluded from the assessment of hedge effectiveness are recognized on a straight-line basis over the life of the hedge in the Consolidated Statements of Operations line item to which the hedge relates. Changes in the fair value of amounts excluded from the assessment of hedge effectiveness are recognized in other comprehensive income/(loss).\nTEXT: Gains and losses arising from changes in the fair values of derivative instruments that are not designated as accounting hedges are recognized in the Consolidated Statements of Operations.\nTEXT: The Company classifies cash flows related to derivative instruments in the same section of the Consolidated Statements of Cash Flows as the items being hedged, which are generally classified as operating activities.\nTEXT: To protect gross margins from fluctuations in foreign exchange rates, the Company may use forwards, options or other instruments, and may designate these instruments as cash flow hedges. The Company generally hedges portions of its forecasted foreign currency exposure associated with revenue and inventory purchases, typically for up to 12 months.\nTEXT: To protect the Company’s foreign currency–denominated term debt or marketable securities from fluctuations in foreign exchange rates, the Company may use forwards, cross-currency swaps or other instruments. The Company designates these instruments as either cash flow or fair value hedges. As of September 27, 2025, the maximum length of time over which the Company is hedging its exposure to the variability in future cash flows for term debt–related foreign currency transactions is 17 years.\nTEXT: The Company may also use derivative instruments that are not designated as accounting hedges to protect gross margins from certain fluctuations in foreign exchange rates, as well as to offset a portion of the foreign currency gains and losses generated by the remeasurement of certain assets and liabilities denominated in non-functional currencies.\nTEXT: To protect the Company’s term debt or marketable securities from fluctuations in interest rates, the Company may use interest rate swaps, options or other instruments. The Company designates these instruments as either cash flow or fair value hedges.\nTEXT: Apple Inc. | 2025 Form 10-K | 38\nTEXT: The notional amounts of the Company’s outstanding derivative instruments as of September 27, 2025 and September 28, 2024, were as follows (in millions):\nTEXT: 20252024Derivative instruments designated as accounting hedges:Foreign exchange contracts$62,647 $64,069 Interest rate contracts$12,875 $14,575 Derivative instruments not designated as accounting hedges:Foreign exchange contracts$109,079 $91,493\nTABLE: TABLE_ROW: Foreign exchange contracts — 2025: 62,647; 2024: 64,069\nTABLE_ROW: Interest rate contracts — 2025: 12,875; 2024: 14,575\nTABLE_ROW: Foreign exchange contracts — 2025: 109,079; 2024: 91,493\nTITLE: 20252024\nTITLE: 2025\nTITLE: 2024\nTEXT: As of September 27, 2025 and September 28, 2024, the carrying amount of the Company’s current and non-current term debt subject to fair value hedges was $12.6 billion and $13.5 billion, respectively.\nTITLE: Accounts Receivable\nTEXT: As of September 27, 2025, the Company had one customer that represented 10% or more of total trade receivables, which accounted for 12%. The Company’s third-party cellular network carriers accounted for 34% and 38% of total trade receivables as of September 27, 2025 and September 28, 2024, respectively. The Company requires third-party credit support or collateral from certain customers to limit credit risk.\nTEXT: The Company has non-trade receivables from certain of its manufacturing vendors resulting from the sale of components to these vendors who manufacture subassemblies or assemble final products for the Company. The Company purchases these components directly from suppliers. The Company does not reflect the sale of these components in products net sales. Rather, the Company recognizes any gain on these sales as a reduction of products cost of sales when the related final products are sold by the Company. As of September 27, 2025, the Company had two vendors that individually represented 10% or more of total vendor non-trade receivables, which accounted for 46% and 23%. As of September 28, 2024, the Company had two vendors that individually represented 10% or more of total vendor non-trade receivables, which accounted for 44% and 23%.\nTITLE: 20252024\nTITLE: 2025\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, decision, state, taxes, court, current, company, general, provision, total\n\nTITLE: 2024\nTEXT: Machinery, equipment and internal-use software\nTEXT: Depreciation expense on property, plant and equipment was $8.0 billion, $8.2 billion and $8.5 billion during 2025, 2024 and 2023, respectively.\nTEXT: Apple Inc. | 2025 Form 10-K | 39\nTITLE: Other Non-Current Assets\nTITLE: 20252024Deferred tax assets$20,777 $19,499 Other non-current assets62,950 55,335 Total other non-current assets$83,727 $74,834\nTABLE: TABLE_ROW: Deferred tax assets — 2025: 20,777; 2024: 19,499\nTABLE_ROW: Other non-current assets — 2025: 62,950; 2024: 55,335\nTABLE_ROW: Total other non-current assets — 2025: 83,727; 2024: 74,834\nTITLE: 20252024Deferred tax assets$20,777 $19,499 Other non-current assets62,950 55,335 Total other non-current assets$83,727 $74,834\nTITLE: 20252024\nTITLE: 2025\nTITLE: 2024\nTITLE: Other Current Liabilities\nTEXT: 20252024Income taxes payable$13,016 $26,601 Accrued distribution and marketing8,919 7,679 Other current liabilities44,452 44,024 Total other current liabilities$66,387 $78,304\nTABLE: TABLE_ROW: Income taxes payable — 2025: 13,016; 2024: 26,601\nTABLE_ROW: Accrued distribution and marketing — 2025: 8,919; 2024: 7,679\nTABLE_ROW: Other current liabilities — 2025: 44,452; 2024: 44,024\nTABLE_ROW: Total other current liabilities — 2025: 66,387; 2024: 78,304\nTITLE: 20252024\nTITLE: 2025\nTITLE: 2024\nTEXT: Accrued distribution and marketing\nTITLE: European Commission State Aid Decision\nTEXT: On August 30, 2016, the Commission announced its decision that Ireland granted state aid to the Company by providing tax opinions in 1991 and 2007 concerning the tax allocation of profits of the Irish branches of two subsidiaries of the Company (“State Aid Decision”). The State Aid Decision ordered Ireland to calculate and recover additional taxes from the Company for the period June 2003 through December 2014. Irish legislative changes, effective as of January 2015, eliminated the application of the tax opinions from that date forward.\nTEXT: The Company and Ireland appealed the State Aid Decision to the General Court of the Court of Justice of the European Union (“General Court”). On July 15, 2020, the General Court annulled the State Aid Decision. On September 25, 2020, the Commission appealed the General Court’s decision to the European Court of Justice (“ECJ”). On September 10, 2024, the ECJ announced that it had set aside the 2020 judgment of the General Court and confirmed the Commission’s 2016 State Aid Decision. As a result, during the fourth quarter of 2024 the Company recorded a one-time income tax charge of $10.2 billion, net, which represented $15.8 billion payable to Ireland via release of amounts held in escrow, partially offset by a U.S. foreign tax credit of $4.8 billion and a decrease in unrecognized tax benefits of $823 million.\nTITLE: Provision for Income Taxes and Effective Tax Rate\nTEXT: The provision for income taxes for 2025, 2024 and 2023, consisted of the following (in millions):\nTEXT: 202520242023Federal:Current$11,487 $5,571 $9,445 Deferred(1,804)(3,080)(3,644)Total9,683 2,491 5,801 State:Current1,680 1,726 1,570 Deferred(139)(298)(49)Total1,541 1,428 1,521 Foreign:Current8,891 25,483 8,750 Deferred604 347 669 Total9,495 25,830 9,419 Provision for income taxes$20,719 $29,749 $16,741\nTABLE: TABLE_ROW: Current — 2025: 11,487; 2024: 5,571; 2023: 9,445\nTABLE_ROW: Deferred — 2025: (1,804); 2024: (3,080); 2023: (3,644)\nTABLE_ROW: Total — 2025: 9,683; 2024: 2,491; 2023: 5,801\nTABLE_ROW: Current — 2025: 1,680; 2024: 1,726; 2023: 1,570\nTABLE_ROW: Deferred — 2025: (139); 2024: (298); 2023: (49)\nTABLE_ROW: Total — 2025: 1,541; 2024: 1,428; 2023: 1,521\nTABLE_ROW: Current — 2025: 8,891; 2024: 25,483; 2023: 8,750\nTABLE_ROW: Deferred — 2025: 604; 2024: 347; 2023: 669\nTABLE_ROW: Total — 2025: 9,495; 2024: 25,830; 2023: 9,419\nTABLE_ROW: Provision for income taxes — 2025: 20,719; 2024: 29,749; 2023: 16,741\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTEXT: Foreign pretax earnings were $82.0 billion, $77.3 billion and $72.9 billion in 2025, 2024 and 2023, respectively.\nTEXT: Apple Inc. | 2025 Form 10-K | 40\nTEXT: A reconciliation of the provision for income taxes to the amount computed by applying the statutory federal income tax rate (21% in 2025, 2024 and 2023) to income before provision for income taxes for 2025, 2024 and 2023 is as follows (dollars in millions):\nTEXT: 202520242023Computed expected tax$27,873 $25,932 $23,885 Earnings of foreign subsidiaries(8,120)(5,311)(5,744)Change in valuation allowance2,091 — — Research and development credit, net(1,049)(1,397)(1,212)Impact of the State Aid Decision(486)10,246 — Other410 279 (188)Provision for income taxes$20,719 $29,749 $16,741 Effective tax rate15.6%24.1%14.7%\nTABLE: TABLE_ROW: Computed expected tax — 2025: 27,873; 2024: 25,932; 2023: 23,885\nTABLE_ROW: Earnings of foreign subsidiaries — 2025: (8,120); 2024: (5,311); 2023: (5,744)\nTABLE_ROW: Change in valuation allowance — 2025: 2,091\nTABLE_ROW: Research and development credit, net — 2025: (1,049); 2024: (1,397); 2023: (1,212)\nTABLE_ROW: Impact of the State Aid Decision — 2025: (486); 2024: 10,246\nTABLE_ROW: Other — 2025: 410; 2024: 279; 2023: (188)\nTABLE_ROW: Provision for income taxes — 2025: 20,719; 2024: 29,749; 2023: 16,741\nTABLE_ROW: Effective tax rate — 2025: 15.6; 2024: 24.1; 2023: 14.7\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTEXT: Impact of the State Aid Decision\n"
    },
    {
      "cluster": 9,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndeferred, liabilities, total, september, company, assets, related, credit, carryforwards, other\n\nTITLE: Deferred Tax Assets and Liabilities\nTEXT: As of September 27, 2025 and September 28, 2024, the significant components of the Company’s deferred tax assets and liabilities were as follows (in millions):\nTEXT: 20252024Deferred tax assets:Capitalized research and development$15,041 $10,739 Tax credit carryforwards8,643 8,856 Accrued liabilities and other reserves6,154 6,114 Deferred revenue2,953 3,413 Lease liabilities2,577 2,410 Other3,049 3,341 Total deferred tax assets38,417 34,873 Less: Valuation allowance(10,966)(8,866)Total deferred tax assets, net27,451 26,007 Deferred tax liabilities:Depreciation3,276 2,551 Right-of-use assets2,300 2,125 Minimum tax on foreign earnings1,217 1,674 Other678 455 Total deferred tax liabilities7,471 6,805 Net deferred tax assets$19,980 $19,202\nTABLE: TABLE_ROW: Capitalized research and development — 2025: 15,041; 2024: 10,739\nTABLE_ROW: Tax credit carryforwards — 2025: 8,643; 2024: 8,856\nTABLE_ROW: Accrued liabilities and other reserves — 2025: 6,154; 2024: 6,114\nTABLE_ROW: Deferred revenue — 2025: 2,953; 2024: 3,413\nTABLE_ROW: Lease liabilities — 2025: 2,577; 2024: 2,410\nTABLE_ROW: Other — 2025: 3,049; 2024: 3,341\nTABLE_ROW: Total deferred tax assets — 2025: 38,417; 2024: 34,873\nTABLE_ROW: Less: Valuation allowance — 2025: (10,966); 2024: (8,866)\nTABLE_ROW: Total deferred tax assets, net — 2025: 27,451; 2024: 26,007\nTABLE_ROW: Depreciation — 2025: 3,276; 2024: 2,551\nTABLE_ROW: Right-of-use assets — 2025: 2,300; 2024: 2,125\nTABLE_ROW: Minimum tax on foreign earnings — 2025: 1,217; 2024: 1,674\nTABLE_ROW: Other — 2025: 678; 2024: 455\nTABLE_ROW: Total deferred tax liabilities — 2025: 7,471; 2024: 6,805\nTABLE_ROW: Net deferred tax assets — 2025: 19,980; 2024: 19,202\nTITLE: 20252024\nTITLE: 2025\nTITLE: 2024\nTEXT: As of September 27, 2025, the Company had $4.7 billion in foreign tax credit carryforwards in Ireland and $4.0 billion in California R&D credit carryforwards, both of which can be carried forward indefinitely. A valuation allowance has been recorded for the credit carryforwards and a portion of other temporary differences.\nTEXT: Apple Inc. | 2025 Form 10-K | 41\nTITLE: Uncertain Tax Positions\nTEXT: As of September 27, 2025, the total amount of gross unrecognized tax benefits was $23.2 billion, of which $10.6 billion, if recognized, would impact the Company’s effective tax rate. As of September 28, 2024, the total amount of gross unrecognized tax benefits was $22.0 billion, of which $10.8 billion, if recognized, would have impacted the Company’s effective tax rate.\nTEXT: The aggregate change in the balance of gross unrecognized tax benefits, which excludes interest and penalties, for 2025, 2024 and 2023 is as follows (in millions):\nTEXT: 202520242023Beginning balances$22,038 $19,454 $16,758 Increases related to tax positions taken during a prior year1,971 1,727 2,044 Decreases related to tax positions taken during a prior year(71)(386)(1,463)Increases related to tax positions taken during the current year3,795 2,542 2,628 Decreases related to settlements with taxing authorities(2,939)(1,070)(19)Decreases related to expiration of the statute of limitations(1,552)(229)(494)Ending balances$23,242 $22,038 $19,454\nTABLE: TABLE_ROW: Beginning balances — 2025: 22,038; 2024: 19,454; 2023: 16,758\nTABLE_ROW: Increases related to tax positions taken during a prior year — 2025: 1,971; 2024: 1,727; 2023: 2,044\nTABLE_ROW: Decreases related to tax positions taken during a prior year — 2025: (71); 2024: (386); 2023: (1,463)\nTABLE_ROW: Increases related to tax positions taken during the current year — 2025: 3,795; 2024: 2,542; 2023: 2,628\nTABLE_ROW: Decreases related to settlements with taxing authorities — 2025: (2,939); 2024: (1,070); 2023: (19)\nTABLE_ROW: Decreases related to expiration of the statute of limitations — 2025: (1,552); 2024: (229); 2023: (494)\nTABLE_ROW: Ending balances — 2025: 23,242; 2024: 22,038; 2023: 19,454\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTEXT: The Company is subject to taxation and files income tax returns in the U.S. federal jurisdiction and many state and foreign jurisdictions. Tax years 2018 and after 2021 for the U.S. federal jurisdiction, and after 2014 in certain major foreign jurisdictions, remain subject to examination. Although the timing of resolution or closure of examinations is not certain, the Company believes it is reasonably possible that its gross unrecognized tax benefits could decrease as much as $6 billion in the next 12 months.\nTITLE: Lease-Related Assets and LiabilitiesFinancial Statement Line Items20252024\nTITLE: Lease-Related Assets and Liabilities\nTITLE: Financial Statement Line Items\nTITLE: 2025\nTITLE: 2024\nTEXT: Apple Inc. | 2025 Form 10-K | 42\nTEXT: Lease liability maturities as of September 27, 2025, are as follows (in millions):\nTEXT: OperatingLeasesFinanceLeasesTotal2026$1,967 $563 $2,530 20271,988 73 2,061 20281,848 51 1,899 20291,585 48 1,633 20301,381 43 1,424 Thereafter5,956 801 6,757 Total undiscounted liabilities14,725 1,579 16,304 Less: Imputed interest(2,235)(349)(2,584)Total lease liabilities$12,490 $1,230 $13,720\nTABLE: TABLE: OperatingLeases FinanceLeases Total; 2026 $ 1,967 $ 563 $ 2,530; 2027 1,988 73 2,061; 2028 1,848 51 1,899; 2029 1,585 48 1,633; 2030 1,381 43 1,424; Thereafter 5,956 801 6,757; Total undiscounted liabilities 14,725 1,579 16,304; Less: Imputed interest (2,235) (349) (2,584); Total lease liabilities $ 12,490 $ 1,230 $ 13,720.\nTITLE: OperatingLeasesFinanceLeasesTotal\nTITLE: OperatingLeases\nTITLE: FinanceLeases\n"
    },
    {
      "cluster": 10,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, notes, september, rate, commercial, paper, term, interest, debt, fixed\n\nTITLE: Total\nTEXT: The weighted-average remaining lease term related to the Company’s lease liabilities as of September 27, 2025 and September 28, 2024 was 9.8 years and 10.3 years, respectively. The discount rate related to the Company’s lease liabilities as of September 27, 2025 and September 28, 2024 was 3.4% and 3.1%, respectively. The discount rates related to the Company’s lease liabilities are generally based on estimates of the Company’s incremental borrowing rate, as the discount rates implicit in the Company’s leases cannot be readily determined.\nTEXT: As of September 27, 2025, the Company had $523 million of fixed payment obligations under additional leases, primarily for corporate facilities and retail space, that had not yet commenced. These leases are expected to commence between 2026 and 2027, with lease terms ranging from 1 year to 21 years.\nTITLE: Commercial Paper\nTEXT: The Company issues unsecured short-term promissory notes pursuant to a commercial paper program. The Company uses net proceeds from the commercial paper program for general corporate purposes, including dividends and share repurchases. As of September 27, 2025 and September 28, 2024, the Company had $8.0 billion and $10.0 billion of commercial paper outstanding, respectively, with maturities generally less than nine months. The weighted-average interest rate of the Company’s commercial paper was 4.19% and 5.00% as of September 27, 2025 and September 28, 2024, respectively. The following table provides a summary of cash flows associated with commercial paper for 2025, 2024 and 2023 (in millions):\nTEXT: 202520242023Maturities 90 days or less:Proceeds from/(Repayments of) commercial paper, net$(5,820)$3,960 $(1,333)Maturities greater than 90 days:Proceeds from commercial paper5,836 — — Repayments of commercial paper(2,048)— (2,645)Proceeds from/(Repayments of) commercial paper, net3,788 — (2,645)Total proceeds from/(repayments of) commercial paper, net$(2,032)$3,960 $(3,978)\nTABLE: TABLE_ROW: Proceeds from/(Repayments of) commercial paper, net — 2025: (5,820); 2024: 3,960; 2023: (1,333)\nTABLE_ROW: Proceeds from commercial paper — 2025: 5,836\nTABLE_ROW: Repayments of commercial paper — 2025: (2,048); 2024: (2,645)\nTABLE_ROW: Proceeds from/(Repayments of) commercial paper, net — 2025: 3,788; 2024: (2,645)\nTABLE_ROW: Total proceeds from/(repayments of) commercial paper, net — 2025: (2,032); 2024: 3,960; 2023: (3,978)\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTEXT: Apple Inc. | 2025 Form 10-K | 43\nTITLE: Term Debt\nTEXT: The Company has outstanding Notes, which are senior unsecured obligations with interest payable in arrears. The following table provides a summary of the Company’s term debt as of September 27, 2025 and September 28, 2024:\nTEXT: Maturities(calendar year)20252024Amount(in millions)EffectiveInterest RateAmount(in millions)EffectiveInterest Rate2013 – 2023 debt issuances:Fixed-rate 0.000% – 4.850% notes2025 – 2062$86,781 0.03% – 5.75%$97,341 0.03% – 6.65%2025 debt issuance:Fixed-rate 4.000% – 4.750% notes2028 – 20354,500 4.07% – 4.83%— Total term debt principal91,281 97,341 Unamortized premium/(discount) and issuance costs, net(309)(321)Hedge accounting fair value adjustments(294)(358)Total term debt90,678 96,662 Less: Current portion of term debt(12,350)(10,912)Total non-current portion of term debt$78,328 $85,750\nTABLE: TABLE_ROW: Fixed-rate 0.000% – 4.850% notes — 2025: 2025 – 2062; 2024: 86,781\nTABLE_ROW: Fixed-rate 4.000% – 4.750% notes — 2025: 2028 – 2035; 2024: 4,500\nTABLE_ROW: Total term debt principal — 2025: 91,281; 2024: 97,341\nTABLE_ROW: Unamortized premium/(discount) and issuance costs, net — 2025: (309); 2024: (321)\nTABLE_ROW: Hedge accounting fair value adjustments — 2025: (294); 2024: (358)\nTABLE_ROW: Total term debt — 2025: 90,678; 2024: 96,662\nTABLE_ROW: Less: Current portion of term debt — 2025: (12,350); 2024: (10,912)\nTABLE_ROW: Total non-current portion of term debt — 2025: 78,328; 2024: 85,750\nTITLE: Maturities(calendar year)20252024\nTITLE: Maturities(calendar year)\nTITLE: Maturities\nTITLE: 2025\nTITLE: 2024\nTITLE: Amount(in millions)EffectiveInterest RateAmount(in millions)EffectiveInterest Rate\nTITLE: Amount(in millions)\nTITLE: Amount\nTITLE: EffectiveInterest Rate\nTITLE: Amount(in millions)\nTITLE: Amount\nTITLE: EffectiveInterest Rate\nTEXT: Fixed-rate 0.000% – 4.850% notes\nTEXT: Fixed-rate 4.000% – 4.750% notes\nTEXT: To manage interest rate risk on certain of its U.S. dollar–denominated fixed-rate notes, the Company uses interest rate swaps to effectively convert the fixed interest rates to floating interest rates on a portion of these notes. Additionally, to manage foreign exchange rate risk on certain of its foreign currency–denominated notes, the Company uses cross-currency swaps to effectively convert these notes to U.S. dollar–denominated notes.\nTEXT: The effective interest rates for the Notes include the interest on the Notes, amortization of the discount or premium and, if applicable, adjustments related to hedging.\nTEXT: The future principal payments for the Company’s Notes as of September 27, 2025, are as follows (in millions):\nTEXT: 2026$12,393 202710,078 20289,300 20295,235 20304,972 Thereafter49,303 Total term debt principal$91,281\nTABLE: TABLE: 2026 $ 12,393; 2027 10,078; 2028 9,300; 2029 5,235; 2030 4,972; Thereafter 49,303; Total term debt principal $ 91,281.\nTEXT: As of September 27, 2025 and September 28, 2024, the fair value of the Company’s Notes, based on Level 2 inputs, was $80.4 billion and $88.4 billion, respectively.\n"
    },
    {
      "cluster": 11,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstock, rsus, company, common, shares, plan, based, share, value, date\n\nTITLE: Share Repurchase Program\nTEXT: During 2025, the Company repurchased 402 million shares of its common stock for $89.3 billion. The Company’s share repurchase programs do not obligate the Company to acquire a minimum amount of shares. Under the programs, shares may be repurchased in privately negotiated or open market transactions, including under plans complying with Rule 10b5-1 under the Exchange Act.\nTEXT: Apple Inc. | 2025 Form 10-K | 44\nTITLE: Shares of Common Stock\nTEXT: The following table shows the changes in shares of common stock for 2025, 2024 and 2023 (in thousands):\nTEXT: 202520242023Common stock outstanding, beginning balances15,116,786 15,550,061 15,943,425 Common stock repurchased(401,672)(499,372)(471,419)Common stock issued, net of shares withheld for employee taxes58,146 66,097 78,055 Common stock outstanding, ending balances14,773,260 15,116,786 15,550,061\nTABLE: TABLE_ROW: Common stock outstanding, beginning balances — 2025: 15,116,786; 2024: 15,550,061; 2023: 15,943,425\nTABLE_ROW: Common stock repurchased — 2025: (401,672); 2024: (499,372); 2023: (471,419)\nTABLE_ROW: Common stock issued, net of shares withheld for employee taxes — 2025: 58,146; 2024: 66,097; 2023: 78,055\nTABLE_ROW: Common stock outstanding, ending balances — 2025: 14,773,260; 2024: 15,116,786; 2023: 15,550,061\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022 Employee Stock Plan\nTEXT: The Apple Inc. 2022 Employee Stock Plan (“2022 Plan”) is a shareholder-approved plan that provides for broad-based equity grants to employees, including executive officers, and permits the granting of RSUs, stock grants, performance-based awards, stock options and stock appreciation rights. RSUs granted under the 2022 Plan generally vest over four years, based on continued employment, and are settled upon vesting in shares of the Company’s common stock on a one-for-one basis. All RSUs granted under the 2022 Plan have dividend equivalent rights, which entitle holders of RSUs to the same dividend value per share as holders of common stock. A maximum of approximately 1.3 billion shares were authorized for issuance pursuant to 2022 Plan awards at the time the plan was approved on March 4, 2022.\nTITLE: Restricted Stock Units\nTEXT: A summary of the Company’s RSU activity and related information for 2025 is as follows:\nTEXT: Number ofRSUs(in thousands)Weighted-AverageGrant-Date FairValue Per RSUBalance as of September 28, 2024163,326 $158.73 RSUs granted73,466 $226.68 RSUs vested(76,845)$159.85 RSUs forfeited(8,373)$183.03 Balance as of September 27, 2025151,574 $189.75\nTABLE: TABLE: Number ofRSUs(in thousands) Weighted-AverageGrant-Date FairValue Per RSU; Balance as of September 28, 2024 163,326 $ 158.73; RSUs granted 73,466 $ 226.68; RSUs vested (76,845) $ 159.85; RSUs forfeited (8,373) $ 183.03; Balance as of September 27, 2025 151,574 $ 189.75.\nTITLE: Number ofRSUs(in thousands)Weighted-AverageGrant-Date FairValue Per RSU\nTITLE: Number ofRSUs(in thousands)\nTITLE: Number of\nTITLE: RSUs\nTITLE: Weighted-AverageGrant-Date FairValue Per RSU\nTITLE: Weighted-Average\nTITLE: Grant-Date Fair\nTITLE: Value Per RSU\nTEXT: The weighted-average grant-date fair value of RSUs granted in 2024 and 2023 was $173.78 and $150.87, respectively. The Company estimates the grant-date fair value of RSUs based on the closing price of the Company’s common stock on the date of grant.\nTEXT: The total vesting-date fair value of RSUs was $17.1 billion, $15.8 billion and $15.9 billion for 2025, 2024 and 2023, respectively. The majority of RSUs that vested in 2025, 2024 and 2023 were net share settled such that the Company withheld shares with a value equivalent to the employees’ obligation for the applicable income and other employment taxes, and remitted cash to the appropriate taxing authorities. Total payments to taxing authorities for employees’ tax obligations were $6.1 billion in 2025 and $5.6 billion in both 2024 and 2023.\nTITLE: Share-Based Compensation\nTEXT: The following table shows share-based compensation expense and the related income tax benefit included in the Consolidated Statements of Operations for 2025, 2024 and 2023 (in millions):\nTEXT: 202520242023Share-based compensation expense$12,863 $11,688 $10,833 Income tax benefit related to share-based compensation expense$(3,602)$(3,350)$(3,421)\nTABLE: TABLE_ROW: Share-based compensation expense — 2025: 12,863; 2024: 11,688; 2023: 10,833\nTABLE_ROW: Income tax benefit related to share-based compensation expense — 2025: (3,602); 2024: (3,350); 2023: (3,421)\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTEXT: As of September 27, 2025, the total unrecognized compensation cost related to outstanding RSUs was $21.8 billion, which the Company expects to recognize over a weighted-average period of 2.5 years.\nTEXT: Apple Inc. | 2025 Form 10-K | 45\nTITLE: Unconditional Purchase Obligations\nTEXT: The Company has entered into certain off–balance sheet commitments that require the future purchase of goods or services (“unconditional purchase obligations”). The Company’s unconditional purchase obligations primarily consist of supplier arrangements, licensed intellectual property and content, and distribution rights. Future payments under unconditional purchase obligations with a remaining term in excess of one year as of September 27, 2025, are as follows (in millions):\nTEXT: 2026$4,752 20273,708 20281,981 20291,306 2030788 Thereafter773 Total$13,308\nTABLE: TABLE: 2026 $ 4,752; 2027 3,708; 2028 1,981; 2029 1,306; 2030 788; Thereafter 773; Total $ 13,308.\n"
    },
    {
      "cluster": 12,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, components, loss, sales, subject, other, available, sources, cost, products\n\nTITLE: Contingencies\nTEXT: The Company is subject to various legal proceedings and claims that have arisen in the ordinary course of business and that have not been fully resolved. The outcome of litigation is inherently uncertain. In the opinion of management, there was not at least a reasonable possibility the Company may have incurred a material loss, or a material loss greater than a recorded accrual, concerning loss contingencies for asserted legal and other claims.\nTITLE: Concentrations in the Available Sources of Supply of Materials and Product\nTEXT: Although most components essential to the Company’s business are generally available from multiple sources, certain components are currently obtained from single or limited sources. The Company also competes for various components with other participants in the markets for smartphones, personal computers, tablets, wearables and accessories. Therefore, many components used by the Company, including those that are available from multiple sources, are at times subject to industry-wide shortage and significant commodity pricing fluctuations. Restrictions on international trade can increase the cost or limit the availability of the Company’s products and the components and rare earths and other raw materials that go into them.\nTEXT: The Company uses some custom components that are not commonly used by its competitors, and new products introduced by the Company often utilize custom components available from only one source. When a component or product uses new technologies, initial capacity constraints may exist until the suppliers’ yields have matured or their manufacturing capacities have increased. The Company has entered into agreements for the supply of many components; however, the Company may not be able to extend or renew agreements for the supply of components on similar terms, or at all, and may not be successful in obtaining sufficient quantities from its suppliers or in a timely manner, or in identifying and obtaining sufficient quantities from an alternative source. In addition, component suppliers may fail, be subject to consolidation within a particular industry, or decide to concentrate on the production of common components instead of components customized to meet the Company’s requirements, further limiting the Company’s ability to obtain sufficient quantities of components on commercially reasonable terms, or at all.\nTEXT: Substantially all of the Company’s hardware products are manufactured by outsourcing partners that are located primarily in China mainland, India, Japan, South Korea, Taiwan and Vietnam.\nTEXT: Apple Inc. | 2025 Form 10-K | 46\nTITLE: 2025\nTITLE: AmericasEuropeGreaterChinaJapanRest ofAsia PacificCorporateTotal\nTITLE: Americas\nTITLE: Europe\nTITLE: GreaterChina\nTITLE: Greater\nTITLE: China\nTITLE: Japan\nTITLE: Rest ofAsia Pacific\nTITLE: Corporate\nTITLE: Total\nTEXT: 2024AmericasEuropeGreaterChinaJapanRest ofAsia PacificCorporateTotalNet sales$167,045 $101,328 $66,952 $25,052 $30,658 $— $391,035 Cost of sales(89,587)(55,197)(37,519)(11,744)(16,305)— (210,352)Research and development— — — — — (31,370)(31,370)Selling and marketing(9,802)(4,341)(2,351)(854)(1,291)— (18,639)General and administrative— — — — — (7,458)(7,458)Operating income/(loss)$67,656 $41,790 $27,082 $12,454 $13,062 $(38,828)$123,216\nTABLE: TABLE: Americas Europe GreaterChina Japan Rest ofAsia Pacific Corporate Total; Net sales $ 167,045 $ 101,328 $ 66,952 $ 25,052 $ 30,658 $ — $ 391,035; Cost of sales (89,587) (55,197) (37,519) (11,744) (16,305) — (210,352); Research and development — — — — — (31,370) (31,370); Selling and marketing (9,802) (4,341) (2,351) (854) (1,291) — (18,639); General and administrative — — — — — (7,458) (7,458); Operating income/(loss) $ 67,656 $ 41,790 $ 27,082 $ 12,454 $ 13,062 $ (38,828) $ 123,216.\nTITLE: 2024\nTITLE: AmericasEuropeGreaterChinaJapanRest ofAsia PacificCorporateTotal\nTITLE: Americas\nTITLE: Europe\nTITLE: GreaterChina\nTITLE: Greater\nTITLE: China\nTITLE: Japan\nTITLE: Rest ofAsia Pacific\nTITLE: Corporate\nTITLE: Total\nTEXT: 2023AmericasEuropeGreaterChinaJapanRest ofAsia PacificCorporateTotalNet sales$162,560 $94,294 $72,559 $24,257 $29,615 $— $383,285 Cost of sales(92,394)(54,101)(39,787)(11,542)(16,313)— (214,137)Research and development— — — — — (29,915)(29,915)Selling and marketing(9,658)(4,095)(2,444)(827)(1,236)— (18,260)General and administrative— — — — — (6,672)(6,672)Operating income/(loss)$60,508 $36,098 $30,328 $11,888 $12,066 $(36,587)$114,301\nTABLE: TABLE: Americas Europe GreaterChina Japan Rest ofAsia Pacific Corporate Total; Net sales $ 162,560 $ 94,294 $ 72,559 $ 24,257 $ 29,615 $ — $ 383,285; Cost of sales (92,394) (54,101) (39,787) (11,542) (16,313) — (214,137); Research and development — — — — — (29,915) (29,915); Selling and marketing (9,658) (4,095) (2,444) (827) (1,236) — (18,260); General and administrative — — — — — (6,672) (6,672); Operating income/(loss) $ 60,508 $ 36,098 $ 30,328 $ 11,888 $ 12,066 $ (36,587) $ 114,301.\nTITLE: 2023\nTITLE: AmericasEuropeGreaterChinaJapanRest ofAsia PacificCorporateTotal\nTITLE: Americas\nTITLE: Europe\nTITLE: GreaterChina\nTITLE: Greater\nTITLE: China\nTITLE: Japan\nTITLE: Rest ofAsia Pacific\nTITLE: Corporate\n"
    },
    {
      "cluster": 13,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfinancial, september, statements, company, audits, apple, opinion, accounting, pcaob, sales\n\nTITLE: Total\nTEXT: Apple Inc. | 2025 Form 10-K | 47\nTEXT: The following tables show net sales for 2025, 2024 and 2023 and long-lived assets as of September 27, 2025 and September 28, 2024 for countries that individually accounted for 10% or more of the respective totals, as well as aggregate amounts for the remaining countries (in millions):\nTEXT: 202520242023Net sales:U.S.$151,790 $142,196 $138,573 China (1)64,377 66,952 72,559 Other countries199,994 181,887 172,153 Total net sales$416,161 $391,035 $383,285\nTABLE: TABLE_ROW: U.S. — 2025: 151,790; 2024: 142,196; 2023: 138,573\nTABLE_ROW: China (1) — 2025: 64,377; 2024: 66,952; 2023: 72,559\nTABLE_ROW: Other countries — 2025: 199,994; 2024: 181,887; 2023: 172,153\nTABLE_ROW: Total net sales — 2025: 416,161; 2024: 391,035; 2023: 383,285\nTITLE: 202520242023\nTITLE: 2025\nTITLE: 2024\nTITLE: 2023\nTITLE: 20252024Long-lived assets:U.S.$40,274 $35,664 China (1)3,617 4,797 Other countries5,943 5,219 Total long-lived assets$49,834 $45,680\nTABLE: TABLE_ROW: U.S. — 2025: 40,274; 2024: 35,664\nTABLE_ROW: China (1) — 2025: 3,617; 2024: 4,797\nTABLE_ROW: Other countries — 2025: 5,943; 2024: 5,219\nTABLE_ROW: Total long-lived assets — 2025: 49,834; 2024: 45,680\nTITLE: 20252024Long-lived assets:U.S.$40,274 $35,664 China (1)3,617 4,797 Other countries5,943 5,219 Total long-lived assets$49,834 $45,680\nTITLE: 20252024\nTITLE: 2025\nTITLE: 2024\nTEXT: (1)China includes Hong Kong and Taiwan.\nTEXT: Apple Inc. | 2025 Form 10-K | 48\nTITLE: Report of Independent Registered Public Accounting Firm\nTEXT: To the Shareholders and the Board of Directors of Apple Inc.\nTITLE: Opinion on the Financial Statements\nTEXT: We have audited the accompanying consolidated balance sheets of Apple Inc. (the “Company”) as of September 27, 2025 and September 28, 2024, the related consolidated statements of operations, comprehensive income, shareholders’ equity and cash flows for each of the three years in the period ended September 27, 2025, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company at September 27, 2025 and September 28, 2024, and the results of its operations and its cash flows for each of the three years in the period ended September 27, 2025, in conformity with U.S. generally accepted accounting principles (“GAAP”).\nTEXT: We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (“PCAOB”), the Company’s internal control over financial reporting as of September 27, 2025, based on criteria established in Internal Control – Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated October 31, 2025 expressed an unqualified opinion thereon.\nTITLE: Basis for Opinion\nTEXT: These financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n"
    },
    {
      "cluster": 14,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\npositions, company, uncertain, audit, management, matter, financial, statements, laws, more\n\nTITLE: Critical Audit Matter\nTEXT: The critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nTEXT: Uncertain Tax PositionsDescription of the MatterAs discussed in Note 7 to the financial statements, the Company is subject to income taxes in the U.S. and numerous foreign jurisdictions. As of September 27, 2025, the total amount of gross unrecognized tax benefits was $23.2 billion, of which $10.6 billion, if recognized, would impact the Company’s effective tax rate. In accounting for some of the uncertain tax positions, the Company uses significant judgment in the interpretation and application of GAAP and complex domestic and international tax laws.Auditing management’s evaluation of whether an uncertain tax position is more likely than not to be sustained and the measurement of the benefit of various tax positions can be complex, involves significant judgment, and is based on interpretations of tax laws.\nTABLE: TABLE: Description of the Matter As discussed in Note 7 to the financial statements, the Company is subject to income taxes in the U.S. and numerous foreign jurisdictions. As of September 27, 2025, the total amount of gross unrecognized tax benefits was $23.2 billion, of which $10.6 billion, if recognized, would impact the Company’s effective tax rate. In accounting for some of the uncertain tax positions, the Company uses significant judgment in the interpretation and application of GAAP and complex domestic and international tax laws.Auditing management’s evaluation of whether an uncertain tax position is more likely than not to be sustained and the measurement of the benefit of various tax positions can be complex, involves significant judgment, and is based on interpretations of tax laws..\nTITLE: Uncertain Tax Positions\nTEXT: As discussed in Note 7 to the financial statements, the Company is subject to income taxes in the U.S. and numerous foreign jurisdictions. As of September 27, 2025, the total amount of gross unrecognized tax benefits was $23.2 billion, of which $10.6 billion, if recognized, would impact the Company’s effective tax rate. In accounting for some of the uncertain tax positions, the Company uses significant judgment in the interpretation and application of GAAP and complex domestic and international tax laws.\nTEXT: Auditing management’s evaluation of whether an uncertain tax position is more likely than not to be sustained and the measurement of the benefit of various tax positions can be complex, involves significant judgment, and is based on interpretations of tax laws.\nTEXT: Apple Inc. | 2025 Form 10-K | 49\nTEXT: How We Addressed theMatter in Our AuditWe tested controls relating to the evaluation of uncertain tax positions, including controls over management’s assessment as to whether tax positions are more likely than not to be sustained, management’s process to measure the benefit of its tax positions that qualify for recognition, and the related disclosures.We evaluated the Company’s assessment of which tax positions are more likely than not to be sustained and the related measurement of the amount of tax benefit that qualifies for recognition. Our audit procedures included, among others, reading and evaluating management’s assumptions and analysis, and, as applicable, the Company’s communications with taxing authorities, that detailed the basis and technical merits of the uncertain tax positions. We involved our tax subject matter resources in assessing the technical merits of certain of the Company’s tax positions based on our knowledge of relevant tax laws and experience with related taxing authorities. In addition, we evaluated the Company’s disclosure in relation to these matters included in Note 7 to the financial statements.\nTEXT: We tested controls relating to the evaluation of uncertain tax positions, including controls over management’s assessment as to whether tax positions are more likely than not to be sustained, management’s process to measure the benefit of its tax positions that qualify for recognition, and the related disclosures.\nTEXT: We evaluated the Company’s assessment of which tax positions are more likely than not to be sustained and the related measurement of the amount of tax benefit that qualifies for recognition. Our audit procedures included, among others, reading and evaluating management’s assumptions and analysis, and, as applicable, the Company’s communications with taxing authorities, that detailed the basis and technical merits of the uncertain tax positions. We involved our tax subject matter resources in assessing the technical merits of certain of the Company’s tax positions based on our knowledge of relevant tax laws and experience with related taxing authorities. In addition, we evaluated the Company’s disclosure in relation to these matters included in Note 7 to the financial statements.\nTEXT: We have served as the Company’s auditor since 2009.\nTEXT: Apple Inc. | 2025 Form 10-K | 50\nTITLE: Report of Independent Registered Public Accounting Firm\nTEXT: To the Shareholders and the Board of Directors of Apple Inc.\n"
    },
    {
      "cluster": 15,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfinancial, internal, control, reporting, company, accordance, reasonable, september, audit, based\n\nTITLE: Opinion on Internal Control Over Financial Reporting\nTEXT: We have audited Apple Inc.’s internal control over financial reporting as of September 27, 2025, based on criteria established in Internal Control – Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the “COSO criteria”). In our opinion, Apple Inc. (the “Company”) maintained, in all material respects, effective internal control over financial reporting as of September 27, 2025, based on the COSO criteria.\nTEXT: We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (“PCAOB”), the consolidated balance sheets of the Company as of September 27, 2025 and September 28, 2024, the related consolidated statements of operations, comprehensive income, shareholders’ equity and cash flows for each of the three years in the period ended September 27, 2025, and the related notes and our report dated October 31, 2025 expressed an unqualified opinion thereon.\nTITLE: Basis for Opinion\nTEXT: The Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nTEXT: Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nTITLE: Definition and Limitations of Internal Control Over Financial Reporting\nTEXT: A company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nTEXT: Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nTEXT: Apple Inc. | 2025 Form 10-K | 51\n"
    }
  ]
}