[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.02\nTEXT: Item 2.02 Results of Operations and Financial Condition. On October 30, 2025, Apple Inc. (“Apple”) issued a press release regarding Apple’s financial results for its fourth fiscal quarter ended September 27, 2025. A copy of Apple’s press release is attached hereto as Exhibit 99.1. On October 30, 2025, Apple Inc. (“Apple”) issued a press release regarding Apple’s financial results for its fourth fiscal quarter ended September 27, 2025. A copy of Apple’s press release is attached hereto as Exhibit 99.1. The information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing. The information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. ExhibitNumberExhibit Description99.1Press release issued by Apple Inc. on October 30, 2025.104Inline XBRL for the cover page of this Current Report on Form 8-K. ExhibitNumberExhibit Description99.1Press release issued by Apple Inc. on October 30, 2025.104Inline XBRL for the cover page of this Current Report on Form 8-K. ExhibitNumberExhibit Description99.1Press release issued by Apple Inc. on October 30, 2025.104Inline XBRL for the cover page of this Current Report on Form 8-K. ExhibitNumberExhibit Description 99.1Press release issued by Apple Inc. on October 30, 2025. Press release issued by Apple Inc. on October 30, 2025. Press release issued by Apple Inc. on October 30, 2025. Press release issued by Apple Inc. on October 30, 2025. Press release issued by Apple Inc. on October 30, 2025. 104Inline XBRL for the cover page of this Current Report on Form 8-K. Inline XBRL for the cover page of this Current Report on Form 8-K. Inline XBRL for the cover page of this Current Report on Form 8-K. Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Date:October 30, 2025Apple Inc.By:/s/ Kevan ParekhKevan ParekhSenior Vice President,Chief Financial Officer Date:October 30, 2025Apple Inc.By:/s/ Kevan ParekhKevan ParekhSenior Vice President,Chief Financial Officer Date:October 30, 2025Apple Inc.By:/s/ Kevan ParekhKevan ParekhSenior Vice President,Chief Financial Officer Date:October 30, 2025Apple Inc. Senior Vice President,Chief Financial Officer Senior Vice President,Chief Financial Officer Senior Vice President,Chief Financial Officer\n"
  }
]