{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfinancial, discussion, condition, results, operations, december, form, analysis, annual, report\n\nTEXT: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nTEXT: The following discussion should be read in conjunction with the Consolidated Financial Statements as of December 28, 2024 and December 30, 2023 and for each of the three years in the period ended December 28, 2024 and related notes, which are included in this Annual Report on Form 10-K as well as with the other sections of this Annual Report on Form 10-K, “Part II, Item 8: Financial Statements and Supplementary Data.”\nTITLE: Introduction\nTEXT: In this section, we will describe the general financial condition and the results of operations of Advanced Micro Devices, Inc. and its wholly-owned subsidiaries (collectively, “us,” “our” or “AMD”), including a discussion of our results of operations for 2024 compared to 2023, an analysis of changes in our financial condition and a discussion of our off-balance sheet arrangements. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 30, 2023.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenue, driven, performance, data, center, leadership, higher, primarily, gaming, series\n\nTITLE: Overview\nTEXT: In 2024, we delivered strong annual revenue growth with net revenue increasing 14% to $25.8 billion, compared to $22.7 billion in 2023. This growth was driven by the performance of our Data Center and Client segments. Data Center net revenue of $12.6 billion increased by 94% compared to $6.5 billion in 2023, driven by higher sales of our AMD Instinct™ GPUs and AMD EPYC™ CPUs. Client segment net revenue of $7.1 billion in 2024 increased by 52% compared to $4.7 billion in 2023, primarily due to higher sales of our AMD Ryzen™ mobile and desktop processors. The increase in annual net revenue was partially offset by a decrease in net revenue in our Gaming and Embedded segments. Gaming net revenue of $2.6 billion decreased by 58% compared to $6.2 billion in 2023. The decrease in net revenue was primarily due to lower semi-custom product revenue. Embedded net revenue of $3.6 billion decreased by 33% compared to net revenue of $5.3 billion in 2023, as customers normalized their inventory levels.\nTEXT: During the year, we successfully launched multiple leadership products and made significant progress executing our AI strategy. One of our priorities in 2024 was to accelerate growth in our Data Center segment. The demand for our Data Center AI accelerator products was very strong led by large hyperscale cloud customers deploying our AMD Instinct MI300X GPU accelerators. During the year, we unveiled an accelerated AMD Instinct accelerator roadmap to deliver an annual cadence of leadership AI solutions. To further expand our high-performance server CPU portfolio, we launched our 5th Gen AMD EPYC™ processors, formerly codenamed “Turin,” built with our latest “Zen 5” core architecture designed to deliver leadership performance and efficiency.\nTEXT: We took a major step in our AI PC roadmap with the launch of AMD Ryzen AI 300 Series processors that combine leadership compute capabilities based on our “Zen 5” architecture and an industry-leading neural processing unit (NPU) powered by our XDNA 2 architecture for next-generation AI PCs. We added to our Ryzen family of desktop CPUs with the Ryzen 9000 series processors for laptop and desktop PCs that deliver leadership performance in gaming, productivity and content creation. In our Gaming segment, we extended our multigenerational partnership with Sony as they introduced the PlayStation® 5 Pro, which features a new AMD semi-custom SoC designed to deliver increases in graphics and ray tracing performance to enable AI-driven upscaling.\nTEXT: We expanded our adaptive computing portfolio with differentiated solutions with the launch of the new Versal™ Series Gen 2 devices, including the new Versal AI Edge Series Gen 2 and Versal Prime Series Gen 2 adaptive SoCs, which bring preprocessing, AI inference, and postprocessing together in a single device for end-to-end acceleration of AI-driven embedded systems.\nTEXT: To execute our AI strategy, we brought together multiple AI teams across AMD to drive development of a comprehensive software ecosystem spanning our full product portfolio. We made several key optimizations and introduced new features in the latest AMD ROCm™ software that increased performance in key generative AI workloads, expanded support and optimization for additional frameworks and libraries, and simplified the overall developer experience. We also made strategic investments to further expand our AI software capabilities with the acquisition of Silo AI Oy (Silo AI), an AI lab based in Finland. The acquisition of Silo AI enables customers to accelerate development and deployment of AI models on AMD hardware. Silo AI has also developed a software stack used to train multiple state-of-the-art large language models (LLMs) on AMD Instinct accelerators that can accelerate the development of highly-performant AMD training solutions.\nTEXT: We also focused on extending our data center infrastructure capabilities by entering into an agreement in August 2024 to acquire ZT Group Int’l, Inc. (ZT Systems), a provider of AI and general purpose compute infrastructure for hyperscale computing companies. We believe that with the acquisition of ZT Systems, we can accelerate time to market for our leadership AI training and inferencing solutions. The acquisition is expected to close in the first half of fiscal year 2025, subject to certain regulatory approvals and other customary closing conditions. We intend to seek a strategic partner to acquire ZT Systems' manufacturing business.\nTEXT: Gross margin, as a percentage of net revenue, was 49% for 2024, compared to 46% in 2023. The increase in gross margin was primarily due to a favorable shift in revenue mix with higher Data Center and Client revenues, lower Gaming revenue, partially offset by the impact of lower Embedded revenue. Operating income for 2024 was $1.9 billion compared to operating income of $401 million for 2023. The increase in operating income was primarily driven by higher revenue, partially offset by increased R&D investments. Net income for 2024 was $1.6 billion compared to $854 million in the prior year. The increase in net income was primarily driven by higher revenue.\nTEXT: Cash, cash equivalents and short-term investments as of December 28, 2024 were $5.1 billion, compared to $5.8 billion at the end of 2023. Our aggregate principal amount of total debt as of December 28, 2024 was $1.8 billion, compared to $2.5 billion as of December 30, 2023. We repaid our 2.95% Senior Notes due 2024 with a principal amount of $750 million in June 2024.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nestimates, revenue, actual, financial, adjustments, customers, price, results, statements, based\n\nTEXT: During the twelve months ended December 28, 2024, we returned a total of $862 million to shareholders through the repurchase of 5.9 million shares of common stock under our stock repurchase program. As of December 28, 2024, $4.7 billion remained available for future stock repurchases under this program. The stock repurchase program does not obligate us to acquire any common stock, has no termination date and may be suspended or discontinued at any time.\nTEXT: We intend the discussion of our financial condition and results of operations that follows to provide information that will assist in understanding our financial statements, the changes in certain key items in those financial statements from period to period, the primary factors that resulted in those changes, and how certain accounting principles, policies and estimates affect our financial statements.\nTITLE: Critical Accounting Estimates\nTEXT: Our discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP). The preparation of our financial statements requires us to make estimates and judgments that affect the reported amounts in our Consolidated Financial Statements. We evaluate our estimates on an on-going basis, including those related to our revenue, inventories, goodwill, long-lived and intangible assets, and income taxes. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities. Although actual results have historically been reasonably consistent with management’s expectations, the actual results may differ from these estimates or our estimates may be affected by different assumptions or conditions.\nTEXT: Management believes the following critical accounting estimates are the most significant to the presentation of our financial statements and require the most difficult, subjective and complex judgments.\nTEXT: Revenue Allowances. Revenue contracts with our customers include variable amounts which we evaluate under ASC 606-10-32-8 through 14 in order to determine the net amount of consideration to which we are entitled and which we recognize as revenue. We determine the net amount of consideration to which we are entitled by estimating the most likely amount of consideration we expect to receive from the customer after adjustments to the contract price for rights of return and rebates to our original equipment manufacturers (OEM) customers and rights of return, rebates and price protection on unsold merchandise to our distributor customers.\nTEXT: We base our determination of necessary adjustments to the contract price by reference to actual historical activity and experience, including actual historical returns, rebates and credits issued to OEM and distributor customers adjusted, as applicable, to include adjustments, if any, for known events or current economic conditions, or both.\nTEXT: Our estimates of necessary adjustments for distributor price incentives and price protection on unsold products held by distributors are based on actual historical incentives provided to distributor customers and known future price movements based on our internal and external market data analysis.\nTEXT: Our estimates of necessary adjustments for OEM price incentives utilize, in addition to known pricing agreements, actual historical rebate attainment rates and estimates of future OEM rebate program attainment based on internal and external market data analysis.\nTEXT: We offer incentive programs through cooperative advertising and marketing promotions. Where funds provided for such programs can be estimated, we recognize a reduction to revenue at the time the related revenue is recognized; otherwise, we recognize such reduction to revenue at the later of when: i) the related revenue transaction occurs; or ii) the program is offered. For transactions where we reimburse a customer for a portion of the customer’s cost to perform specific product advertising or marketing and promotional activities, such amounts are recognized as a reduction to revenue unless they qualify for expense recognition.\nTEXT: We also provide limited product return rights to certain OEMs and to most distribution customers. These return rights are generally limited to a contractual percentage of the customer’s prior quarter shipments, although, from time to time we may approve additional product returns beyond the contractual arrangements based on the applicable facts and circumstances. In order to estimate adjustments to revenue to account for these returns, including product restocking rights provided to distributor and OEM customers, we utilize relevant, trended actual historical product return rate information gathered, adjusted for actual known information or events, as applicable.\nTEXT: Overall, our estimates of adjustments to contract price due to variable consideration under our contracts with OEM and distributor customers, based on our assumptions and include adjustments, if any, for known events, have been materially consistent with actual results; however, these estimates are subject to management’s judgment and actual provisions could be different from our estimates and current provisions, resulting in future adjustments to our revenue and operating results.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nvalue, assets, impairment, future, reporting, valuation, fair, goodwill, income, than\n\nTEXT: Inventory Valuation. We value inventory at standard cost, adjusted to approximate the lower of actual cost or estimated net realizable value using assumptions about future demand and market conditions. Material assumptions we use to estimate necessary inventory carrying value adjustments can be unique to each product and are based on specific facts and circumstances. In determining excess or obsolescence reserves for products, we consider assumptions such as changes in business and economic conditions, other-than-temporary decreases in demand for our products, and changes in technology or customer requirements. In determining the lower of cost or net realizable value reserves, we consider assumptions such as recent historical sales activity and selling prices, as well as estimates of future selling prices. If in any period we anticipate a change in assumptions such as future demand or market conditions to be less favorable than our previous estimates, additional inventory write-downs may be required and would be reflected in cost of sales, resulting in a negative impact to our gross margin in that period. If in any period we are able to sell inventories that had been written down to a level below the ultimate realized selling price in a previous period, related revenue would be recorded with a lower or no offsetting charge to cost of sales resulting in a net benefit to our gross margin in that period. Overall, our estimates of inventory carrying value adjustments have been materially consistent with actual results.\nTEXT: Goodwill. Goodwill is the excess of the aggregate of the consideration transferred over the identifiable assets acquired and liabilities assumed in connection with business combinations. Our reporting units are at the operating segment level. Our goodwill is contained within four reporting units: Data Center, Client, Gaming and Embedded.\nTEXT: We perform our goodwill impairment analysis as of the first day of the fourth quarter of each year and, if certain events or circumstances indicate that an impairment loss may have been incurred, on a more frequent basis. The analysis may include both qualitative and quantitative factors to assess the likelihood of an impairment, which occurs when the carrying value of a reporting unit exceeds its fair value. Significant judgment is required in estimating the fair value of our reporting units to determine if the fair values of those units exceed their carrying values and an impairment to goodwill is required when a quantitative goodwill impairment test is performed. We typically obtain the assistance of third-party valuation specialists to help in determining the fair value of our reporting units. Changes in operating plans or adverse changes in the business or in the macroeconomic environment in the future could reduce the underlying cash flows used to estimate fair values and could result in a decline in fair value that would trigger future impairment charges of our reporting units’ goodwill. Based on our annual qualitative impairment test, we concluded it is not more likely than not that the carrying value of each reporting unit exceeded its fair value.\nTEXT: Long-Lived and Intangible Assets. Long-lived and intangible assets to be held and used are reviewed for impairment if indicators of potential impairment exist and at least annually for indefinite-lived intangible assets. Impairment indicators are reviewed on a quarterly basis. Assets are grouped and evaluated for impairment at the lowest level of identifiable cash flows. When indicators of impairment exist and assets are held for use, we estimate future undiscounted cash flows attributable to the related asset groups. In the event such cash flows are not expected to be sufficient to recover the recorded value of the assets, the assets are written down to their estimated fair values based on the expected discounted future cash flows attributable to the asset group or based on appraisals.\nTEXT: Income Taxes. In determining taxable income for financial statement reporting purposes, we must make certain estimates and judgments. These estimates and judgments are applied in the calculation of certain tax liabilities and in the determination of the recoverability of deferred tax assets which arise from temporary differences between the recognition of assets and liabilities for tax and financial statement reporting purposes.\nTEXT: We regularly assess the likelihood that we will be able to recover our deferred tax assets. Unless recovery is considered more-likely-than-not (a probability level of more than 50%), we will record a charge to income tax expense in the form of a valuation allowance for the deferred tax assets that we estimate will not ultimately be recoverable or maintain the valuation allowance recorded in prior periods. When considering all available evidence, if we determine it is more-likely-than-not we will realize our deferred tax assets, we will reverse some or all of the existing valuation allowance, which would result in a credit to income tax expense and the establishment of an asset in the period of reversal.\nTEXT: In determining the need to establish or maintain a valuation allowance, we consider the four sources of jurisdictional taxable income: (i) carryback of net operating losses to prior years; (ii) future reversals of existing taxable temporary differences; (iii) viable and prudent tax planning strategies; and (iv) future taxable income exclusive of reversing temporary differences and carryforwards.\nTEXT: The federal valuation allowance maintained is due to limitations, under Internal Revenue Code Section 382 or 383, separate return loss year rules, or dual consolidated loss rules. Certain state and foreign valuation allowances are maintained due to a lack of sufficient sources of future taxable income.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenue, operating, income, primarily, higher, data, lower, other, loss, center\n\nTEXT: In addition, the calculation of our tax liabilities involves addressing uncertainties in the application of complex, multi-jurisdictional tax rules and the potential for future adjustment of our uncertain tax positions by the Internal Revenue Service or other taxing authorities.\nTITLE: Results of Operations\nTEXT: Additional information on our reportable segments is contained in Note 4 – Segment Reporting of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K).\nTEXT: Our operating results tend to vary seasonally. Historically, our net revenue has been generally higher in the second half of the year than in the first half of the year, although market conditions and product transitions could impact these trends.\nTEXT: The following table provides a summary of net revenue and operating income (loss) by segment for 2024 and 2023:\nTEXT: Year EndedDecember 28,2024December 30,2023(In millions)Net revenue:Data Center$12,579 $6,496 Client7,054 4,651 Gaming2,595 6,212 Embedded3,557 5,321 Total net revenue$25,785 $22,680 Operating income (loss):Data Center$3,482 $1,267 Client897 (46)Gaming290 971 Embedded1,421 2,628 All Other(4,190)(4,419)Total operating income$1,900 $401\nTABLE: TABLE: December 28,2024 December 30,2023; Data Center $ 12,579 $ 6,496; Client 7,054 4,651; Gaming 2,595 6,212; Embedded 3,557 5,321; Total net revenue $ 25,785 $ 22,680; Data Center $ 3,482 $ 1,267; Client 897 (46); Gaming 290 971; Embedded 1,421 2,628; All Other (4,190) (4,419); Total operating income $ 1,900 $ 401.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTITLE: Data Center\nTEXT: Data Center net revenue of $12.6 billion in 2024 increased by 94%, compared to net revenue of $6.5 billion in 2023. The increase was primarily driven by higher sales of AMD Instinct GPUs and AMD EPYC CPUs.\nTEXT: Data Center operating income was $3.5 billion in 2024, compared to operating income of $1.3 billion in 2023. The increase in operating income was primarily due to higher revenue, partially offset by higher R&D investment.\nTITLE: Client\nTEXT: Client net revenue of $7.1 billion in 2024 increased by 52%, compared to net revenue of $4.7 billion in 2023, primarily due to a 34% increase in unit shipments and a 13% increase in average selling price driven by strong demand for AMD mobile and desktop Ryzen processors.\nTEXT: Client operating income was $897 million in 2024, compared to operating loss of $46 million in 2023. The increase in operating income was primarily due to higher revenue, partially offset by higher operating expenses.\nTITLE: Gaming\nTEXT: Gaming net revenue of $2.6 billion in 2024 decreased by 58%, compared to net revenue of $6.2 billion in 2023. The decrease in net revenue was primarily due to lower semi-custom product revenue.\nTEXT: Gaming operating income was $290 million in 2024, compared to operating income of $971 million in 2023. The decrease in operating income was primarily driven by lower revenue.\nTITLE: Embedded\nTEXT: Embedded net revenue of $3.6 billion in 2024 decreased by 33%, compared to net revenue of $5.3 billion in 2023. The decrease in net revenue was primarily due to lower demand as customers continued to normalize their inventory levels.\nTEXT: Embedded operating income was $1.4 billion in 2024, compared to operating income of $2.6 billion in 2023. The decrease in operating income was primarily driven by lower revenue.\nTITLE: All Other\nTEXT: All Other operating loss of $4.2 billion in 2024 primarily consisted of $2.4 billion of amortization of acquisition-related intangibles and $1.4 billion of stock-based compensation expense. All Other operating loss of $4.4 billion in 2023 primarily consisted of $2.8 billion of amortization of acquisition-related intangibles and $1.4 billion of stock-based compensation expense.\nTITLE: Comparison of Gross Margin, Expenses, Licensing Gain, Interest Expense, Other Income (expense) and Income Taxes\nTEXT: The following is a summary of certain Consolidated Statement of Operations data for 2024 and 2023:\nTEXT: December 28, 2024December 30, 2023 (In millions, except for percentages)Net revenue$25,785 $22,680 Cost of sales12,114 11,278 Amortization of acquisition-related intangibles946 942 Gross profit12,725 10,460 Gross margin49%46%Research and development6,456 5,872 Marketing, general and administrative2,783 2,352 Amortization of acquisition-related intangibles1,448 1,869 Restructuring charges186 — Licensing gain(48)(34)Interest expense(92)(106)Other income (expense), net181 197 Income tax provision (benefit)381 (346)\nTABLE: TABLE: December 28, 2024 December 30, 2023; Net revenue $ 25,785 $ 22,680; Cost of sales 12,114 11,278; Amortization of acquisition-related intangibles 946 942; Gross profit 12,725 10,460; Gross margin 49 % 46 %; Research and development 6,456 5,872; Marketing, general and administrative 2,783 2,352; Amortization of acquisition-related intangibles 1,448 1,869; Restructuring charges 186 —; Licensing gain (48) (34); Interest expense (92) (106); Other income (expense), net 181 197; Income tax provision (benefit) 381 (346).\nTITLE: December 28, 2024December 30, 2023\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: (In millions, except for percentages)\nTITLE: Gross Margin\nTEXT: Gross margin as a percentage of net revenue was 49% in 2024 compared to 46% in 2023. The increase in gross margin was due to a favorable shift in revenue mix of higher Data Center and Client revenues, lower Gaming revenue, partially offset by the impact of lower Embedded revenue.\nTITLE: Expenses\nTITLE: Research and Development Expenses\nTEXT: Research and development expenses of $6.5 billion in 2024 increased by $584 million, or 10%, compared to $5.9 billion in 2023. The increase was primarily due to higher employee-related costs due to an increase in headcount in support of our AI strategy.\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nincome, cash, pillar, primarily, december, activities, restructuring, investments, effective, sales\n\nTITLE: Marketing, General and Administrative Expenses\nTEXT: Marketing, general and administrative expenses of $2.8 billion in 2024 increased by $431 million, or 18%, compared to $2.4 billion in 2023. The increase was primarily due to an increase in go-to-market activities to support our revenue growth.\nTITLE: Amortization of Acquisition-Related Intangibles\nTEXT: Amortization of acquisition-related intangibles of $2.4 billion for 2024 decreased by $417 million, or 15%, compared to $2.8 billion in 2023. The decrease was primarily due to certain acquisition-related intangibles being fully amortized in the prior fiscal year.\nTITLE: Restructuring Charges\nTEXT: We recognized $186 million of restructuring charges in 2024 due to the implementation of a restructuring plan (the 2024 Restructuring Plan). The 2024 Restructuring Plan was focused on driving efficiencies across the business and aligning resources with our largest growth opportunities in the AI and enterprise markets.\nTITLE: Licensing Gain\nTEXT: We hold equity interests in two joint ventures (collectively, the THATIC JV) with Higon Information Technology Co., Ltd. (THATIC), a third-party Chinese entity. We recognized $48 million and $34 million of licensing gain from royalty income associated with the licensed IP to the THATIC JV, in 2024 and 2023, respectively.\nTITLE: Interest Expense\nTEXT: Interest expense of $92 million in 2024 decreased by $14 million compared to $106 million in 2023, primarily due to repayment of the 2.95% Senior Notes due in June 2024.\nTITLE: Other Income (expense), net\nTEXT: Other income (expense), net is primarily comprised of interest income from short-term investments, changes in valuation of equity investments and foreign currency transaction gains and losses.\nTEXT: Other income (expense), net was $181 million in 2024 compared to $197 million of Other income, net in 2023. The change was primarily due to a decrease in interest income from lower balances held in short-term investments compared to the prior year.\nTITLE: Income Tax Provision (Benefit)\nTEXT: We recorded an income tax provision of $381 million in 2024 and an income tax benefit of $346 million in 2023, representing effective tax rates of 19% and (68%), respectively. The increase in income tax provision in 2024 was primarily due to higher pre-tax income and a $373 million tax effect from an intercompany integration transaction.\nTEXT: The OECD is continuing discussions surrounding fundamental changes in allocation of profits among tax jurisdictions in which companies do business, as well as the implementation of a global minimum tax (namely the “Pillar One” and “Pillar Two” proposals). The Council of the European Union has adopted the global corporate 15% minimum tax as provided for in Pillar Two and has directed EU member states to implement legislation enacting Pillar Two. Many countries, including non-EU member states, have implemented laws based on Pillar Two proposals, with effective dates that started in 2024. Although many countries have already introduced Pillar Two legislation applicable to us effective in 2024, certain jurisdictions in which we operate have not adopted corresponding legislation to date. For 2024, the impact to us associated with Pillar Two was immaterial. We continue to evaluate the impact of proposed and enacted legislative changes to our effective tax rate and cash flows as new guidance becomes available.\nTITLE: International Sales\nTEXT: International sales as a percentage of net revenue were 66% in 2024 and 65% in 2023. We expect that international sales will continue to be a significant portion of total sales in the foreseeable future. Substantially all of our sales transactions are denominated in U.S. dollars.\nTITLE: FINANCIAL CONDITION\nTITLE: Liquidity and Capital Resources\nTEXT: As of December 28, 2024, our cash, cash equivalents and short-term investments were $5.1 billion compared to $5.8 billion as of December 30, 2023. The percentage of cash and cash equivalents held domestically was 90% as of December 28, 2024, and 77% as of December 30, 2023.\nTEXT: Our operating, investing and financing cash flow activities for 2024 and 2023 were as follows:December 28, 2024December 30, 2023 (In millions)Net cash provided by (used in):Operating activities$3,041 $1,667 Investing activities(1,101)(1,423)Financing activities(2,062)(1,146)Net decrease in cash, cash equivalents and restricted cash$(122)$(902)\nTABLE: TABLE: December 28, 2024 December 30, 2023; Operating activities $ 3,041 $ 1,667; Investing activities (1,101) (1,423); Financing activities (2,062) (1,146); Net decrease in cash, cash equivalents and restricted cash $ (122) $ (902).\nTITLE: December 28, 2024December 30, 2023\nTITLE: December 28, 2024\nTITLE: December 30, 2023\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, primarily, used, short, term, investments, will, common, stock, operating\n\nTITLE: (In millions)\nTEXT: Net decrease in cash, cash equivalents and restricted cash\nTEXT: We have $3.0 billion available under an unsecured revolving credit facility that expires on April 29, 2027. No funds were drawn from this credit facility during the year ended December 28, 2024.\nTEXT: We also have a commercial paper program to issue unsecured commercial paper notes up to a maximum principal amount outstanding, at any time, of $3.0 billion, with a maturity of up to 397 days from the date of issue. We did not issue any commercial paper during the year ended December 28, 2024.\nTEXT: Our aggregate principal debt obligations were $1.8 billion as of December 28, 2024. Our 2.95% Notes with a principal amount of $750 million were repaid in June 2024 and our remaining debt will mature starting in 2030.\nTEXT: As of December 28, 2024, we had unconditional purchase commitments of approximately $5.0 billion, of which $4.5 billion are in fiscal year 2025. Our contractual obligations and purchase commitments relate primarily to our obligations to purchase wafers and substrates from third parties and future payments related to certain software and technology licenses and IP licenses. On an ongoing basis, we work with our suppliers on the timing of payments and deliveries of purchase commitments, taking into account business conditions. See Note 17 – Commitments and Guarantees.\nTEXT: On August 17, 2024, we agreed to acquire ZT Systems. Upon closing of the acquisition, we will pay approximately $3.4 billion in cash and 8,335,852 shares of AMD common stock and to the extent certain conditions are met, we will pay an additional $300 million of cash and up to 740,964 shares of AMD common stock. The acquisition is expected to close in the first half of fiscal year 2025, subject to certain regulatory approvals and other customary closing conditions. We intend to seek a strategic partner to acquire ZT Systems' manufacturing business.\nTEXT: We believe our cash, cash equivalents, short-term investments and cash flows from operations along with our revolving credit facility and commercial paper program will be sufficient to fund operations, including capital expenditures, purchase commitments, and acquisitions over the next 12 months and beyond. We believe we will be able to access the capital markets should we require additional funds. However, we cannot assure that such funds will be available on favorable terms, or at all.\nTITLE: Operating Activities\nTEXT: Our working capital cash inflows and outflows from operations consist primarily of cash collections from our customers, payments for inventory purchases and payments for employee-related expenditures.\nTEXT: Net cash provided by operating activities was $3 billion in 2024, primarily due to our net income of $1.6 billion in 2024, adjusted for non-cash adjustments of $3.5 billion and net cash outflows of $2.1 billion from changes in our operating assets and liabilities. The primary drivers of the changes in operating assets and liabilities included a $1.9 billion increase in accounts receivable driven primarily by higher revenue in the last month of 2024 compared to the last month of 2023, and a $1.5 billion increase in inventories driven primarily by a build of inventory to support the ramp of new products in advanced process nodes.\nTEXT: Net cash provided by operating activities was $1.7 billion in 2023, primarily due to our net income of $854 million in 2023, adjusted for non-cash adjustments of $3.9 billion and net cash outflows of $3 billion from changes in our operating assets and liabilities. The primary drivers of the changes in operating assets and liabilities included a $1.3 billion increase in accounts receivable driven primarily by higher revenue in the last month of 2023 compared to the last month of 2022, and a $580 million increase in inventories driven primarily by a build of inventory to support the ramp of new products in advanced process nodes.\nTITLE: Investing Activities\nTEXT: Net cash used in investing activities was $1.1 billion in 2024, which primarily consisted of cash used for purchases of short-term investments of $1.5 billion, $636 million for purchases of property and equipment, and cash used in acquisitions, net of cash acquired of $548 million, partially offset by proceeds from maturities of short-term investments of $1.4 billion and sale of short-term investments of $616 million.\nTEXT: Net cash used in investing activities was $1.4 billion in 2023, which primarily consisted of cash used for purchases of short-term investments of $3.7 billion, $546 million for purchases of property and equipment, and cash used in acquisitions, net of cash acquired of $131 million, partially offset by proceeds from maturities of short-term investments of $2.7 billion and the sale of short-term investments of $300 million.\nTITLE: Financing Activities\nTEXT: Net cash used in financing activities was $2.1 billion in 2024, which primarily consisted of common stock repurchases of $862 million under the Repurchase Program, repurchases to cover tax withholding on employee equity plans of $728 million, and repayment of the 2.95% Notes of $750 million, partially offset by proceeds from the issuance of common stock under our employee equity plans of $279 million.\nTEXT: Net cash used in financing activities was $1.1 billion in 2023, which primarily consisted of common stock repurchases of $985 million under the Repurchase Program and repurchases to cover tax withholding on employee equity plans of $427 million, partially offset by proceeds from the issuance of common stock under our employee equity plans of $268 million.\nTITLE: Off-Balance Sheet Arrangements\nTEXT: As of December 28, 2024, we had no off-balance sheet arrangements.\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, december, financial, statements, share, other, comprehensive, endeddecember, cost, sales\n\nTEXT: Financial Statements and Supplementary Data\nTITLE: Advanced Micro Devices, Inc.\nTITLE: Consolidated Statements of Operations\nTEXT: Year EndedDecember 28,2024December 30,2023December 31,2022 (In millions, except per share amounts)Net revenue$25,785 $22,680 $23,601 Cost of sales12,114 11,278 11,550 Amortization of acquisition-related intangibles946 942 1,448 Total cost of sales13,060 12,220 12,998 Gross profit12,725 10,460 10,603 Research and development6,456 5,872 5,005 Marketing, general and administrative2,783 2,352 2,336 Amortization of acquisition-related intangibles1,448 1,869 2,100 Restructuring charges186 — — Licensing gain(48)(34)(102)Operating income1,900 401 1,264 Interest expense(92)(106)(88)Other income (expense), net181 197 8 Income before income taxes and equity income 1,989 492 1,184 Income tax provision (benefit)381 (346)(122)Equity income in investee33 16 14 Net income$1,641 $854 $1,320 Earnings per share Basic$1.01 $0.53 $0.85 Diluted$1.00 $0.53 $0.84 Shares used in per share calculation Basic1,620 1,614 1,561 Diluted1,637 1,625 1,571\nTABLE: TABLE: December 28,2024 December 30,2023 December 31,2022; Net revenue $ 25,785 $ 22,680 $ 23,601; Cost of sales 12,114 11,278 11,550; Amortization of acquisition-related intangibles 946 942 1,448; Total cost of sales 13,060 12,220 12,998; Gross profit 12,725 10,460 10,603; Research and development 6,456 5,872 5,005; Marketing, general and administrative 2,783 2,352 2,336; Amortization of acquisition-related intangibles 1,448 1,869 2,100; Restructuring charges 186 — —; Licensing gain (48) (34) (102); Operating income 1,900 401 1,264; Interest expense (92) (106) (88); Other income (expense), net 181 197 8; Income before income taxes and equity income 1,989 492 1,184; Income tax provision (benefit) 381 (346) (122); Equity income in investee 33 16 14; Net income $ 1,641 $ 854 $ 1,320; Basic $ 1.01 $ 0.53 $ 0.85; Diluted $ 1.00 $ 0.53 $ 0.84; Basic 1,620 1,614 1,561; Diluted 1,637 1,625 1,571.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\nTITLE: (In millions, except per share amounts)\nTEXT: See accompanying notes to the Consolidated Financial Statements.\nTITLE: Advanced Micro Devices, Inc.\nTITLE: Consolidated Statements of Comprehensive Income\nTEXT: Year EndedDecember 28,2024December 30,2023December 31,2022 (In millions)Net income$1,641 $854 $1,320 Other comprehensive income (loss), net of taxNet change in unrealized gains (losses) on cash flow hedges(59)31 (38)Total comprehensive income$1,582 $885 $1,282\nTABLE: TABLE: December 28,2024 December 30,2023 December 31,2022; Net income $ 1,641 $ 854 $ 1,320; Net change in unrealized gains (losses) on cash flow hedges (59) 31 (38); Total comprehensive income $ 1,582 $ 885 $ 1,282.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\nTITLE: (In millions)\nTEXT: Other comprehensive income (loss), net of tax\nTEXT: See accompanying notes to the Consolidated Financial Statements.\nTITLE: Advanced Micro Devices, Inc.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nliabilities, shares, assets, current, term, other, total, stock, equity, stockholders\n\nTITLE: Consolidated Balance Sheets\nTEXT: December 28,2024December 30,2023 (In millions, except par value amounts)ASSETSCurrent assets:Cash and cash equivalents$3,787 $3,933 Short-term investments1,345 1,840 Accounts receivable, net6,192 4,323 Inventories5,734 4,351 Receivables from related parties113 9 Prepaid expenses and other current assets1,878 2,312 Total current assets19,049 16,768 Property and equipment, net1,802 1,589 Operating lease right-of-use assets623 633 Goodwill24,839 24,262 Acquisition-related intangibles18,930 21,363 Investment: equity method149 99 Deferred tax assets, net688 366 Other non-current assets3,146 2,805 Total assets$69,226 $67,885 LIABILITIES AND STOCKHOLDERS’ EQUITYCurrent liabilities:Accounts payable$1,990 $2,055 Payables to related parties476 363 Accrued liabilities4,260 3,082 Current portion of long-term debt, net— 751 Other current liabilities555 438 Total current liabilities7,281 6,689 Long-term debt, net of current portion1,721 1,717 Long-term operating lease liabilities491 535 Deferred tax liabilities349 1,202 Other long-term liabilities1,816 1,850 Commitments and Contingencies (see Notes 17 and 18)Stockholders’ equity:Capital stock:Common stock, par value $0.01; shares authorized: 2,250; shares issued: 1,680 and 1,663; shares outstanding: 1,622 and 1,61617 17 Additional paid-in capital61,362 59,676 Treasury stock, at cost (shares held: 58 and 47)(6,106)(4,514)Retained earnings2,364 723 Accumulated other comprehensive loss(69)(10)Total stockholders’ equity57,568 55,892 Total liabilities and stockholders’ equity$69,226 $67,885\nTABLE: TABLE: December 28,2024 December 30,2023; Cash and cash equivalents $ 3,787 $ 3,933; Short-term investments 1,345 1,840; Accounts receivable, net 6,192 4,323; Inventories 5,734 4,351; Receivables from related parties 113 9; Prepaid expenses and other current assets 1,878 2,312; Total current assets 19,049 16,768; Property and equipment, net 1,802 1,589; Operating lease right-of-use assets 623 633; Goodwill 24,839 24,262; Acquisition-related intangibles 18,930 21,363; Investment: equity method 149 99; Deferred tax assets, net 688 366; Other non-current assets 3,146 2,805; Total assets $ 69,226 $ 67,885; Accounts payable $ 1,990 $ 2,055; Payables to related parties 476 363; Accrued liabilities 4,260 3,082; Current portion of long-term debt, net — 751; Other current liabilities 555 438; Total current liabilities 7,281 6,689; Long-term debt, net of current portion 1,721 1,717; Long-term operating lease liabilities 491 535; Deferred tax liabilities 349 1,202; Other long-term liabilities 1,816 1,850; Common stock, par value $0.01; shares authorized: 2,250; shares issued: 1,680 and 1,663; shares outstanding: 1,622 and 1,616 17 17; Additional paid-in capital 61,362 59,676; Treasury stock, at cost (shares held: 58 and 47) (6,106) (4,514); Retained earnings 2,364 723; Accumulated other comprehensive loss (69) (10); Total stockholders’ equity 57,568 55,892; Total liabilities and stockholders’ equity $ 69,226 $ 67,885.\nTITLE: December 28,2024December 30,2023\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions, except par value amounts)\nTITLE: ASSETS\nTITLE: Current assets:\nTITLE: Total current assets19,049 16,768\nTITLE: Total current assets\nTITLE: Total assets$69,226 $67,885\nTITLE: Total assets\nTITLE: LIABILITIES AND STOCKHOLDERS’ EQUITY\nTITLE: Current liabilities:\nTITLE: Total current liabilities7,281 6,689\nTITLE: Total current liabilities\nTEXT: Commitments and Contingencies (see Notes 17 and 18)\nTITLE: Stockholders’ equity:\nTEXT: Common stock, par value $0.01; shares authorized: 2,250; shares issued: 1,680 and 1,663; shares outstanding: 1,622 and 1,616\nTEXT: Treasury stock, at cost (shares held: 58 and 47)\nTITLE: Total stockholders’ equity57,568 55,892\nTITLE: Total stockholders’ equity\nTITLE: Total liabilities and stockholders’ equity$69,226 $67,885\nTITLE: Total liabilities and stockholders’ equity\nTEXT: See accompanying notes to the Consolidated Financial Statements.\nTITLE: Advanced Micro Devices, Inc.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nperiod, stock, common, balance, beginning, equity, issuance, acquisition, employee, plans\n\nTITLE: Consolidated Statements of Stockholders’ Equity\nTEXT: Year EndedDecember 28,2024December 30,2023December 31,2022(In millions)Capital stockCommon stockBalance, beginning of period$17 $16 $12 Common stock issued under employee equity plans— 1 — Issuance of common stock as consideration for acquisition— — 4 Balance, end of period$17 $17 $16 Additional paid-in capitalBalance, beginning of period$59,676 $58,005 $11,069 Common stock issued under employee equity plans279 273 167 Stock-based compensation1,407 1,384 1,080 Issuance of common stock to settle convertible debt— 1 — Issuance of common stock as consideration for acquisition— — 45,372 Fair value of replacement share-based awards related to acquisition— — 275 Issuance of common stock warrants— 13 42 Balance, end of period$61,362 $59,676 $58,005 Treasury stockBalance, beginning of period$(4,514)$(3,099)$(2,130)Repurchases of common stock(862)(985)(3,702)Reissuance of treasury stock as consideration for acquisition— — 3,138 Common stock repurchases for tax withholding on employee equity plans(730)(430)(405)Balance, end of period$(6,106)$(4,514)$(3,099)Retained earnings (accumulated deficit)Balance, beginning of period$723 $(131)$(1,451)Net income1,641 854 1,320 Balance, end of period$2,364 $723 $(131)Accumulated other comprehensive lossBalance, beginning of period$(10)$(41)$(3)Other comprehensive income (loss)(59)31 (38)Balance, end of period$(69)$(10)$(41)Total stockholders' equity$57,568 $55,892 $54,750\nTABLE: TABLE: December 28,2024 December 30,2023 December 31,2022; Balance, beginning of period $ 17 $ 16 $ 12; Common stock issued under employee equity plans — 1 —; Issuance of common stock as consideration for acquisition — — 4; Balance, end of period $ 17 $ 17 $ 16; Balance, beginning of period $ 59,676 $ 58,005 $ 11,069; Common stock issued under employee equity plans 279 273 167; Stock-based compensation 1,407 1,384 1,080; Issuance of common stock to settle convertible debt — 1 —; Issuance of common stock as consideration for acquisition — — 45,372; Fair value of replacement share-based awards related to acquisition — — 275; Issuance of common stock warrants — 13 42; Balance, end of period $ 61,362 $ 59,676 $ 58,005; Balance, beginning of period $ (4,514) $ (3,099) $ (2,130); Repurchases of common stock (862) (985) (3,702); Reissuance of treasury stock as consideration for acquisition — — 3,138; Common stock repurchases for tax withholding on employee equity plans (730) (430) (405); Balance, end of period $ (6,106) $ (4,514) $ (3,099); Balance, beginning of period $ 723 $ (131) $ (1,451); Net income 1,641 854 1,320; Balance, end of period $ 2,364 $ 723 $ (131); Balance, beginning of period $ (10) $ (41) $ (3); Other comprehensive income (loss) (59) 31 (38); Balance, end of period $ (69) $ (10) $ (41); Total stockholders' equity $ 57,568 $ 55,892 $ 54,750.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\nTITLE: (In millions)\nTITLE: Capital stock\nTITLE: Retained earnings (accumulated deficit)\nTITLE: Accumulated other comprehensive loss\nTITLE: Total stockholders' equity$57,568 $55,892 $54,750\nTITLE: Total stockholders' equity\nTEXT: See accompanying notes to the Consolidated Financial Statements.\nTITLE: Advanced Micro Devices, Inc.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, activities, operating, other, amortization, related, stock, investments, proceeds, flows\n\nTITLE: Consolidated Statements of Cash Flows\nTEXT: Year EndedDecember 28,2024December 30,2023December 31,2022(In millions)Cash flows from operating activities:Net income$1,641 $854 $1,320 Adjustments to reconcile net income to net cash provided by operating activities:Depreciation and amortization671 642 626 Amortization of acquisition-related intangibles2,393 2,811 3,548 Stock-based compensation1,407 1,384 1,081 Amortization of operating lease right-of-use assets113 98 88 Amortization of inventory fair value adjustment— 3 189 Deferred income taxes(1,163)(1,019)(1,505)Inventory loss at contract manufacturer65 — — Other12 (57)64 Changes in operating assets and liabilities:Accounts receivable, net(1,865)(1,339)(278)Inventories(1,458)(580)(1,401)Prepaid expenses and other assets343 (383)(2,010)Receivables from and payable to related parties, net108 (107)366 Accounts payable(109)(419)931 Accrued and other liabilities883 (221)546 Net cash provided by operating activities3,041 1,667 3,565 Cash flows from investing activities:Purchases of property and equipment(636)(546)(450)Purchases of short-term investments(1,493)(3,722)(2,667)Proceeds from maturity of short-term investments1,416 2,687 4,310 Proceeds from sale of short-term investments616 300 — Cash received from acquisition of Xilinx— — 2,366 Acquisitions, net of cash acquired(548)(131)(1,544)Related party equity method investment(17)— — Issuance of loan to related party(100)— — Purchases of strategic investments(341)(11)(5)Other2 — (11)Net cash provided by (used in) investing activities(1,101)(1,423)1,999 Cash flows from financing activities:Proceeds from debt, net of issuance costs— — 991 Repayment of debt(750)— (312)Proceeds from sales of common stock through employee equity plans279 268 167 Repurchases of common stock(862)(985)(3,702)Stock repurchases for tax withholding on employee equity plans(728)(427)(406)Other(1)(2)(2)Net cash used in financing activities(2,062)(1,146)(3,264)Net increase (decrease) in cash, cash equivalents and restricted cash(122)(902)2,300 Cash, cash equivalents and restricted cash at beginning of year3,933 4,835 2,535 Cash, cash equivalents and restricted cash at end of year$3,811 $3,933 $4,835\nTABLE: TABLE: December 28,2024 December 30,2023 December 31,2022; Net income $ 1,641 $ 854 $ 1,320; Depreciation and amortization 671 642 626; Amortization of acquisition-related intangibles 2,393 2,811 3,548; Stock-based compensation 1,407 1,384 1,081; Amortization of operating lease right-of-use assets 113 98 88; Amortization of inventory fair value adjustment — 3 189; Deferred income taxes (1,163) (1,019) (1,505); Inventory loss at contract manufacturer 65 — —; Other 12 (57) 64; Accounts receivable, net (1,865) (1,339) (278); Inventories (1,458) (580) (1,401); Prepaid expenses and other assets 343 (383) (2,010); Receivables from and payable to related parties, net 108 (107) 366; Accounts payable (109) (419) 931; Accrued and other liabilities 883 (221) 546; Net cash provided by operating activities 3,041 1,667 3,565; Purchases of property and equipment (636) (546) (450); Purchases of short-term investments (1,493) (3,722) (2,667); Proceeds from maturity of short-term investments 1,416 2,687 4,310; Proceeds from sale of short-term investments 616 300 —; Cash received from acquisition of Xilinx — — 2,366; Acquisitions, net of cash acquired (548) (131) (1,544); Related party equity method investment (17) — —; Issuance of loan to related party (100) — —; Purchases of strategic investments (341) (11) (5); Other 2 — (11); Net cash provided by (used in) investing activities (1,101) (1,423) 1,999; Proceeds from debt, net of issuance costs — — 991; Repayment of debt (750) — (312); Proceeds from sales of common stock through employee equity plans 279 268 167; Repurchases of common stock (862) (985) (3,702); Stock repurchases for tax withholding on employee equity plans (728) (427) (406); Other (1) (2) (2); Net cash used in financing activities (2,062) (1,146) (3,264); Net increase (decrease) in cash, cash equivalents and restricted cash (122) (902) 2,300; Cash, cash equivalents and restricted cash at beginning of year 3,933 4,835 2,535; Cash, cash equivalents and restricted cash at end of year $ 3,811 $ 3,933 $ 4,835.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, restricted, equivalents, acquisition, related, activities, assets, purchases, financing, consolidated\n\nTITLE: (In millions)\nTEXT: Amortization of acquisition-related intangibles\nTEXT: Purchases of strategic investments\nTEXT: Net cash used in financing activities\nTEXT: Cash, cash equivalents and restricted cash at beginning of year\nTEXT: Cash, cash equivalents and restricted cash at end of year\nTEXT: Advanced Micro Devices, Inc.Consolidated Statements of Cash FlowsYear EndedDecember 28,2024December 30,2023December 31,2022 (In millions)Supplemental cash flow information:Cash paid during the year for:Interest$72 $84 $85 Income taxes, net of refund$1,386 $523 $685 Non-cash investing and financing activities:Purchases of property and equipment, accrued but not paid$144 $106 $157 Issuance of common stock and treasury stock for the acquisition of Xilinx$— $— $48,514 Fair value of replacement share-based awards related to acquisition of Xilinx$— $— $275 Non-cash activities for leases:Operating lease right-of-use assets acquired by assuming related liabilities$102 $273 $115 Reconciliation of cash, cash equivalents, and restricted cashCash and cash equivalents$3,787 $3,933 $4,835 Restricted cash included in Prepaid expenses and other current assets24 — — Total cash, cash equivalents, and restricted cash$3,811 $3,933 $4,835\nTABLE: TABLE: December 28,2024 December 30,2023 December 31,2022; Interest $ 72 $ 84 $ 85; Income taxes, net of refund $ 1,386 $ 523 $ 685; Purchases of property and equipment, accrued but not paid $ 144 $ 106 $ 157; Issuance of common stock and treasury stock for the acquisition of Xilinx $ — $ — $ 48,514; Fair value of replacement share-based awards related to acquisition of Xilinx $ — $ — $ 275; Operating lease right-of-use assets acquired by assuming related liabilities $ 102 $ 273 $ 115; Cash and cash equivalents $ 3,787 $ 3,933 $ 4,835; Restricted cash included in Prepaid expenses and other current assets 24 — —; Total cash, cash equivalents, and restricted cash $ 3,811 $ 3,933 $ 4,835.\nTITLE: Advanced Micro Devices, Inc.Consolidated Statements of Cash Flows\nTITLE: Advanced Micro Devices, Inc.\nTITLE: Consolidated Statements of Cash Flows\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\nTITLE: (In millions)\nTEXT: Restricted cash included in Prepaid expenses and other current assets\nTEXT: See accompanying notes to the Consolidated Financial Statements.\nTITLE: Advanced Micro Devices, Inc.\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, revenue, time, arrangements, recognized, customers, customer, services, which, products\n\nTITLE: Revenue Recognition\nTEXT: Revenue is recognized when a customer obtains control of promised goods or services and is recognized in an amount that reflects the consideration which the Company expects to receive in exchange for those goods or services. Sales, value-added, and other taxes collected concurrently with the provision of goods or services are excluded from revenue. Shipping and handling costs associated with product sales are included in cost of sales. Substantially all of the Company’s revenue is derived from product sales.\nTEXT: Customers are generally required to pay for products and services within the Company’s standard contractual terms, which are typically net 30 to 60 days. The Company has determined that it does not have significant financing components in its contracts with customers.\nTEXT: The Company transfers control and recognizes revenue when non-custom products are shipped to customers, which includes original equipment manufacturers (OEM) and distributors, in accordance with the shipping terms of the sale. Certain OEMs may be entitled to rights of return and rebates under OEM agreements. The Company also sells to distributors under terms allowing the majority of distributors certain rights of return and price protection on unsold merchandise held by them. The Company estimates the amount of variable consideration under OEM and distributor arrangements and, accordingly, records a provision for product returns, allowances for price protection and rebates based on actual historical experience and any known events.\nTEXT: The Company offers incentive programs to certain customers, including cooperative advertising, marketing promotions, volume-based incentives and special pricing arrangements. Where funds provided for such programs can be estimated, the Company recognizes a reduction to revenue at the time the related revenue is recognized; otherwise, the Company recognizes such reduction to revenue at the later of when: i) the related revenue transaction occurs; or ii) the program is offered. For transactions where the Company reimburses a customer for a portion of the customer’s cost to perform specific product advertising or marketing and promotional activities, such amounts are recognized as a reduction to revenue unless they qualify for expense recognition.\nTEXT: Constraints of variable consideration have not been material.\nTEXT: Custom products, which are primarily associated with the Company’s Gaming segment, are sold under non-cancellable purchases orders, for which the Company has an enforceable right to payment, and which have no alternative use to the Company at contract inception, are recognized as revenue, over the time of production of the products by the Company. The Company utilizes a cost-based input method, calculated as cost incurred plus estimated margin, to determine the amount of revenue to recognize for in-process or completed customer orders at a reporting date. The Company believes that a cost-based input method is the most appropriate manner to measure how the Company satisfies its performance obligations to customers because the effort and costs incurred best depict the Company’s satisfaction of its performance obligation.\nTEXT: Sales of custom products are not subject to a right of return and arrangements generally involve a single performance obligation. Generally, there are no variable consideration estimates associated with custom products.\nTEXT: Development and intellectual property licensing agreements\nTEXT: From time to time, the Company may enter into arrangements with customers that combine the provision of development services and a license to the right to use the Company’s IP. These arrangements are deemed to be single or multiple performance obligations based upon the nature of the arrangements. Revenue is recognized upon the transfer of control, over time or at a point in time, depending on the nature of the arrangements. The Company evaluates whether the licensing component is distinct. A licensing component is distinct if it is both (i) capable of being distinct and (ii) distinct in the context of the arrangement. If the license is not distinct, it is combined with the development services as a single performance obligation and recognized over time. If the license is distinct, revenue is recognized at a point in time when the customer has the ability to benefit from the license.\nTEXT: From time to time, the Company may enter into arrangements with customers that solely involve the sale or licensing of its patents or IP. Generally, there are no performance obligations beyond transferring the designated license to the Company’s patents or IP. Accordingly, revenue is recognized at a point in time when the customer has the ability to benefit from the license.\nTEXT: There are no variable consideration estimates associated with either combined development and IP arrangements or for standalone arrangements involving either the sale or licensing of IP.\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nvalue, company, assets, impairment, fair, estimates, than, carrying, future, reporting\n\nTITLE: Inventories\nTEXT: The Company values inventory at standard cost, adjusted to approximate the lower of actual cost or estimated net realizable value using assumptions about future demand and market conditions. In determining excess or obsolescence reserves for its products, the Company considers assumptions such as changes in business and economic conditions, other-than-temporary decreases in demand for its products, and changes in technology or customer requirements. In determining the lower of cost or net realizable value reserves, the Company considers assumptions such as recent historical sales activity and selling prices, as well as estimates of future selling prices. The Company fully reserves for inventories and non-cancellable purchase orders for inventory deemed obsolete. The Company performs periodic reviews of inventory items to identify excess inventories on hand by comparing on-hand balances and non-cancellable purchase orders to anticipated usage using recent historical activity as well as anticipated or forecasted demand. If estimates of customer demand diminish further or market conditions become less favorable than those projected by the Company, additional inventory carrying value adjustments may be required.\nTITLE: Business Combinations\nTEXT: The Company is required to use the acquisition method of accounting for business combinations. The acquisition method of accounting requires the Company to allocate the purchase consideration to the assets acquired and liabilities assumed from the acquiree based on their respective fair values as of the acquisition date. The excess of the fair value of purchase consideration over the fair value of these assets acquired and liabilities assumed is recorded as goodwill. When determining the fair values of assets acquired and liabilities assumed, management makes significant estimates and assumptions, especially with respect to intangible assets. Critical estimates in valuing intangible assets include, but are not limited to, expected future revenue growth rates and margins, future changes in technology, time to recreate customer relationships, useful lives, and discount rates. Fair value estimates are based on the assumptions that management believes a market participant would use in pricing the asset or liability. These estimates are inherently uncertain and, therefore, actual results may differ from the estimates made.\nTITLE: Goodwill\nTEXT: The Company performs its goodwill impairment analysis as of the first day of the fourth quarter of each year and, if certain events or circumstances indicate that an impairment loss may have been incurred, on a more frequent basis. The analysis may include both qualitative and quantitative factors to assess the likelihood of an impairment.\nTEXT: The Company has the option to first perform qualitative testing to determine if it is more likely than not that the fair value of a reporting unit exceeds its carrying amount. Qualitative factors include industry and market considerations, overall financial performance, share price trends and market capitalization and Company-specific events. If the Company concludes it is more likely than not that the fair value of a reporting unit exceeds its carrying amount, the Company does not proceed to perform a quantitative impairment test.\nTEXT: If the Company concludes it is more likely than not that the fair value of a reporting unit is less than its carrying value or elects to bypass the qualitative test, a quantitative goodwill impairment test will be performed by comparing the fair value of each reporting unit to its carrying value. If a reporting unit’s fair value is determined to be less than its carrying value, a goodwill impairment charge is recognized for the amount by which the reporting unit’s fair value is less than its carrying value, not to exceed the total amount of goodwill allocated to that reporting unit.\nTITLE: Long-Lived and Intangible Assets\nTEXT: Long-lived and intangible assets to be held and used are reviewed for impairment if indicators of potential impairment exist and at least annually for indefinite-lived intangible assets. Impairment indicators are reviewed on a quarterly basis. Assets are grouped and evaluated for impairment at the lowest level of identifiable cash flows.\nTEXT: When indicators of impairment exist and assets are held for use, the Company estimates future undiscounted cash flows attributable to the related asset groups. In the event such cash flows are not expected to be sufficient to recover the recorded value of the assets, the assets are written down to their estimated fair values based on the expected discounted future cash flows attributable to the asset group or based on appraisals. Factors affecting impairment of assets held for use include the ability of the specific assets to generate separately identifiable positive cash flows.\nTEXT: When assets are removed from operations and held for sale, the Company estimates impairment losses as the excess of the carrying value of the assets over their fair value. Market conditions are among the factors affecting impairment of assets held for sale. Changes in any of these factors could necessitate impairment recognition in future periods for assets held for use or assets held for sale.\nTITLE: Cash Equivalents\nTEXT: Cash equivalents consist of financial instruments that are readily convertible into cash and have original maturities of three months or less at the time of purchase.\nTITLE: Accounts Receivable\nTEXT: Accounts receivable are primarily comprised of trade receivables presented net of rebates, price protection and an allowance for credit loss. The Company manages its exposure to customer credit risk through credit limits, credit lines, ongoing monitoring procedures and credit approvals. While the Company maintains an allowance for customer credit losses, its accounts receivable write-offs have historically not been significant.\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, lease, assets, liabilities, value, fair, term, consolidated, securities, other\n\nTITLE: Unbilled Receivables\nTEXT: Unbilled receivables are recorded within Prepaid expenses and other current assets on the Company’s Consolidated Balance Sheets. Unbilled receivables primarily represent work completed on development services and on custom products under non-cancellable purchase orders that have no alternative use to the Company at contract inception, recognized as revenue but not yet invoiced to customers.\nTITLE: Investments\nTEXT: Available-for-Sale Debt Securities. Investments in marketable debt securities are available for use in current operations, including those with maturity dates beyond one year, and are classified within current assets on the Consolidated Balance Sheets. Available-for-sale debt securities are recorded at fair value, with the change in unrealized gains and losses, net of tax, reported as a separate component on the Consolidated Statements of Comprehensive Income until realized. Fair value is determined based on quoted market rates when observable or utilizing data points that are observable. Securities with an amortized cost basis in excess of estimated fair value are assessed to determine what amount of the excess, if any, is caused by expected credit losses. Expected credit losses on securities are recognized in other income (expense) on the Consolidated Statements of Operations, and any remaining unrealized losses, net of tax, are included in Accumulated other comprehensive income (loss), in Consolidated Statements of Stockholders’ Equity. The Company uses the first-in, first-out method as basis of the cost of securities sold.\nTEXT: Strategic Non-marketable Equity Securities. The Company’s investments in non-marketable securities of privately-held companies are held for long-term strategic purposes and are accounted for under the measurement alternative, defined as cost, less impairments, adjusted for subsequent observable price changes and are periodically assessed for impairment when events or circumstances indicate that a decline in value may have occurred. The Company's periodic assessment of impairment is made by considering available evidence, including the investee’s general market and industry conditions and product development status. The Company also assesses the investee’s ability to meet business milestones, its financial condition, and near-term prospects, including the rate at which the investee is using its cash, the investee’s need for possible additional funding at a lower valuation and any bona fide offer to purchase the investee.\nTITLE: Fair Value Measurements\nTEXT: The Company’s financial instruments are measured and recorded at fair value on a recurring basis, except for non-marketable equity investments in privately-held companies, which are generally accounted for under the measurement alternative.\nTEXT: The fair value framework requires the categorization of assets and liabilities into three levels based upon the assumptions (inputs) used to price the assets or liabilities. The guidance for fair value measurements requires that assets and liabilities carried at fair value be classified and disclosed in one of the following categories:\nTEXT: Level 1 — Quoted (unadjusted) prices in active markets for identical assets or liabilities.\nTEXT: Level 2 — Observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the asset or liability.\nTEXT: Level 3 — Unobservable inputs to the valuation methodology that are supported by little or no market activity and that are significant to the measurement of the fair value of the assets or liabilities. Level 3 assets and liabilities include those whose fair value measurements are determined using pricing models, discounted cash flow methodologies or similar valuation techniques, as well as significant management judgment or estimation.\nTITLE: Property and Equipment\nTEXT: Property and equipment are stated at cost. Depreciation and amortization are provided on a straight-line basis over the estimated useful lives of two to 15 years for equipment, 34 to 44 years for buildings, and leasehold improvements are measured by the shorter of the remaining terms of the leases or the estimated useful economic lives of the improvements.\nTITLE: Leases\nTEXT: Operating and finance leases are recorded as right-of-use (ROU) assets and lease liabilities on the Company’s Consolidated Balance Sheets. ROU assets represent the Company’s right to use an underlying asset for the lease term and lease liabilities represent the Company’s obligation to make lease payments arising from the lease. Operating and finance lease ROU assets and liabilities are initially recognized based on the present value of lease payments over the lease term. In determining the present value of lease payments, the Company uses the implicit interest rate if readily determinable. When the implicit interest rate is not readily determinable, the Company uses its incremental borrowing rate, which is based on its collateralized borrowing capabilities over a similar term of the lease payments. When using the incremental borrowing rate, the Company utilizes the consolidated group incremental borrowing rate. Lease expense for operating lease payments is recognized on a straight-line basis over the lease term. The Company has elected the accounting policy to not recognize ROU assets and lease liabilities that arise from short-term (12 months or less) leases for any class of underlying asset. Operating leases are included in operating lease ROU assets, other current liabilities, and long-term operating lease liabilities on the Company’s Consolidated Balance Sheets. The Company’s finance leases are immaterial.\n"
    },
    {
      "cluster": 9,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, assets, advertising, income, liabilities, rates, fair, value, stock, which\n\nTITLE: Foreign Currency Translation/Transactions\nTEXT: The functional currency of the Company’s foreign subsidiaries is the U.S. dollar. Assets and liabilities denominated in non-U.S. dollars have been remeasured into U.S. dollars at current exchange rates for monetary assets and liabilities and historical exchange rates for non-monetary assets and liabilities. Non-U.S. dollar denominated transactions have been remeasured at average exchange rates in effect during each period, except for those cost of sales and expense transactions related to non-monetary balance sheet amounts which have been remeasured at historical exchange rates. The gains or losses from foreign currency remeasurement are included in earnings.\nTITLE: Marketing and Advertising Expenses\nTEXT: Advertising costs are expensed as incurred. In addition, the Company’s marketing and advertising expenses include certain cooperative advertising funding obligations under customer incentive programs, which costs are recorded upon agreement with customers and vendor partners. Cooperative advertising expenses are recorded as marketing, general and administrative expense to the extent the cash paid does not exceed the estimated fair value of the advertising benefit received. Any excess of cash paid over the estimated fair value of the advertising benefit received is recorded as a reduction of revenue. Total marketing and advertising expenses for 2024, 2023 and 2022 were approximately $1.2 billion, $695 million and $683 million, respectively.\nTITLE: Stock-Based Compensation\nTEXT: The Company estimates stock-based compensation cost for stock options at the grant date based on the option’s fair value as calculated by the Black-Scholes model. For time-based restricted stock units (RSUs), fair value is based on the closing price of the Company’s common stock on the grant date. The Company estimates the grant-date fair value of RSUs that involve a market condition using the Monte Carlo simulation model. The Company estimates the grant-date fair value of stock to be issued under the Company’s Employee Stock Purchase plan (ESPP) using the Black-Scholes model. Compensation expense is recognized over the vesting period of the applicable award using the straight-line method, except for the compensation expense related to RSUs with performance or market conditions (PRSUs), which are recognized ratably for each vesting tranche from the service inception date to the end of the requisite service period. Forfeiture rates are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates.\nTITLE: Contingencies\nTEXT: From time to time the Company is a defendant or plaintiff in various legal actions that arise in the normal course of business. The Company is also subject to income tax, indirect tax or other tax claims by tax agencies in jurisdictions in which it conducts business. In addition, the Company is a party to environmental matters including local, regional, state and federal government clean-up activities at or near locations where the Company currently or has in the past conducted business. The Company is required to assess the likelihood of any adverse judgments or outcomes to these matters as well as potential ranges of reasonably possible losses. A determination of the amount of reserves required for these commitments and contingencies that would be charged to earnings, if any, includes assessing the probability of adverse outcomes and estimating the amount of potential losses. The required reserves, if any, may change due to new developments in each matter or changes in circumstances such as a change in settlement strategy.\nTITLE: Income Taxes\nTEXT: The Company computes the provision for income taxes using the liability method and recognizes deferred tax assets and liabilities for temporary differences between financial statement and income tax bases of assets and liabilities, as well as for operating loss and tax credit carryforwards. The Company measures deferred tax assets and liabilities using tax rates applicable to taxable income in effect for the years in which those tax assets are expected to be realized or settled and provides a valuation allowance against deferred tax assets when it cannot conclude that it is more likely than not that some or all deferred tax assets will be realized. The assessment requires significant judgment and is performed in each of the applicable taxing jurisdictions. In addition, the Company recognizes tax benefits from uncertain tax positions only if it is more likely than not that they will be sustained, based on the technical merits of the positions, on examination by the jurisdictional tax authority. Interest and penalties related to income taxes are recorded within the Income tax provision (benefit) line in the Company’s Consolidated Statements of Operations. The Company is subject to the Global Intangible Low Taxed Income (GILTI) tax in the U.S. and recognizes deferred taxes for temporary basis differences that are expected to reverse as GILTI tax in future years.\nTITLE: Recently Issued Accounting Standard Updates Adopted\nTEXT: In November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standard Update (ASU) 2023-07 Segment Reporting (Topic 280) Improvements to Reportable Segment Disclosures to enhance disclosures about significant segment expenses. This ASU is effective for the Company’s fiscal year 2024 and interim periods in fiscal year 2025. The Company adopted this standard in the fourth quarter of 2024. See Note 4 - Segment Reporting for further information.\n"
    },
    {
      "cluster": 10,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, december, other, revenue, disclosures, company, accrued, fiscal, expenses, current\n\nTITLE: Recently Issued Accounting Standard Updates Not Yet Adopted\nTEXT: In December 2023, the FASB issued ASU 2023-09 Income Taxes (Topic 740) Improvements to Income Tax Disclosures that requires disclosure of disaggregated income taxes paid, prescribes standard categories for the components of the effective tax rate reconciliation, and modifies other income tax-related disclosures. This ASU is effective for the Company’s fiscal year 2025. Early adoption is permitted. The Company is currently evaluating income tax disclosures related to its annual report for fiscal year 2025.\nTEXT: In November 2024, the FASB issued ASU 2024-03 Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses. The new guidance is intended to provide investors enhanced disclosures and requires public companies to disaggregate key expense types. The update is effective for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027, with early adoption permitted. The disclosure updates are required to be applied prospectively with the option for retrospective application. The Company is currently evaluating the impact of this new standard on its Consolidated Financial Statements.\nTEXT: Although there are several other new accounting pronouncements issued by the FASB, the Company does not believe any of these accounting pronouncements had or will have a material impact on its Consolidated Financial Statements.\nTITLE: InventoriesDecember 28,2024December 30,2023\nTITLE: Inventories\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTEXT: Prepaid Expenses and Other Current AssetsDecember 28,2024December 30,2023(In millions)Unbilled receivables$628 $1,053 Other1,250 1,259 Total prepaid expenses and other current assets$1,878 $2,312\nTABLE: TABLE: Prepaid Expenses and Other Current Assets December 28,2024 December 30,2023; Unbilled receivables $ 628 $ 1,053; Other 1,250 1,259; Total prepaid expenses and other current assets $ 1,878 $ 2,312.\nTITLE: Prepaid Expenses and Other Current AssetsDecember 28,2024December 30,2023\nTITLE: Prepaid Expenses and Other Current Assets\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTEXT: Total prepaid expenses and other current assets\nTEXT: Property and Equipment, netDecember 28,2024December 30,2023 (In millions)Land, building and leasehold improvements$853 $821 Equipment2,798 2,346 Construction in progress324 209 Property and equipment, gross3,975 3,376 Accumulated depreciation(2,173)(1,787)Total property and equipment, net$1,802 $1,589\nTABLE: TABLE: Property and Equipment, net December 28,2024 December 30,2023; Land, building and leasehold improvements $ 853 $ 821; Equipment 2,798 2,346; Construction in progress 324 209; Property and equipment, gross 3,975 3,376; Accumulated depreciation (2,173) (1,787); Total property and equipment, net $ 1,802 $ 1,589.\nTITLE: Property and Equipment, netDecember 28,2024December 30,2023\nTITLE: Property and Equipment, net\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTEXT: Land, building and leasehold improvements\nTEXT: Depreciation expense for 2024, 2023 and 2022 was $454 million, $441 million and $439 million, respectively.\nTEXT: Accrued LiabilitiesDecember 28,2024December 30,2023 (In millions)Accrued marketing programs$1,063 $827 Accrued compensation and benefits1,174 884 Customer-related liabilities1,349 788 Other accrued and current liabilities674 583 Total accrued liabilities$4,260 $3,082\nTABLE: TABLE: Accrued Liabilities December 28,2024 December 30,2023; Accrued marketing programs $ 1,063 $ 827; Accrued compensation and benefits 1,174 884; Customer-related liabilities 1,349 788; Other accrued and current liabilities 674 583; Total accrued liabilities $ 4,260 $ 3,082.\nTITLE: Accrued LiabilitiesDecember 28,2024December 30,2023\nTITLE: Accrued Liabilities\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTITLE: Revenue\nTEXT: Revenue allocated to remaining performance obligations that are unsatisfied (or partially unsatisfied) include amounts received from customers and amounts that will be invoiced and recognized as revenue in future periods for development services, IP licensing and product revenue. As of December 28, 2024, the aggregate transaction price allocated to remaining performance obligations under contracts with an original expected duration of more than one year was $85 million, of which $67 million is expected to be recognized in the next 12 months. The revenue allocated to remaining performance obligations does not include amounts which have an original expected duration of one year or less.\nTEXT: Revenue recognized over time associated with custom products and development services accounted for approximately 8%, 25% and 24% of the Company’s revenue in 2024, 2023 and 2022, respectively.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\n"
    },
    {
      "cluster": 11,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, operating, acquisition, sales, other, december, cash, expenses, total, following\n\nTITLE: (In millions)\nTEXT: Cost of sales and operating expenses:\nTEXT: Total cost of sales and operating expenses\nTEXT: Segment cost of sales and operating expenses primarily include material, external manufacturing, labor and marketing and advertising costs, and exclude expenses and credits that are recorded within the All Other category.\nTEXT: The following table provides items included in All Other category:\nTEXT: Year EndedDecember 28,2024December 30,2023December 31,2022 (In millions)Operating loss: Amortization of acquisition-related intangibles$2,394 $2,811 $3,548 Stock-based compensation expense1,407 1,384 1,081 Acquisition-related and other costs186 258 452 Restructuring charges186 — — Inventory loss at contract manufacturer65 — — Licensing gain(48)(34)(102)Total operating loss$4,190 $4,419 $4,979\nTABLE: TABLE: December 28,2024 December 30,2023 December 31,2022; Amortization of acquisition-related intangibles $ 2,394 $ 2,811 $ 3,548; Stock-based compensation expense 1,407 1,384 1,081; Acquisition-related and other costs 186 258 452; Restructuring charges 186 — —; Inventory loss at contract manufacturer 65 — —; Licensing gain (48) (34) (102); Total operating loss $ 4,190 $ 4,419 $ 4,979.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\nTITLE: (In millions)\nTEXT: The Company does not discretely allocate assets to its operating segments, nor does management evaluate operating segments using discrete asset information.\nTEXT: The following table summarizes sales to external customers by geographic regions based on billing location of the customer:\nTEXT: Year EndedDecember 28,2024December 30,2023December 31,2022 (In millions)United States8,693 7,837 8,049 China (including Hong Kong)6,231 3,417 5,207 Singapore3,614 2,231 1,380 Taiwan3,301 1,841 2,369 Japan1,767 4,629 4,177 Europe1,625 2,030 1,773 Other regions554 695 646 Total sales to external customers$25,785 $22,680 $23,601\nTABLE: TABLE: December 28,2024 December 30,2023 December 31,2022; United States 8,693 7,837 8,049; China (including Hong Kong) 6,231 3,417 5,207; Singapore 3,614 2,231 1,380; Taiwan 3,301 1,841 2,369; Japan 1,767 4,629 4,177; Europe 1,625 2,030 1,773; Other regions 554 695 646; Total sales to external customers $ 25,785 $ 22,680 $ 23,601.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\nTITLE: (In millions)\nTEXT: The following table summarizes sales to a major customer that accounted for at least 10% of the Company’s consolidated net revenue for the respective years:\nTITLE: Year EndedSegmentDecember 28,2024December 30,2023December 31,2022Customer AGaming*18 %16 %\nTABLE: TABLE: Segment December 28,2024 December 30,2023 December 31,2022; Customer A Gaming * 18 % 16 %.\nTITLE: Year EndedSegmentDecember 28,2024December 30,2023December 31,2022Customer AGaming*18 %16 %\nTITLE: Year Ended\nTITLE: SegmentDecember 28,2024December 30,2023December 31,2022\nTITLE: Segment\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\nTEXT: The following table summarizes Property and equipment, net by geographic areas:\nTEXT: December 28,2024December 30,2023 (In millions)United States$1,312 $1,143 Singapore140144Canada10484India10086Ireland4646China (including Hong Kong)3842Other countries 6244Total property and equipment, net$1,802 $1,589\nTABLE: TABLE: December 28,2024 December 30,2023; United States $ 1,312 $ 1,143; Singapore 140 144; Canada 104 84; India 100 86; Ireland 46 46; China (including Hong Kong) 38 42; Other countries 62 44; Total property and equipment, net $ 1,802 $ 1,589.\nTITLE: December 28,2024December 30,2023\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTITLE: Fiscal Year 2024 Acquisitions\nTITLE: Silo AI Acquisition\nTEXT: On August 9, 2024, the Company completed the acquisition of Silo AI Oy (Silo AI), an AI lab based in Finland in an all-cash transaction of $665 million. Net of closing adjustments, transaction costs and deferred cash compensation, the purchase consideration of $553 million was allocated to $19 million of identifiable intangible assets, $43 million of net liabilities assumed, and $577 million to goodwill. Goodwill was attributed to Silo AI’s workforce who will help the Company accelerate the deployment and development of AI models and software solutions on AMD hardware. Silo AI financial results, which were not material, were included in the Company's Statement of Operations from the date of acquisition primarily within the Data Center segment.\nTITLE: Pending Acquisition of ZT Systems\nTEXT: On August 17, 2024, the Company entered into an agreement (the Agreement) to acquire ZT Group Int’l, Inc. (ZT Systems), a provider of AI and general purpose compute infrastructure for hyperscale computing companies, in a cash and stock transaction valued at approximately $4.9 billion (the Acquisition). The aggregate closing consideration payable by the Company consists of 8,335,852 shares of the Company’s common stock and $3.4 billion in cash. Contingent consideration of up to 740,964 shares of the Company’s common stock and up to $300 million of cash is payable by the Company to the extent certain conditions are met. The Agreement provides that if the Acquisition is not completed by August 17, 2025, subject to two automatic extensions until February 17, 2026, the Company will pay a termination fee of $300 million. The Acquisition is expected to close in the first half of 2025, subject to certain regulatory approvals and other customary closing conditions. The Company intends to seek a strategic partner to acquire ZT Systems' manufacturing business.\n"
    },
    {
      "cluster": 12,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nacquisition, related, costs, company, assets, xilinx, consolidated, consideration, statements, operations\n\nTITLE: Fiscal Year 2023 Acquisitions\nTEXT: During the year ended December 30, 2023, the Company completed business acquisitions for a total consideration of $134 million that resulted in the recognition of $49 million of identifiable net assets and $85 million of goodwill. The financial results of these acquired businesses, which were not material, were included in the Company's Consolidated Statements of Operations from their respective dates of acquisition under the Data Center, Client and Embedded segments.\nTITLE: Fiscal Year 2022 Acquisitions\nTITLE: Pensando Acquisition\nTEXT: On May 26, 2022, the Company completed the acquisition of all issued and outstanding shares of Pensando, a leader in next-generation distributed computing, for a transaction valued at approximately $1.9 billion. The recorded purchase consideration of $1.7 billion is net of deferred cash compensation requiring future services and other customary closing adjustments. The purchase consideration was allocated to $349 million of intangible assets, $208 million of identifiable net assets, and $1.1 billion of goodwill.\nTEXT: From the acquisition date to December 30, 2022, the Consolidated Statements of Operations include immaterial revenue and operating results attributable to Pensando, which are reported under the Data Center segment.\nTEXT: In 2023 and 2022, Pensando acquisition-related costs of $190 million and $102 million were recorded under Cost of sales, Research and development, and Marketing, general and administrative expenses on the Company’s Consolidated Statements of Operations. Pensando acquisition-related costs were immaterial in 2024. Acquisition-related costs are primarily comprised of direct transaction costs, fair value adjustments for acquired inventory and certain compensation charges.\nTITLE: Xilinx Acquisition\nTEXT: On February 14, 2022 (Xilinx Acquisition Date), the Company completed the acquisition of all issued and outstanding shares of Xilinx, a leading provider of adaptive computing solutions, for a total purchase consideration of $48.8 billion ($46.4 billion, net of cash acquired of $2.4 billion). The purchase consideration was allocated to $27.3 billion of intangible assets, $1.3 billion of identifiable net liabilities, and $22.8 billion of goodwill.\nTEXT: The Consolidated Statements of Operations include the following revenue and operating income attributable to Xilinx in 2022:\nTITLE: 2022(In millions)Net revenue$4,612 Operating income$2,247\nTABLE: TABLE: Net revenue $ 4,612; Operating income $ 2,247.\nTITLE: 2022(In millions)Net revenue$4,612 Operating income$2,247\nTITLE: 2022\nTITLE: (In millions)\nTEXT: In 2022, operating income attributable to Xilinx recorded under the Embedded and Data Center segments does not include $4.2 billion of amortization of acquisition-related intangibles, employee stock-based compensation expense and acquisition-related costs, which are recorded under the “All Other” segment.\nTEXT: In 2023 and 2022, Xilinx acquisition-related costs of $26 million and $350 million were recorded under Cost of sales, Research and development, and Marketing, general and administrative expenses on the Company’s Consolidated Statements of Operations. Xilinx acquisition-related costs in 2024 were immaterial. Acquisition-related costs are primarily comprised of direct transaction costs, fair value adjustments for acquired inventory and certain compensation charges.\nTITLE: Supplemental Unaudited Pro Forma Information\nTEXT: Following are the supplemental consolidated financial results of the Company, Xilinx and Pensando on an unaudited pro forma basis, as if the acquisitions had been consummated as of the beginning of the fiscal year 2022.\nTITLE: December 31,2022(in millions)Net revenue$24,117 Net income $2,311\nTABLE: TABLE: Net revenue $ 24,117; Net income $ 2,311.\nTITLE: December 31,2022(in millions)Net revenue$24,117 Net income $2,311\nTITLE: December 31,2022\nTITLE: (in millions)\nTITLE: Acquisition-related Intangible Assets\nTEXT: The following table summarizes Acquisition-related Intangible Assets:\nTEXT: December 28, 2024December 30, 2023Gross Carrying AmountAccumulated AmortizationNet Carrying AmountGross Carrying AmountAccumulated AmortizationNet Carrying Amount(In millions)(In millions)Developed technology$13,408 $(2,529)$10,879 $13,390 $(1,583)$11,807 Customer relationships12,324 (5,124)7,200 12,324 (3,755)8,569 Customer backlog809 (809)— 809 (809)— Corporate trade name65 (65)— 65 (65)— Product trademarks914 (225)689 914 (147)767 Intangible assets subject to amortization27,520 (8,752)18,768 27,502 (6,359)21,143 In-process Research and Development (IPR&D) not subject to amortization162 — 162 220 — 220 Total acquisition-related intangible assets$27,682 $(8,752)$18,930 $27,722 $(6,359)$21,363\nTABLE: TABLE: December 28, 2024 December 30, 2023; Gross Carrying Amount Accumulated Amortization Net Carrying Amount Gross Carrying Amount Accumulated Amortization Net Carrying Amount; (In millions) (In millions); Developed technology $ 13,408 $ (2,529) $ 10,879 $ 13,390 $ (1,583) $ 11,807; Customer relationships 12,324 (5,124) 7,200 12,324 (3,755) 8,569; Customer backlog 809 (809) — 809 (809) —; Corporate trade name 65 (65) — 65 (65) —; Product trademarks 914 (225) 689 914 (147) 767; Intangible assets subject to amortization 27,520 (8,752) 18,768 27,502 (6,359) 21,143; In-process Research and Development (IPR&D) not subject to amortization 162 — 162 220 — 220; Total acquisition-related intangible assets $ 27,682 $ (8,752) $ 18,930 $ 27,722 $ (6,359) $ 21,363.\nTITLE: December 28, 2024December 30, 2023\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: Gross Carrying AmountAccumulated AmortizationNet Carrying AmountGross Carrying AmountAccumulated AmortizationNet Carrying Amount\nTITLE: Gross Carrying Amount\nTITLE: Accumulated Amortization\nTITLE: Net Carrying Amount\nTITLE: Gross Carrying Amount\nTITLE: Accumulated Amortization\nTITLE: Net Carrying Amount\nTITLE: (In millions)(In millions)\n"
    },
    {
      "cluster": 13,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, atmp, december, related, consolidated, equity, respectively, recorded, during, balance\n\nTITLE: (In millions)\nTEXT: Intangible assets subject to amortization\nTEXT: Acquisition-related intangible amortization expense was $2.4 billion and $2.8 billion in fiscal year 2024 and 2023, respectively. During the fourth quarter of fiscal year 2024, the Company determined that the fair value of certain IPR&D recorded within the Data Center segment was not recoverable resulting from actions related to the 2024 Restructuring Plan, and recorded an impairment charge of $58 million within Restructuring charges in the Company’s Consolidated Statement of Operations.\nTEXT: Based on the carrying value of acquisition-related intangibles recorded as of December 28, 2024, and assuming no subsequent impairment of the underlying assets, the estimated annual amortization expense for acquisition-related intangibles is expected to be as follows:\nTITLE: Fiscal Year(In millions)2025$2,225 20262,111 20271,993 20281,885 20291,659 2030 and thereafter8,895 Total$18,768\nTABLE: TABLE: Fiscal Year (In millions); 2025 $ 2,225; 2026 2,111; 2027 1,993; 2028 1,885; 2029 1,659; 2030 and thereafter 8,895; Total $ 18,768.\nTITLE: Fiscal Year(In millions)2025$2,225 20262,111 20271,993 20281,885 20291,659 2030 and thereafter8,895 Total$18,768\nTITLE: Fiscal Year(In millions)\nTITLE: (In millions)\nTITLE: Goodwill\nTEXT: The following table summarizes changes in the carrying amount of Goodwill:\nTEXT: December 31, 2022AcquisitionsDecember 30, 2023AcquisitionsDecember 28,2024(In millions)(In millions)Data Center$2,884 $58 $2,942 $461 $3,403 Client— 18 18 108 126 Gaming238 — 238 — 238 Embedded21,055 9 21,064 8 21,072 Total$24,177 $85 $24,262 $577 $24,839\nTABLE: TABLE: December 31, 2022 Acquisitions December 30, 2023 Acquisitions December 28,2024; (In millions) (In millions); Data Center $ 2,884 $ 58 $ 2,942 $ 461 $ 3,403; Client — 18 18 108 126; Gaming 238 — 238 — 238; Embedded 21,055 9 21,064 8 21,072; Total $ 24,177 $ 85 $ 24,262 $ 577 $ 24,839.\nTITLE: December 31, 2022AcquisitionsDecember 30, 2023AcquisitionsDecember 28,2024\nTITLE: December 31, 2022\nTITLE: Acquisitions\nTITLE: December 30, 2023\nTITLE: Acquisitions\nTITLE: December 28,2024\nTITLE: (In millions)(In millions)\nTITLE: (In millions)\nTEXT: During the fourth quarter of fiscal years 2024 and 2023, the Company conducted its annual qualitative impairment tests of goodwill and concluded that there was no goodwill impairment with respect to its reporting units.\nTITLE: ATMP Joint Ventures\nTEXT: The Company holds a 15% equity interest in two joint ventures (collectively, the ATMP JV) with affiliates of Tongfu Microelectronics Co., Ltd, a Chinese joint stock company. The Company has no obligation to fund the ATMP JV. The Company accounts for its equity interests in the ATMP JV under the equity method of accounting due to its significant influence over the ATMP JV.\nTEXT: The ATMP JV provides assembly, test, mark and packaging (ATMP) services to the Company. The Company assists the ATMP JV in its management of certain raw material inventory. The purchases from and resales to the ATMP JV of inventory under the Company’s inventory management program are reported within purchases and resales with the ATMP JV and do not impact the Company’s Consolidated Statement of Operations.\nTEXT: The Company’s purchases from the ATMP JV during each of the years 2024 and 2023 amounted to $1.7 billion . As of December 28, 2024 and December 30, 2023, the amounts payable to the ATMP JV were $476 million and $363 million, respectively, and are included in Payables to related parties on the Company’s Consolidated Balance Sheets. The Company’s resales to the ATMP JV during 2024 and 2023 amounted to $121 million and $14 million, respectively. As of December 28, 2024 and December 30, 2023, the Company had receivables from ATMP JV of $12 million and $9 million, respectively, included in Receivables from related parties on the Company’s Consolidated Balance Sheets. On October 9, 2024, the Company entered into a one-year term loan agreement with one of the ATMP JVs for $100 million to provide funds for the ATMP JV’s general corporate purposes. The loan bears interest, payable quarterly, at the three months term Secured Overnight Financing Rate (SOFR) plus 50 basis points. The loan is secured by the ATMP JV’s receivable balance due from the Company. The loan may be extended for further terms of up to twelve months. The loan is recorded within Receivables from related parties on the Company’s Consolidated Balance Sheets.\nTEXT: During 2024, 2023 and 2022, the Company recorded gains of $33 million, $16 million and $14 million in Equity income in investee on its Consolidated Statement of Operations, respectively. On August 8, 2024, the Company contributed $17 million to the ATMP JV, representing additional equity that is in proportion to the Company’s existing 15% equity interest. As of December 28, 2024 and December 30, 2023, the carrying value of the Company’s investment in the ATMP JV was approximately $149 million and $99 million, respectively, recorded as Investments: equity method on the Company’s Consolidated Balance Sheets.\n"
    },
    {
      "cluster": 14,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nnotes, company, december, senior, debt, principal, thatic, june, amount, xilinx\n\nTITLE: THATIC Joint Ventures\nTEXT: The Company holds equity interests in two joint ventures (collectively, the THATIC JV) with Higon Information Technology Co., Ltd. (THATIC), a third-party Chinese entity. As of December 28, 2024 and December 30, 2023, the carrying value of the investment was zero.\nTEXT: In February 2016, the Company licensed certain of its intellectual property (Licensed IP) to the THATIC JV, payable over several years upon achievement of certain milestones. The Company also receives a royalty based on the sales of the THATIC JV’s products developed on the basis of such Licensed IP. The Company classifies Licensed IP and royalty income associated with the February 2016 agreement as Licensing gain within operating income. During 2024 and 2023, the Company recognized $48 million and $34 million of licensing gain from royalty income under the agreement, respectively. As of December 28, 2024 and December 30, 2023, the Company had no receivables from the THATIC JV.\nTEXT: In June 2019, the Bureau of Industry and Security of the United States Department of Commerce added certain Chinese entities to the Entity List, including THATIC and the THATIC JV. The Company is complying with U.S. law pertaining to the Entity List designation.\nTITLE: Debt\nTEXT: The Company’s total debt as of December 28, 2024 and December 30, 2023 consisted of:\nTEXT: December 28,2024December 30,2023(In millions)2.950% Senior Notes Due 2024 (2.950% Notes)$— $750 2.375% Senior Notes Due 2030 (2.375% Notes)750 750 3.924% Senior Notes Due 2032 (3.924% Notes)500 500 4.393% Senior Notes Due 2052 (4.393% Notes)500 500 Total debt (principal amount)1,750 2,500 Unamortized debt discount and issuance costs(29)(32)Total debt (net)1,721 2,468 Less: current portion of long-term debt and related unamortized debt premium and issuance costs— (751)Total long-term debt$1,721 $1,717\nTABLE: TABLE: December 28,2024 December 30,2023; 2.950% Senior Notes Due 2024 (2.950% Notes) $ — $ 750; 2.375% Senior Notes Due 2030 (2.375% Notes) 750 750; 3.924% Senior Notes Due 2032 (3.924% Notes) 500 500; 4.393% Senior Notes Due 2052 (4.393% Notes) 500 500; Total debt (principal amount) 1,750 2,500; Unamortized debt discount and issuance costs (29) (32); Total debt (net) 1,721 2,468; Less: current portion of long-term debt and related unamortized debt premium and issuance costs — (751); Total long-term debt $ 1,721 $ 1,717.\nTITLE: December 28,2024December 30,2023\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTEXT: 2.950% Senior Notes Due 2024 (2.950% Notes)\nTEXT: 2.375% Senior Notes Due 2030 (2.375% Notes)\nTEXT: 3.924% Senior Notes Due 2032 (3.924% Notes)\nTEXT: 4.393% Senior Notes Due 2052 (4.393% Notes)\nTEXT: Assumed Xilinx Notes due 2024 and 2030\nTEXT: In connection with the acquisition of Xilinx, the Company assumed $1.5 billion in aggregate principal of Xilinx’s 2.950% Notes due 2024 and 2.375% Notes due 2030 (together, the Assumed Xilinx Notes) which were recorded at fair value as of the Xilinx Acquisition Date. The Assumed Xilinx Notes are general unsecured senior obligations of the Company with semi-annual fixed interest payments due on June 1 and December 1. The 2.95% Notes with a principal amount of $750 million were repaid in June 2024.\nTEXT: 3.924% Senior Notes Due 2032 and 4.393% Senior Notes Due 2052\nTEXT: On June 9, 2022, the Company issued $1.0 billion in aggregate principal amount of 3.924% Notes and 4.393% Notes. The 3.924% Notes and 4.393% Notes are general unsecured senior obligations of the Company. The interest is payable semi-annually on June 1 and December 1 of each year, commencing on December 1, 2022. The 3.924% and 4.393% Notes are governed by the terms of an indenture dated June 9, 2022 between the Company and US Bank Trust Company, National Association as trustee.\nTEXT: The Company may redeem some or all of the 3.924% Notes and 4.393% Notes prior to March 1, 2032 and December 1, 2051, respectively, at a price equal to the greater of the present value of the principal amount and future interest through the maturity of the 3.924% Notes or 4.393% Notes or 100% of the principal amount plus accrued and unpaid interest. Holders have the right to require the Company to repurchase all or a portion of the 3.924% Notes or 4.393% Notes in the event that the Company undergoes a change of control as defined in the indenture, at a repurchase price of 101% of the principal amount plus accrued and unpaid interest. Additionally, an event of default may result in the acceleration of the maturity of the 3.924% Notes and 4.393% Notes.\nTITLE: Future Payments on Total Debt\nTEXT: As of December 28, 2024, the Company’s future debt payment obligations were as follows:Term Debt(Principal only)Year(In millions)2025 - 2029— 2030 and thereafter1,750 Total$1,750\nTABLE: TABLE: Year (In millions); 2025 - 2029 —; 2030 and thereafter 1,750; Total $ 1,750.\nTITLE: Term Debt(Principal only)Year(In millions)2025 - 2029— 2030 and thereafter1,750 Total$1,750\nTITLE: Term Debt(Principal only)\nTITLE: Year(In millions)\nTITLE: (In millions)\n"
    },
    {
      "cluster": 15,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, december, revolving, credit, agreement, rate, will, commercial, paper, unrealized\n\nTITLE: Revolving Credit Facility\nTEXT: The Company has $3 billion available under a revolving credit agreement, as amended, that expires on April 29, 2027 (Revolving Credit Agreement). As of December 28, 2024 and December 30, 2023, the Company had no outstanding borrowings under the Revolving Credit Agreement. Revolving loans under the Revolving Credit Agreement can be either Secure Overnight Financing Rate (SOFR) Loans or Base Rate Loans (each as defined in the Revolving Credit Agreement) at the Company's option. Each SOFR Loan will bear interest at a rate per annum equal to the applicable SOFR plus a margin between 0.575% and 1.20%. Each Base Rate Loan will bear interest equal to the Base Rate plus a margin between 0.000% and 0.20%. The Revolving Credit Agreement also contains a sustainability-linked pricing component which provides for interest rate and facility fee reductions or increases based on the Company meeting or missing targets related to environmental sustainability, specifically greenhouse gas emissions. The Revolving Credit Agreement contains customary representations and warranties, affirmative and negative covenants, and events of default applicable to the Company and its subsidiaries. As of December 28, 2024, the Company was in compliance with these covenants.\nTITLE: Commercial Paper\nTEXT: On November 3, 2022, the Company established a commercial paper program, under which the Company may issue unsecured commercial paper notes up to a maximum principal amount outstanding at any time of $3 billion with a maturity of up to 397 days from the date of issue. The commercial paper will be sold at a discount from par or, alternatively, will be sold at par and bear interest at rates that will vary based on market conditions at the time of issuance. During 2024 and 2023, the Company did not issue any commercial paper under the program and as of December 28, 2024 and December 30, 2023, the Company had no commercial paper outstanding.\nTITLE: December 28, 2024December 30, 2023\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: (In millions)Level 1Level 2Level 3TotalLevel 1Level 2Total\nTITLE: (In millions)\nTITLE: Level 1\nTITLE: Level 2\nTITLE: Level 3\nTITLE: Total\nTITLE: Level 1\nTITLE: Level 2\nTITLE: Total\nTEXT: Deferred compensation plan investments are primarily mutual fund investments held in a Rabbi trust established to maintain the Company’s executive deferred compensation plan.\nTEXT: The following is a summary of cash equivalents and short-term investments: December 28, 2024December 30, 2023Cost/ Amortized CostGross Unrealized GainsGross Unrealized LossesEstimated Fair ValueCost/ Amortized CostGross Unrealized GainsGross Unrealized LossesEstimated Fair Value(in millions)(in millions)Asset-backed and mortgage-backed securities$30 $— $(2)$28 $35 $— $(2)$33 Corporate debt securities1,621 — (1)1,620 1,259 — — 1,259 Money market funds1,496 — — 1,496 969 — — 969 Time deposits and certificates of deposits117 — — 117 214 — — 214 U.S. government and agency securities544 — — 544 2,487 3 — 2,490 Non-U.S. government and agency securities195 — — 195 189 — — 189 $4,003 $— $(3)$4,000 $5,153 $3 $(2)$5,154\nTABLE: TABLE: December 28, 2024 December 30, 2023; Cost/ Amortized Cost Gross Unrealized Gains Gross Unrealized Losses Estimated Fair Value Cost/ Amortized Cost Gross Unrealized Gains Gross Unrealized Losses Estimated Fair Value; (in millions) (in millions); Asset-backed and mortgage-backed securities $ 30 $ — $ (2) $ 28 $ 35 $ — $ (2) $ 33; Corporate debt securities 1,621 — (1) 1,620 1,259 — — 1,259; Money market funds 1,496 — — 1,496 969 — — 969; Time deposits and certificates of deposits 117 — — 117 214 — — 214; U.S. government and agency securities 544 — — 544 2,487 3 — 2,490; Non-U.S. government and agency securities 195 — — 195 189 — — 189; $ 4,003 $ — $ (3) $ 4,000 $ 5,153 $ 3 $ (2) $ 5,154.\nTITLE: December 28, 2024December 30, 2023\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: Cost/ Amortized Cost\nTITLE: Gross Unrealized Gains\nTITLE: Gross Unrealized Losses\nTITLE: Estimated Fair Value\nTITLE: Cost/ Amortized Cost\nTITLE: Gross Unrealized Gains\nTITLE: Gross Unrealized Losses\nTITLE: Estimated Fair Value\nTITLE: (in millions)(in millions)\nTITLE: (in millions)\nTEXT: As of December 28, 2024 and December 30, 2023, the Company did not have material available-for-sale debt securities which had been in a continuous unrealized loss position of more than twelve months.\nTEXT: The contractual maturities of investments classified as available-for-sale are as follows:\nTEXT: December 28, 2024December 30, 2023Amortized CostFair ValueAmortized CostFair Value(In millions)(In millions)Due within 1 year$2,073 $2,073 $3,792 $3,792 Due in 1 year through 5 years406 405 361 364 Due in 5 years and later27 26 32 30 $2,506 $2,504 $4,185 $4,186\nTABLE: TABLE: December 28, 2024 December 30, 2023; Amortized Cost Fair Value Amortized Cost Fair Value; (In millions) (In millions); Due within 1 year $ 2,073 $ 2,073 $ 3,792 $ 3,792; Due in 1 year through 5 years 406 405 361 364; Due in 5 years and later 27 26 32 30; $ 2,506 $ 2,504 $ 4,185 $ 4,186.\nTITLE: December 28, 2024December 30, 2023\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: Amortized CostFair ValueAmortized CostFair Value\nTITLE: Amortized Cost\nTITLE: Fair Value\nTITLE: Amortized Cost\nTITLE: Fair Value\nTITLE: (In millions)(In millions)\n"
    },
    {
      "cluster": 16,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndecember, value, company, contracts, stock, fair, common, term, foreign, currency\n\nTITLE: (In millions)\nTEXT: Financial Instruments Measured at Fair Value on a Non-Recurring Basis\nTEXT: As of December 28, 2024 and December 30, 2023, the Company had non-marketable securities in privately-held companies of $468 million and $155 million, respectively, which are recorded at estimated fair value based on Level 3 inputs.\nTEXT: Financial Instruments Not Recorded at Fair Value\nTEXT: The carrying amounts and estimated fair values of the Company’s long-term debt are as follows:\nTEXT: December 28, 2024December 30, 2023 CarryingAmountEstimatedFair ValueCarryingAmountEstimatedFair Value (In millions)(In millions)Current portion of long-term debt, net$— $— $751 $741 Long-term debt, net of current portion$1,721 $1,543 $1,717 $1,630\nTABLE: TABLE: December 28, 2024 December 30, 2023; CarryingAmount EstimatedFair Value CarryingAmount EstimatedFair Value; (In millions) (In millions); Current portion of long-term debt, net $ — $ — $ 751 $ 741; Long-term debt, net of current portion $ 1,721 $ 1,543 $ 1,717 $ 1,630.\nTITLE: December 28, 2024December 30, 2023\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: CarryingAmountEstimatedFair ValueCarryingAmountEstimatedFair Value\nTITLE: CarryingAmount\nTITLE: EstimatedFair Value\nTITLE: CarryingAmount\nTITLE: EstimatedFair Value\nTITLE: (In millions)(In millions)\nTITLE: (In millions)\nTEXT: The estimated fair value of the Company’s long-term debt is based on Level 2 inputs of quoted prices for the Company’s debt and comparable instruments in inactive markets.\nTEXT: The fair value of the Company’s accounts receivable, accounts payable and other short-term obligations approximate their carrying value based on existing terms.\nTITLE: Hedging Transactions and Derivative Financial Instruments\nTEXT: Foreign Currency Forward Contracts Designated as Accounting Hedges\nTEXT: The Company enters into foreign currency forward contracts to hedge its exposure to foreign currency exchange rate risk related to future forecasted transactions denominated in currencies other than the U.S. Dollar. These contracts generally mature within 24 months and are designated as accounting hedges. As of December 28, 2024 and December 30, 2023, the notional value of the Company’s outstanding foreign currency forward contracts designated as cash flow hedges was $2.2 billion and $2.4 billion, respectively. The fair value of these contracts as of December 28, 2024 is recorded within Prepaid expenses and other current assets, Accrued liabilities and Other long-term liabilities of $6 million, $60 million and $11 million, respectively. As of December 30, 2023, the fair value of these contracts was recorded within Prepaid expenses and other current assets and Accrued liabilities of $24 million and $18 million, respectively.\nTEXT: Foreign Currency Forward Contracts Not Designated as Accounting Hedges\nTEXT: The Company also enters into foreign currency forward contracts to reduce the short-term effects of foreign currency fluctuations on certain receivables or payables denominated in currencies other than the U.S. Dollar. These forward contracts generally mature within 3 months and are not designated as accounting hedges. As of December 28, 2024 and December 30, 2023, the notional value of these outstanding contracts was $642 million and $568 million, respectively. The fair value of these contracts was not material as of December 28, 2024 and December 30, 2023.\nTEXT: The cash flows associated with derivative instruments as cash flow hedging instruments are classified in the same category within the Consolidated Statement of Cash Flows as the cash flows of the related items.\nTITLE: Year Ended\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\nTITLE: (In millions, except per share amounts)\nTEXT: Effect of potentially dilutive shares from employee equity plans\nTEXT: Potential shares from employee equity plans totaling 1 million, 6 million and 16 million weighted-average shares for 2024, 2023 and 2022, respectively, were not included in the earnings per share calculation because their inclusion would have been anti-dilutive.\nTITLE: Common Stock\nTEXT: Shares of common stock outstanding were as follows:Year EndedDecember 28,2024December 30,2023December 31,2022(In millions)Balance, beginning of period1,616 1,612 1,207 Common stock issued in the acquisition of Xilinx— — 429 Common stock issued under employee equity plans17 17 17 Repurchases of common stock(6)(10)(36)Common stock repurchases for tax withholding on equity awards(5)(4)(5)Issuance of common stock upon warrant exercise— 1 — Balance, end of period1,622 1,616 1,612\nTABLE: TABLE: December 28,2024 December 30,2023 December 31,2022; Balance, beginning of period 1,616 1,612 1,207; Common stock issued in the acquisition of Xilinx — — 429; Common stock issued under employee equity plans 17 17 17; Repurchases of common stock (6) (10) (36); Common stock repurchases for tax withholding on equity awards (5) (4) (5); Issuance of common stock upon warrant exercise — 1 —; Balance, end of period 1,622 1,616 1,612.\nTITLE: Year Ended\nTITLE: December 28,2024December 30,2023December 31,2022\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: December 31,2022\nTITLE: (In millions)\nTEXT: The Company has an approved stock repurchase program authorizing repurchases of up to $12 billion of the Company’s common stock (Repurchase Program). During the year ended December 28, 2024, the Company repurchased 5.9 million shares of its common stock under the Repurchase Program for $862 million. As of December 28, 2024, $4.7 billion remained available for future stock repurchases under this program. This Repurchase Program does not obligate the Company to acquire any common stock, has no termination date and may be suspended or discontinued at any time.\n"
    },
    {
      "cluster": 17,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstock, plan, company, shares, granted, options, based, awards, grant, performance\n\nTITLE: Stock-Based Compensation\nTEXT: The Company’s employee equity programs are intended to attract, retain and motivate highly qualified employees. On May 18, 2023, the Company’s stockholders approved the AMD 2023 Equity Incentive Plan (the 2023 Plan), which supersedes the AMD 2004 Equity Incentive Plan and the Xilinx, Inc. 2007 Equity Incentive Plan (the Prior Plans). Outstanding awards granted under the Prior Plans will continue to be governed by the terms of the Prior Plans but no awards may be made under the Prior Plans on or after May 18, 2023. Under the 2023 Plan, 87,645,874 shares of the Company’s common stock are reserved and available for delivery pursuant to awards granted under the 2023 Plan. Generally, stock options granted under the 2023 Plan vest and become exercisable over a four-year period from the date of grant and expire within seven years after the grant date. Unvested shares from the 2023 Plan that are reacquired by the Company from forfeited outstanding equity awards become available for grant and may be reissued as new awards. Under the 2023 Plan, the Company can grant (i) stock options, and (ii) RSUs, including time-based RSUs and PRSUs.\nTEXT: Stock Options. Under the 2023 Plan, nonstatutory and incentive stock options may be granted. The exercise price of the shares subject to each nonstatutory stock option and incentive stock option cannot be less than 100% of the fair market value of the Company’s common stock on the date of the grant. The exercise price of each option granted under the 2023 Plan must be paid in full at the time of the exercise.\nTEXT: Time-based RSUs. Time-based RSUs are awards that can be granted to any employee, director or consultant and that obligate the Company to issue a specific number of shares of the Company’s common stock in the future if the vesting terms and conditions are satisfied.\nTEXT: PRSUs. PRSUs can be granted to certain of the Company’s senior executives. The performance metrics can be financial performance, non-financial performance and/or market conditions. Each PRSU award reflects a target number of shares (Target Shares) that may be issued to an award recipient before adjusting based on the Company’s financial performance, non-financial performance and/or market conditions. The actual number of shares that a grant recipient receives at the end of the period may range from 0% to 250% of the Target Shares granted, depending upon the degree of achievement of the performance target designated by each individual award.\nTEXT: ESPP. Under the 2017 Plan, eligible employees who participate in an offering period may have up to 15% of their eligible earnings withheld, up to certain limitations, to purchase shares of common stock at 85% of the lower of the fair market value on the first or the last business day of the six-month offering period. The offering periods commence in May and November each year.\nTEXT: As of December 28, 2024, the Company had 60 million shares of common stock that were available for future grants and 34 million shares reserved for issuance upon the exercise of outstanding stock options or the vesting of unvested RSUs, including PRSUs, under the 2023 Plan and the Prior Plans.\nTEXT: Stock-based compensation expense was allocated in the Company’s Consolidated Statements of Operations as follows:Year EndedDecember 28, 2024December 30, 2023December 31, 2022 (In millions)Cost of sales$21 $30 $29 Research and development1,079 1,002 697 Marketing, general, and administrative307 352 355 Total stock-based compensation expense before income taxes1,407 1,384 1,081 Income tax benefit(251)(249)(179)Total stock-based compensation expense, net of income taxes$1,156 $1,135 $902\nTABLE: TABLE: December 28, 2024 December 30, 2023 December 31, 2022; Cost of sales $ 21 $ 30 $ 29; Research and development 1,079 1,002 697; Marketing, general, and administrative 307 352 355; Total stock-based compensation expense before income taxes 1,407 1,384 1,081; Income tax benefit (251) (249) (179); Total stock-based compensation expense, net of income taxes $ 1,156 $ 1,135 $ 902.\nTITLE: Year Ended\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\nTITLE: (In millions)\nTEXT: Stock Options. The weighted-average estimated fair value of employee stock options granted during 2024, 2023 and 2022 was $68.38, $53.72 and $44.35 per share, respectively, using the following assumptions:\nTEXT: December 28, 2024December 30, 2023December 31, 2022Expected volatility54.34 %52.36% - 52.42%51.28 %Risk-free interest rate3.80 %3.93% - 4.11%3.00 %Expected dividends— %— %— %Expected life (in years)4.984.96 - 5.044.75\nTABLE: TABLE: December 28, 2024 December 30, 2023 December 31, 2022; Expected volatility 54.34 % 52.36% - 52.42% 51.28 %; Risk-free interest rate 3.80 % 3.93% - 4.11% 3.00 %; Expected dividends — % — % — %; Expected life (in years) 4.98 4.96 - 5.04 4.75.\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\n"
    },
    {
      "cluster": 18,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndecember, expected, stock, date, company, based, grant, average, volatility, options\n\nTITLE: December 31, 2022\nTEXT: The Company uses a combination of the historical volatility of its common stock and the implied volatility for publicly traded options on the Company’s common stock as the expected volatility assumption. The risk-free interest rate is based on the rate for a U.S. Treasury zero-coupon yield curve with a term that approximates the expected life of the option grant at the date closest to the option grant date. The expected dividend yield is zero as the Company does not expect to pay dividends in the near future. The expected term of employee stock options represents the weighted-average period the stock options are expected to remain outstanding.\nTEXT: The following table summarizes stock option activity and related information:\nTEXT: Outstanding Numberof SharesWeighted-AverageExercisePriceAggregate Intrinsic ValueWeighted-Average Remaining Contractual Life(in years) (In millions, except share price)Balance as of December 30, 20233 $68.33 Granted— $134.27 Forfeited— $102.71 Exercised(1)$22.17 Balance as of December 28, 20242 $89.73 $81 3.92Exercisable December 28, 20241 $74.61 $69 2.83\nTABLE: TABLE: Outstanding Numberof Shares Weighted-AverageExercisePrice Aggregate Intrinsic Value Weighted-Average Remaining Contractual Life(in years); Balance as of December 30, 2023 3 $ 68.33; Granted — $ 134.27; Forfeited — $ 102.71; Exercised (1) $ 22.17; Balance as of December 28, 2024 2 $ 89.73 $ 81 3.92; Exercisable December 28, 2024 1 $ 74.61 $ 69 2.83.\nTITLE: Outstanding Numberof SharesWeighted-AverageExercisePriceAggregate Intrinsic ValueWeighted-Average Remaining Contractual Life(in years)\nTITLE: Outstanding Numberof Shares\nTITLE: Weighted-AverageExercisePrice\nTITLE: Aggregate Intrinsic Value\nTITLE: Weighted-Average Remaining Contractual Life(in years)\nTITLE: (In millions, except share price)\nTEXT: The total intrinsic value of stock options exercised for 2024, 2023 and 2022 was $86 million, $173 million and $139 million, respectively. As of December 28, 2024, the Company had $41 million of total unrecognized compensation expense related to stock options, which will be recognized over the weighted-average period of 2.71 years.\nTEXT: Time-based RSUs. The weighted-average grant date fair values of time-based RSUs granted during 2024, 2023 and 2022 were $141.95, $106.28 and $92.92 per share, respectively.\nTEXT: The following table summarizes time-based RSU activity and related information:\nTEXT: Numberof SharesWeighted- Average Grant Date Fair Value (In millions)Unvested shares as of December 30, 202332 $100.65 Granted12 $141.95 Forfeited(1)$107.96 Vested(13)$101.35 Unvested shares as of December 28, 202430 $116.77\nTABLE: TABLE: Numberof Shares Weighted- Average Grant Date Fair Value; Unvested shares as of December 30, 2023 32 $ 100.65; Granted 12 $ 141.95; Forfeited (1) $ 107.96; Vested (13) $ 101.35; Unvested shares as of December 28, 2024 30 $ 116.77.\nTITLE: Numberof SharesWeighted- Average Grant Date Fair Value\nTITLE: Numberof Shares\nTITLE: Weighted- Average Grant Date Fair Value\nTITLE: (In millions)\nTEXT: The total fair value of time-based RSUs vested during 2024, 2023 and 2022 was $2.0 billion, $1.1 billion and $889 million, respectively. As of December 28, 2024, the Company had $2.6 billion of total unrecognized compensation expense related to time-based RSUs, which will be recognized over the weighted-average period of 2.63 years.\nTEXT: PRSUs. The weighted-average grant date fair values of PRSUs granted during 2024, 2023 and 2022 were $118.98, $134.87 and $121.12, respectively, using the following assumptions:\nTEXT: December 28, 2024December 30, 2023December 31, 2022Expected volatility52.68% - 53.19%51.12% - 56.22%50.65% - 53.51%Risk-free interest rate3.82% - 4.41%4.30% - 4.36%1.14%- 3.17%Expected dividends— %— %— %Expected term (in years)2.48 - 3.002.17 - 3.002.07 - 3.07\nTABLE: TABLE: December 28, 2024 December 30, 2023 December 31, 2022; Expected volatility 52.68% - 53.19% 51.12% - 56.22% 50.65% - 53.51%; Risk-free interest rate 3.82% - 4.41% 4.30% - 4.36% 1.14%- 3.17%; Expected dividends — % — % — %; Expected term (in years) 2.48 - 3.00 2.17 - 3.00 2.07 - 3.07.\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\nTEXT: The Company uses the historical volatility of its common stock and risk-free interest rate based on the rate for a U.S. Treasury zero-coupon yield curve with a term that approximates the expected life of the PRSUs grant at the date closest to the grant date. The expected dividend yield is zero as the Company does not expect to pay dividends in the near future. The expected term of PRSUs represents the requisite service periods of these PRSUs.\nTEXT: The following table summarizes PRSU activity and related information:\nTEXT: Numberof SharesWeighted-AverageGrant Date Fair Value(In millions)Unvested shares as of December 30, 20232 $117.65 Granted1 $118.98 Forfeited— $132.80 Vested(1)$91.15 Unvested shares as of December 28, 20242 $139.31\nTABLE: TABLE: Numberof Shares Weighted-AverageGrant Date Fair Value; Unvested shares as of December 30, 2023 2 $ 117.65; Granted 1 $ 118.98; Forfeited — $ 132.80; Vested (1) $ 91.15; Unvested shares as of December 28, 2024 2 $ 139.31.\nTITLE: Numberof SharesWeighted-AverageGrant Date Fair Value\nTITLE: Numberof Shares\nTITLE: Weighted-AverageGrant Date Fair Value\n"
    },
    {
      "cluster": 19,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndecember, income, espp, total, expected, benefit, federal, company, average, rate\n\nTITLE: (In millions)\nTEXT: The total fair value of PRSUs vested during 2024, 2023 and 2022 was $226 million, $100 million and $254 million, respectively. As of December 28, 2024, the Company had $154 million of total unrecognized compensation expense related to PRSUs, which will be recognized over the weighted-average period of 1.61 years.\nTEXT: ESPP. The weighted-average grant date fair value for the ESPP during 2024, 2023 and 2022 was $43.80, $31.11 and $24.71 per share, respectively, using the following assumptions:\nTEXT: December 28, 2024December 30, 2023December 31, 2022Expected volatility48.14% - 49.38%45.74% - 49.40%58.15% - 63.76%Risk-free interest rate4.42% - 5.41%5.13% - 5.46%1.43% - 4.52%Expected dividends— %— %— %Expected term (in years)0.500.500.50\nTABLE: TABLE: December 28, 2024 December 30, 2023 December 31, 2022; Expected volatility 48.14% - 49.38% 45.74% - 49.40% 58.15% - 63.76%; Risk-free interest rate 4.42% - 5.41% 5.13% - 5.46% 1.43% - 4.52%; Expected dividends — % — % — %; Expected term (in years) 0.50 0.50 0.50.\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\nTEXT: The Company uses the historical volatility of its common stock and the risk-free interest rate based on the rate for a U.S. Treasury zero-coupon yield curve with a term that approximates the expected life of the ESPP grant at the date closest to the ESPP grant date. The expected dividend yield is zero as the Company does not expect to pay dividends in the near future. The expected term of the ESPP represents the six-month offering period.\nTEXT: During 2024, 2 million shares of common stock were purchased under the ESPP at an average purchase price of $111 resulting in aggregate cash proceeds of $265 million. As of December 28, 2024, the Company had $43 million of total unrecognized compensation expense related to the ESPP, which will be recognized over the weighted-average period of 0.37 years.\nTITLE: Employee severance and benefitsAsset impairmentTotal\nTITLE: Employee severance and benefits\nTITLE: Asset impairment\nTITLE: Total\nTITLE: (in millions)\nTEXT: Liability as of December 30, 2023\nTEXT: Liability as of December 28, 2024\nTITLE: Year Ended\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\nTITLE: (In millions)\nTEXT: The income tax provision (benefit) consists of:Year EndedDecember 28, 2024December 30, 2023December 31, 2022 (In millions)Current:U.S. federal$1,338 $496 $1,191 U.S. state and local64 27 31 Non-U.S.142 150 161 Total1,544 673 1,383 Deferred:U.S. federal(311)(860)(1,365)U.S. state and local6 (29)(26)Non-U.S.(858)(130)(114)Total(1,163)(1,019)(1,505)Income tax provision (benefit)$381 $(346)$(122)\nTABLE: TABLE: December 28, 2024 December 30, 2023 December 31, 2022; U.S. federal $ 1,338 $ 496 $ 1,191; U.S. state and local 64 27 31; Non-U.S. 142 150 161; Total 1,544 673 1,383; U.S. federal (311) (860) (1,365); U.S. state and local 6 (29) (26); Non-U.S. (858) (130) (114); Total (1,163) (1,019) (1,505); Income tax provision (benefit) $ 381 $ (346) $ (122).\nTITLE: Year Ended\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\nTITLE: (In millions)\nTEXT: The table below displays the reconciliation between statutory federal income taxes and the total income tax provision (benefit).\nTEXT: Year EndedDecember 28, 2024December 30, 2023December 31, 2022 (In millions)Statutory federal income tax expense at 21%$425 $107 $252 Tax effect from intercompany integration transaction373 — — Foreign rate detriment (benefit)153 (11)195 Interest and penalty136 53 33 State income taxes, net of federal benefit22 (2)(3)Foreign-Derived Intangible Income (FDII) deduction(275)(185)(261)Research credits(232)(169)(241)GILTI and other foreign inclusion(133)(138)(96)Stock-based and non-deductible compensation(101)(17)(6)Other13 16 5 Income tax provision (benefit)$381 $(346)$(122)\nTABLE: TABLE: December 28, 2024 December 30, 2023 December 31, 2022; Statutory federal income tax expense at 21% $ 425 $ 107 $ 252; Tax effect from intercompany integration transaction 373 — —; Foreign rate detriment (benefit) 153 (11) 195; Interest and penalty 136 53 33; State income taxes, net of federal benefit 22 (2) (3); Foreign-Derived Intangible Income (FDII) deduction (275) (185) (261); Research credits (232) (169) (241); GILTI and other foreign inclusion (133) (138) (96); Stock-based and non-deductible compensation (101) (17) (6); Other 13 16 5; Income tax provision (benefit) $ 381 $ (346) $ (122).\nTITLE: Year Ended\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\n"
    },
    {
      "cluster": 20,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndeferred, income, company, assets, december, benefit, liabilities, foreign, taxes, acquisition\n\nTITLE: (In millions)\nTEXT: Foreign rate detriment (benefit)\nTEXT: State income taxes, net of federal benefit\nTEXT: The Company recorded an income tax provision of $381 million and an income tax benefit of $346 million in 2024 and 2023, respectively, representing effective tax rates of 19% and (68)%, respectively. The increase in income tax provision in 2024 was primarily due to higher pre-tax income and a $373 million tax effect from an intercompany integration transaction.\nTEXT: Beginning in 2022, provisions in the U.S. Tax Cuts and Jobs Act of 2017 require the Company to capitalize and amortize R&D expenditures rather than deducting the costs as incurred. The capitalization resulted in an increase in 2024 and 2023 taxable income which also increased the income eligible for the FDII tax benefit.\nTEXT: As a part of the Xilinx acquisition and as a result of certain employment and operational commitments the Company has made in Singapore, the Company has been granted a Development and Expansion Incentive (DEI) that is effective through 2031. The DEI reduces the local tax on Singapore income from a statutory rate of 17% to 5% through 2031. Due to the current year pre-tax loss in Singapore, the Company did not receive any income tax or earnings per share benefit.\nTEXT: Deferred income taxes reflect the net tax effects of tax carryovers and temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the balances for income tax purposes. Significant components of the Company’s deferred tax assets and liabilities as of December 28, 2024 and December 30, 2023 were as follows:\nTEXT: December 28,2024December 30,2023 (In millions)Deferred tax assets:Capitalized R&D$2,892 $1,753 Net operating loss carryovers962 992 Accruals and reserves not currently deductible829 574 Federal and state tax credit carryovers679 660 Foreign R&D and investment tax credits579 597 Employee benefits not currently deductible334 302 Lease liability182 181 Foreign tax credits77 71 Other111 96 Total deferred tax assets6,645 5,226 Less: valuation allowance(2,136)(2,124)Total deferred tax assets, net of valuation allowance4,509 3,102 Deferred tax liabilities:Acquired intangibles (3,614)(3,104)GILTI(222)(524)Right-of-use assets(182)(175)Other(152)(135)Total deferred tax liabilities(4,170)(3,938)Net deferred tax assets (liabilities)$339 $(836)\nTABLE: TABLE: December 28,2024 December 30,2023; Capitalized R&D $ 2,892 $ 1,753; Net operating loss carryovers 962 992; Accruals and reserves not currently deductible 829 574; Federal and state tax credit carryovers 679 660; Foreign R&D and investment tax credits 579 597; Employee benefits not currently deductible 334 302; Lease liability 182 181; Foreign tax credits 77 71; Other 111 96; Total deferred tax assets 6,645 5,226; Less: valuation allowance (2,136) (2,124); Total deferred tax assets, net of valuation allowance 4,509 3,102; Acquired intangibles (3,614) (3,104); GILTI (222) (524); Right-of-use assets (182) (175); Other (152) (135); Total deferred tax liabilities (4,170) (3,938); Net deferred tax assets (liabilities) $ 339 $ (836).\nTITLE: December 28,2024December 30,2023\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTEXT: During 2024, the Company executed an intercompany integration transaction and remeasured associated deferred taxes, resulting in increases to the deferred tax liability for acquisition-related intangibles and the deferred tax asset for Capitalized R&D, partially offset by a decrease in the deferred tax liability for GILTI.\nTEXT: The movement in the deferred tax valuation allowance was as follows:\nTEXT: December 28, 2024December 30, 2023December 31, 2022 (In millions)Balance at beginning of year$2,124 $2,078 $1,735 Charges to income tax expense and other accounts9 41 112 Acquisition-related3 5 231 Balance at end of year$2,136 $2,124 $2,078\nTABLE: TABLE: December 28, 2024 December 30, 2023 December 31, 2022; Balance at beginning of year $ 2,124 $ 2,078 $ 1,735; Charges to income tax expense and other accounts 9 41 112; Acquisition-related 3 5 231; Balance at end of year $ 2,136 $ 2,124 $ 2,078.\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\n"
    },
    {
      "cluster": 21,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, december, federal, state, nols, subject, expire, income, will, balance\n\nTITLE: (In millions)\nTEXT: Charges to income tax expense and other accounts\nTEXT: Through the end of fiscal year 2024, the Company continued to maintain a valuation allowance of approximately $2.1 billion for certain federal, state, and foreign tax attributes. The federal valuation allowance maintained is due to limitations under Internal Revenue Code Section 382 or 383, separate return loss year rules, or dual consolidated loss rules. Certain state and foreign valuation allowance maintained is due to lack of sufficient sources of future taxable income.\nTEXT: The Company’s U.S. federal and state net operating losses (NOLs) carryforwards as of December 28, 2024, were $134 million and $362 million, respectively. NOLs may be subject to limitations by the Internal Revenue Code and similar provisions. $27 million of U.S. federal NOLs will expire between 2025 and 2037, and $107 million of federal NOLs have no expiration date. State NOLs will expire at various dates through 2043. The difference between the amount of federal NOLs which are recorded on the Company’s Consolidated Balance Sheets as deferred tax assets and their related valuation allowance, and the amounts reported on the Company’s tax returns are the result of uncertain tax positions the Company has taken for which an income tax reserve has been recorded. The federal tax credits of $12 million will expire at various dates between 2037 and 2042. The state tax return credits of $804 million will expire at various dates between 2025 and 2039, except for the California R&D credit, which does not expire. The Company also has $620 million of credit carryforward in Canada that will expire between 2028 and 2044.\nTEXT: A reconciliation of the Company's gross unrecognized tax benefits was as follows:December 28, 2024December 30, 2023December 31, 2022 (In millions)Balance at beginning of year$1,463 $1,361 $275 Increases for tax positions taken in the current year57 53 748 Increases for tax positions taken in prior years24 57 104 Decreases for tax positions taken in prior years(18)(8)(12)Increases to tax positions taken in prior years through acquisitions— — 252 Decreases for settlements with taxing authorities and statute of limitation lapses (28)— (6)Balance at end of year$1,498 $1,463 $1,361\nTABLE: TABLE: December 28, 2024 December 30, 2023 December 31, 2022; Balance at beginning of year $ 1,463 $ 1,361 $ 275; Increases for tax positions taken in the current year 57 53 748; Increases for tax positions taken in prior years 24 57 104; Decreases for tax positions taken in prior years (18) (8) (12); Increases to tax positions taken in prior years through acquisitions — — 252; Decreases for settlements with taxing authorities and statute of limitation lapses (28) — (6); Balance at end of year $ 1,498 $ 1,463 $ 1,361.\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\nTITLE: (In millions)\nTEXT: The amount of unrecognized tax benefits that would impact the effective tax rate if recognized was $1.3 billion, $1.3 billion and $1.2 billion as of December 28, 2024, December 30, 2023 and December 31, 2022, respectively. The Company had $298 million, $142 million and $81 million of accrued penalties and interest related to unrecognized tax benefits as of December 28, 2024, December 30, 2023 and December 31, 2022, respectively. As of December 28, 2024 and December 30, 2023, the Company had long-term income tax liabilities related to unrecognized tax benefits of $1.4 billion, recorded under Other long-term liabilities in the Company’s Consolidated Balance Sheets.\nTEXT: The Company is subject to taxation in the U.S. and foreign jurisdictions. Earnings from non-U.S. activities are subject to local country income tax. The material jurisdiction in which the Company is subject to potential examination by the taxing authority is the United States, where tax years from 2008 are open for audit. Pre-acquisition Xilinx U.S. tax returns for fiscal years 2018 and 2019 are currently under audit by the IRS. It is possible the Company may have tax audits close in the next 12 months that could materially change the balance of the uncertain tax benefits; however, the timing of tax audit closures and settlements are highly uncertain.\nTEXT: Under current U.S. tax law, the impact of future distributions of undistributed earnings that are indefinitely reinvested are anticipated to be subject to withholding taxes from local jurisdictions and non-conforming U.S. state jurisdictions. There were no cumulative undistributed earnings that are indefinitely reinvested that could be subject to withholding taxes as of December 28, 2024.\nTITLE: Year Ended\nTITLE: December 28, 2024December 30, 2023December 31, 2022\nTITLE: December 28, 2024\nTITLE: December 30, 2023\nTITLE: December 31, 2022\nTITLE: (In millions)\n"
    },
    {
      "cluster": 22,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, operating, lease, leases, payments, certain, purchase, december, obligations, term\n\nTITLE: Operating Leases\nTEXT: The Company has entered into operating and finance leases for its corporate offices, data centers, research and development facilities and certain equipment. The leases expire at various dates through 2038, some of which include options to extend the lease for up to ten years.\nTEXT: For 2024, 2023 and 2022, the Company recorded $147 million, $127 million and $118 million, respectively, of operating lease expense, including short-term lease expense. For 2024, 2023, and 2022, the Company recorded $83 million, $46 million, and $40 million respectively, of variable lease expense, which primarily included operating expenses and property taxes associated with the usage of facilities under the operating leases. For 2024, 2023, and 2022 cash paid for operating leases included in operating cash flows was $155 million $147 million and $108 million, respectively. The Company’s finance and short-term leases are immaterial to the Company’s consolidated financial statements.\nTEXT: Supplemental information related to leases is as follows:December 28, 2024Weighted-average remaining lease term in years – operating leases7.28Weighted-average discount rate – operating leases4.63 %\nTABLE: TABLE: Weighted-average remaining lease term in years – operating leases 7.28; Weighted-average discount rate – operating leases 4.63 %.\nTITLE: December 28, 2024\nTEXT: Future minimum lease payments under non-cancellable operating lease liabilities as of December 28, 2024 are as follows:\nTEXT: Year(In millions)2025$134 2026135 202794 202866 202960 2030 and thereafter235 Total minimum lease payments724 Less: interest(124) Present value of net minimum lease payments600 Less: current portion(109) Total long-term operating lease liabilities$491\nTABLE: TABLE: Year (In millions); 2025 $ 134; 2026 135; 2027 94; 2028 66; 2029 60; 2030 and thereafter 235; Total minimum lease payments 724; Less: interest (124); Present value of net minimum lease payments 600; Less: current portion (109); Total long-term operating lease liabilities $ 491.\nTITLE: Year(In millions)\nTITLE: (In millions)\nTEXT: Certain other operating leases contain provisions for escalating lease payments subject to changes in the consumer price index.\nTITLE: Commitments\nTEXT: The Company’s purchase commitments primarily include the Company’s obligations to purchase wafers and substrates from third parties and future payments related to certain software and technology licenses and IP licenses. Purchase commitments include obligations made under noncancellable purchase orders and contractual obligations requiring minimum purchases or for which cancellation would lead to significant penalties.\nTEXT: Total future unconditional purchase commitments as of December 28, 2024 were as follows:\nTITLE: Year(In millions)2025$4,501 2026274 202746 202846 202945 2030 and thereafter56 Total unconditional purchase commitments$4,968\nTABLE: TABLE: Year (In millions); 2025 $ 4,501; 2026 274; 2027 46; 2028 46; 2029 45; 2030 and thereafter 56; Total unconditional purchase commitments $ 4,968.\nTITLE: Year(In millions)2025$4,501 2026274 202746 202846 202945 2030 and thereafter56 Total unconditional purchase commitments$4,968\nTITLE: Year(In millions)\nTITLE: (In millions)\nTEXT: On an ongoing basis, the Company works with suppliers on the timing of payments and deliveries of purchase commitments, taking into account business conditions.\nTITLE: Warranties and Indemnities\nTEXT: The Company generally warrants that its products sold to its customers will conform to its approved specifications and be free from defects in material and workmanship under normal use and conditions for one year. The Company may also offer, in general, one to three-year limited warranties based on product type and negotiated warranty terms with certain customers. The Company accrues warranty costs to Cost of sales at the time of sale of warranted products.\nTEXT: Changes in the Company’s estimated liability for product warranty during 2024 and 2023 are as follows:\nTEXT: December 28,2024December 30,2023 (In millions)Beginning balance$85 $65 Provisions during the period213 126 Settlements during the period(110)(106)Ending balance$188 $85\nTABLE: TABLE: December 28,2024 December 30,2023; Beginning balance $ 85 $ 65; Provisions during the period 213 126; Settlements during the period (110) (106); Ending balance $ 188 $ 85.\nTITLE: December 28,2024December 30,2023\nTITLE: December 28,2024\nTITLE: December 30,2023\nTITLE: (In millions)\nTEXT: In addition to product warranties, the Company from time to time in its normal course of business indemnifies other parties with whom it enters into contractual relationships, including customers, lessors and parties to other transactions with the Company, with respect to certain matters. In these limited matters, the Company has agreed to hold certain third parties harmless against specific types of claims or losses such as those arising from a breach of representations or covenants, third-party claims that the Company’s products when used for their intended purpose(s) and under specific conditions infringe the intellectual property rights of a third party, or other specified claims made against the indemnified party. It is not possible to determine the maximum potential amount of liability under these indemnification obligations due to the unique facts and circumstances that are likely to be involved in each particular claim and indemnification provision. Historically, payments made by the Company under these obligations have not been material. In addition, the impact from changes in estimates for pre-existing warranties has been immaterial.\nTITLE: Report of Independent Registered Public Accounting Firm\nTEXT: To the Stockholders and the Board of Directors of Advanced Micro Devices, Inc.\n"
    },
    {
      "cluster": 23,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfinancial, statements, company, december, audits, consolidated, opinion, accounting, pcaob, material\n\nTITLE: Opinion on the Financial Statements\nTEXT: We have audited the accompanying consolidated balance sheets of Advanced Micro Devices, Inc. (the Company) as of December 28, 2024 and December 30, 2023, the related consolidated statements of operations, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 28, 2024, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 28, 2024 and December 30, 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 28, 2024, in conformity with U.S. generally accepted accounting principles.\nTEXT: We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 28, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 5, 2025 expressed an unqualified opinion thereon.\nTITLE: Basis for Opinion\nTEXT: These financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n"
    },
    {
      "cluster": 24,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nmanagement, audit, inventory, matter, excess, obsolescence, reserves, critical, financial, statements\n\nTITLE: Critical Audit Matter\nTEXT: The critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nTEXT: Inventory ValuationDescription of the MatterAt December 28, 2024, the Company’s net inventory balance was $5,734 million. As discussed in Note 2 to the consolidated financial statements, the Company adjusts the inventory carrying value to the lower of actual cost or the estimated net realizable value after completing ongoing reviews of on-hand inventory quantities exceeding forecasted demand, and by considering recent historical activity as well as anticipated demand. Auditing management’s inventory excess and obsolescence reserves involved significant judgment because the estimates are based on several factors that are affected by market, industry, and competitive conditions outside the Company's control. In estimating excess and obsolescence reserves, management developed certain assumptions, including forecasted demand which are sensitive to the competitiveness of product offerings, customer requirements, and product life cycles. These significant assumptions are forward-looking and could be affected by future economic and market conditions.How We Addressed the Matter in Our AuditWe obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls over the Company's inventory excess and obsolescence reserves estimation process, including the basis for developing the above-described assumptions and management’s judgments.Our audit procedures included, among others, testing the reasonableness of management’s key assumptions and judgments and testing the accuracy and completeness of the underlying data used to determine the amount of excess and obsolescence reserves. We compared the quantities and carrying value of on-hand inventories to related unit sales, both historical and forecasted, and evaluated the appropriateness and adequacy of management’s adjustments to such sales forecasts by analyzing potential technological changes in line with product life cycles. We also assessed the accuracy of forecasts underlying management's estimates by comparing management’s historical forecasts to actual results, evaluated industry and market factors and performed sensitivity analyses over the forecasted demand used by management to determine inventory excess and obsolescence reserves.\nTABLE: TABLE: Description of the Matter At December 28, 2024, the Company’s net inventory balance was $5,734 million. As discussed in Note 2 to the consolidated financial statements, the Company adjusts the inventory carrying value to the lower of actual cost or the estimated net realizable value after completing ongoing reviews of on-hand inventory quantities exceeding forecasted demand, and by considering recent historical activity as well as anticipated demand. Auditing management’s inventory excess and obsolescence reserves involved significant judgment because the estimates are based on several factors that are affected by market, industry, and competitive conditions outside the Company's control. In estimating excess and obsolescence reserves, management developed certain assumptions, including forecasted demand which are sensitive to the competitiveness of product offerings, customer requirements, and product life cycles. These significant assumptions are forward-looking and could be affected by future economic and market conditions.; How We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls over the Company's inventory excess and obsolescence reserves estimation process, including the basis for developing the above-described assumptions and management’s judgments.Our audit procedures included, among others, testing the reasonableness of management’s key assumptions and judgments and testing the accuracy and completeness of the underlying data used to determine the amount of excess and obsolescence reserves. We compared the quantities and carrying value of on-hand inventories to related unit sales, both historical and forecasted, and evaluated the appropriateness and adequacy of management’s adjustments to such sales forecasts by analyzing potential technological changes in line with product life cycles. We also assessed the accuracy of forecasts underlying management's estimates by comparing management’s historical forecasts to actual results, evaluated industry and market factors and performed sensitivity analyses over the forecasted demand used by management to determine inventory excess and obsolescence reserves..\n"
    },
    {
      "cluster": 25,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, control, internal, management, financial, reporting, december, inventory, audit, excess\n\nTITLE: Inventory Valuation\nTEXT: At December 28, 2024, the Company’s net inventory balance was $5,734 million. As discussed in Note 2 to the consolidated financial statements, the Company adjusts the inventory carrying value to the lower of actual cost or the estimated net realizable value after completing ongoing reviews of on-hand inventory quantities exceeding forecasted demand, and by considering recent historical activity as well as anticipated demand.\nTEXT: Auditing management’s inventory excess and obsolescence reserves involved significant judgment because the estimates are based on several factors that are affected by market, industry, and competitive conditions outside the Company's control. In estimating excess and obsolescence reserves, management developed certain assumptions, including forecasted demand which are sensitive to the competitiveness of product offerings, customer requirements, and product life cycles. These significant assumptions are forward-looking and could be affected by future economic and market conditions.\nTEXT: We obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls over the Company's inventory excess and obsolescence reserves estimation process, including the basis for developing the above-described assumptions and management’s judgments.\nTEXT: Our audit procedures included, among others, testing the reasonableness of management’s key assumptions and judgments and testing the accuracy and completeness of the underlying data used to determine the amount of excess and obsolescence reserves. We compared the quantities and carrying value of on-hand inventories to related unit sales, both historical and forecasted, and evaluated the appropriateness and adequacy of management’s adjustments to such sales forecasts by analyzing potential technological changes in line with product life cycles. We also assessed the accuracy of forecasts underlying management's estimates by comparing management’s historical forecasts to actual results, evaluated industry and market factors and performed sensitivity analyses over the forecasted demand used by management to determine inventory excess and obsolescence reserves.\nTEXT: We have served as the Company’s auditor since 1970.\nTITLE: Report of Independent Registered Public Accounting Firm\nTEXT: To the Stockholders and the Board of Directors of Advanced Micro Devices, Inc.\nTITLE: Opinion on Internal Control Over Financial Reporting\nTEXT: We have audited Advanced Micro Devices, Inc.’s internal control over financial reporting as of December 28, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Advanced Micro Devices, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 28, 2024, based on the COSO criteria.\nTEXT: We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 28, 2024 and December 30, 2023, the related consolidated statements of operations, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 28, 2024, and the related notes and our report dated February 5, 2025 expressed an unqualified opinion thereon.\nTITLE: Basis for Opinion\nTEXT: The Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nTEXT: Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\n"
    },
    {
      "cluster": 26,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfinancial, company, reporting, reasonable, internal, control, provide, assurance, statements, accordance\n\nTITLE: Definition and Limitations of Internal Control Over Financial Reporting\nTEXT: A company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nTEXT: Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n"
    }
  ]
}