[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.02\nTEXT: Item 2.02 Results of Operations and Financial Condition. On November 4, 2025, Advanced Micro Devices, Inc. (\"AMD\") announced its financial results for its third quarter of 2025 ended September 27, 2025 in a press release that is attached hereto as Exhibit 99.1. Attached hereto as Exhibit 99.2 is a presentation regarding AMD's third quarter of 2025. On November 4, 2025, Advanced Micro Devices, Inc. (\"AMD\") announced its financial results for its third quarter of 2025 ended September 27, 2025 in a press release that is attached hereto as Exhibit 99.1. Attached hereto as Exhibit 99.2 is a presentation regarding AMD's third quarter of 2025. The attached Exhibits 99.1 and 99.2, in addition to financial results presented on a U.S. Generally Accepted Accounting Principles (“GAAP”) basis, contains certain non-GAAP financial information and forward-looking financial guidance. Certain of these non-GAAP financial measures will be used in AMD’s earnings conference call. A reconciliation of these non-GAAP financial measures to their nearest GAAP equivalents is provided in the data tables at the end of the attached Exhibits 99.1 and 99.2. These non-GAAP financial measures should be viewed in addition to and not as a substitute for or superior to AMD’s reported results prepared in accordance with GAAP. The attached Exhibits 99.1 and 99.2, in addition to financial results presented on a U.S. Generally Accepted Accounting Principles (“GAAP”) basis, contains certain non-GAAP financial information and forward-looking financial guidance. Certain of these non-GAAP financial measures will be used in AMD’s earnings conference call. A reconciliation of these non-GAAP financial measures to their nearest GAAP equivalents is provided in the data tables at the end of the attached Exhibits 99.1 and 99.2. These non-GAAP financial measures should be viewed in addition to and not as a substitute for or superior to AMD’s reported results prepared in accordance with GAAP. The information in this report furnished pursuant to Items 2.02 and 7.01, including Exhibits 99.1 and 99.2 attached hereto, shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section. It may only be incorporated by reference in another filing under the Exchange Act or the Securities Act of 1933, as amended, if such subsequent filing specifically references the information furnished pursuant to Items 2.02 and 7.01 of this report. The information in this report furnished pursuant to Items 2.02 and 7.01, including Exhibits 99.1 and 99.2 attached hereto, shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section. It may only be incorporated by reference in another filing under the Exchange Act or the Securities Act of 1933, as amended, if such subsequent filing specifically references the information furnished pursuant to Items 2.02 and 7.01 of this report.\nTEXT: Item 2.02 “Results of Operations and Financial Condition” is incorporated into this\nTITLE: Item 7.01\nTEXT: Item 7.01 Regulation FD Disclosure. The information set forth under\nTEXT: Item 7.01 by reference. The information set forth under\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. EXHIBIT INDEXExhibit No.Description99.1Press Release dated November 4, 202599.2Third Quarter 2025 Financial Results Presentation104Inline XBRL for the cover page of this Current Report on Form 8-K EXHIBIT INDEXExhibit No.Description99.1Press Release dated November 4, 202599.2Third Quarter 2025 Financial Results Presentation104Inline XBRL for the cover page of this Current Report on Form 8-K EXHIBIT INDEXExhibit No.Description99.1Press Release dated November 4, 202599.2Third Quarter 2025 Financial Results Presentation104Inline XBRL for the cover page of this Current Report on Form 8-K Exhibit No.Description 99.1Press Release dated November 4, 2025 Press Release dated November 4, 2025 Press Release dated November 4, 2025 Press Release dated November 4, 2025 99.2Third Quarter 2025 Financial Results Presentation Third Quarter 2025 Financial Results Presentation Third Quarter 2025 Financial Results Presentation Third Quarter 2025 Financial Results Presentation Third Quarter 2025 Financial Results Presentation 104Inline XBRL for the cover page of this Current Report on Form 8-K Inline XBRL for the cover page of this Current Report on Form 8-K Inline XBRL for the cover page of this Current Report on Form 8-K Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Date: November 4, 2025ADVANCED MICRO DEVICES, INC.By:/s/ Jean HuName:Jean HuTitle:Executive Vice President, Chief Financial Officer & Treasurer Date: November 4, 2025ADVANCED MICRO DEVICES, INC.By:/s/ Jean HuName:Jean HuTitle:Executive Vice President, Chief Financial Officer & Treasurer Date: November 4, 2025ADVANCED MICRO DEVICES, INC.By:/s/ Jean HuName:Jean HuTitle:Executive Vice President, Chief Financial Officer & Treasurer Date: November 4, 2025ADVANCED MICRO DEVICES, INC. Date: November 4, 2025 Date: November 4, 2025 ADVANCED MICRO DEVICES, INC. ADVANCED MICRO DEVICES, INC. ADVANCED MICRO DEVICES, INC. Title:Executive Vice President, Chief Financial Officer & Treasurer Executive Vice President, Chief Financial Officer & Treasurer Executive Vice President, Chief Financial Officer & Treasurer Executive Vice President, Chief Financial Officer & Treasurer\n"
  }
]