[
  {
    "cluster": 1,
    "content": "TITLE: Item 7.01\nTEXT: Item 7.01. Regulation FD Disclosure. On December 8, 2025, The Boeing Company (the “Company”) issued a press release announcing the completion of its acquisition of Spirit AeroSystems Holdings, Inc, a Delaware corporation. A copy of the Company’s press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. On December 8, 2025, The Boeing Company (the “Company”) issued a press release announcing the completion of its acquisition of Spirit AeroSystems Holdings, Inc, a Delaware corporation. A copy of the Company’s press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information in this\nTEXT: Item 7.01, including the exhibit referenced herein, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”), nor shall it be deemed incorporated by reference in any Company filing under the Securities Act of 1933 or the Exchange Act, except as shall be expressly set forth by specific reference in such filing. The information in this\nTITLE: Item 9.01\nTEXT: Item 9.01. Financial Statements and Exhibits. ExhibitNumber Description99.1Press Release, dated December 8, 2025, issued by The Boeing Company104Cover Page Interactive Data File (embedded within the Inline XBRL document) ExhibitNumber Description99.1Press Release, dated December 8, 2025, issued by The Boeing Company104Cover Page Interactive Data File (embedded within the Inline XBRL document) ExhibitNumber Description99.1Press Release, dated December 8, 2025, issued by The Boeing Company104Cover Page Interactive Data File (embedded within the Inline XBRL document) ExhibitNumber Description 99.1Press Release, dated December 8, 2025, issued by The Boeing Company Press Release, dated December 8, 2025, issued by The Boeing Company Press Release, dated December 8, 2025, issued by The Boeing Company Press Release, dated December 8, 2025, issued by The Boeing Company , 2025, issued by The Boeing Company 104Cover Page Interactive Data File (embedded within the Inline XBRL document) Cover Page Interactive Data File (embedded within the Inline XBRL document) Cover Page Interactive Data File (embedded within the Inline XBRL document) Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, hereunto duly authorized. THE BOEING COMPANYBy:/s/ John C. DemersJohn C. DemersCorporate Secretary, Vice President & Assistant General CounselDated: December 8, 2025 THE BOEING COMPANYBy:/s/ John C. DemersJohn C. DemersCorporate Secretary, Vice President & Assistant General CounselDated: December 8, 2025 THE BOEING COMPANYBy:/s/ John C. DemersJohn C. DemersCorporate Secretary, Vice President & Assistant General CounselDated: December 8, 2025 By:/s/ John C. Demers Corporate Secretary, Vice President & Assistant General Counsel Corporate Secretary, Vice President & Assistant General Counsel Corporate Secretary, Vice President & Assistant General Counsel Dated: December 8, 2025 Dated: December 8, 2025 Dated: December 8, 2025\n"
  }
]