[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.02\nTEXT: Item 2.02 Results of Operations and Financial Condition. On October 29, 2025, The Boeing Company issued a press release reporting its financial results for the third quarter of 2025. A copy of the Company’s press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. On October 29, 2025, The Boeing Company issued a press release reporting its financial results for the third quarter of 2025. A copy of the Company’s press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K.\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. ExhibitNumber Description99.1Press Release issued by The Boeing Company dated October 29, 2025, reporting Boeing's financial results for the third quarter of 2025, furnished herewith.104Cover Page Interactive Data File (embedded within the Inline XBRL document) ExhibitNumber Description99.1Press Release issued by The Boeing Company dated October 29, 2025, reporting Boeing's financial results for the third quarter of 2025, furnished herewith.104Cover Page Interactive Data File (embedded within the Inline XBRL document) ExhibitNumber Description99.1Press Release issued by The Boeing Company dated October 29, 2025, reporting Boeing's financial results for the third quarter of 2025, furnished herewith.104Cover Page Interactive Data File (embedded within the Inline XBRL document) ExhibitNumber Description 99.1Press Release issued by The Boeing Company dated October 29, 2025, reporting Boeing's financial results for the third quarter of 2025, furnished herewith. Press Release issued by The Boeing Company dated October 29, 2025, reporting Boeing's financial results for the third quarter of 2025, furnished herewith. Press Release issued by The Boeing Company dated October 29, 2025, reporting Boeing's financial results for the third quarter of 2025, furnished herewith. Press Release issued by The Boeing Company dated October 29, 2025, reporting Boeing's financial results for the third quarter of 2025, furnished herewith. Press Release issued by The Boeing Company dated 29, 2025, reporting Boeing's financial results for the quarter of 2025, furnished herewith. 104Cover Page Interactive Data File (embedded within the Inline XBRL document) Cover Page Interactive Data File (embedded within the Inline XBRL document) Cover Page Interactive Data File (embedded within the Inline XBRL document) Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, hereunto duly authorized. THE BOEING COMPANY(Registrant)October 29, 2025/s/ Michael J. Cleary(Date)Michael J. ClearySenior Vice President and Controller THE BOEING COMPANY(Registrant)October 29, 2025/s/ Michael J. Cleary(Date)Michael J. ClearySenior Vice President and Controller THE BOEING COMPANY(Registrant)October 29, 2025/s/ Michael J. Cleary(Date)Michael J. ClearySenior Vice President and Controller October 29, 2025/s/ Michael J. Cleary /s/ Michael J. Cleary /s/ Michael J. Cleary (Date)Michael J. Cleary Senior Vice President and Controller Senior Vice President and Controller Senior Vice President and Controller\n"
  }
]