[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.02\nTEXT: Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On November 20, 2025, the Board of Directors (the “Board”) of Bank of America Corporation (the “Corporation”) designated certain members of management as “executive officers” of the Corporation, as that term is defined in Rule 3b-7 under the Securities Exchange Act of 1934, as amended. The Corporation’s executive officers are Brian T. Moynihan, Chair and Chief Executive Officer, and the following officers who report directly to Mr. Moynihan: • Dean C. Athanasia, Co-President • Alastair M. Borthwick, Executive Vice President and Chief Financial Officer • Sheri Bronstein, Chief People Officer • James P. DeMare, Co-President • Hari Gopalkrishnan, Chief Technology & Information Officer • Geoffrey S. Greener, Chief Risk Officer • Bernard A. Mensah, President, International • Lauren A. Mogensen, Global General Counsel • Thong Nguyen, Vice Chair, Head of Global Strategy & Enterprise Platforms • Thomas M. Scrivener, Chief Operations Executive • Bruce R. Thompson, Vice Chair, Head of Enterprise Credit On September 12, 2025, the Corporation announced the appointment of Dean C. Athanasia and James P. DeMare as Co-Presidents, with responsibility for the Corporation’s lines of business. Therefore, the Board has determined that effective December 31, 2025, the following members of management will no longer be designated as executive officers: Lindsay D. Hans, President, Co-Head Merrill Wealth Management; Kathleen A. Knox, President, The Private Bank; Matthew M. Koder, President, Global Corporate & Investment Banking (a named executive officer in the Corporation’s 2025 Proxy Statement); and Eric A. Schimpf, President, Co-Head Merrill Wealth Management.\nTEXT: Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On November 20, 2025, the Board of Directors (the “Board”) of Bank of America Corporation (the “Corporation”) designated certain members of management as “executive officers” of the Corporation, as that term is defined in Rule 3b-7 under the Securities Exchange Act of 1934, as amended. The Corporation’s executive officers are Brian T. Moynihan, Chair and Chief Executive Officer, and the following officers who report directly to Mr. Moynihan: • Dean C. Athanasia, Co-President • Dean C. Athanasia, Co-President • Dean C. Athanasia, Co-President Dean C. Athanasia, Co-President Dean C. Athanasia, Co-President • Alastair M. Borthwick, Executive Vice President and Chief Financial Officer • Alastair M. Borthwick, Executive Vice President and Chief Financial Officer • Alastair M. Borthwick, Executive Vice President and Chief Financial Officer Alastair M. Borthwick, Executive Vice President and Chief Financial Officer Alastair M. Borthwick, Executive Vice President and Chief Financial Officer Alastair M. Borthwick • Sheri Bronstein, Chief People Officer • Sheri Bronstein, Chief People Officer • Sheri Bronstein, Chief People Officer Sheri Bronstein, Chief People Officer Sheri Bronstein, Chief People Officer • James P. DeMare, Co-President • James P. DeMare, Co-President • James P. DeMare, Co-President James P. DeMare, Co-President James P. DeMare, Co-President • Hari Gopalkrishnan, Chief Technology & Information Officer • Hari Gopalkrishnan, Chief Technology & Information Officer • Hari Gopalkrishnan, Chief Technology & Information Officer Hari Gopalkrishnan, Chief Technology & Information Officer Hari Gopalkrishnan, Chief Technology & Information Officer • Geoffrey S. Greener, Chief Risk Officer • Geoffrey S. Greener, Chief Risk Officer • Geoffrey S. Greener, Chief Risk Officer Geoffrey S. Greener, Chief Risk Officer Geoffrey S. Greener, Chief Risk Officer • Bernard A. Mensah, President, International • Bernard A. Mensah, President, International • Bernard A. Mensah, President, International Bernard A. Mensah, President, International Bernard A. Mensah, President, International • Lauren A. Mogensen, Global General Counsel • Lauren A. Mogensen, Global General Counsel • Lauren A. Mogensen, Global General Counsel Lauren A. Mogensen, Global General Counsel Lauren A. Mogensen, Global General Counsel • Thong Nguyen, Vice Chair, Head of Global Strategy & Enterprise Platforms • Thong Nguyen, Vice Chair, Head of Global Strategy & Enterprise Platforms • Thong Nguyen, Vice Chair, Head of Global Strategy & Enterprise Platforms Thong Nguyen, Vice Chair, Head of Global Strategy & Enterprise Platforms Thong Nguyen, Vice Chair, Head of Global Strategy & Enterprise Platforms • Thomas M. Scrivener, Chief Operations Executive • Thomas M. Scrivener, Chief Operations Executive • Thomas M. Scrivener, Chief Operations Executive Thomas M. Scrivener, Chief Operations Executive Thomas M. Scrivener, Chief Operations Executive • Bruce R. Thompson, Vice Chair, Head of Enterprise Credit • Bruce R. Thompson, Vice Chair, Head of Enterprise Credit • Bruce R. Thompson, Vice Chair, Head of Enterprise Credit Bruce R. Thompson, Vice Chair, Head of Enterprise Credit Bruce R. Thompson, Vice Chair, Head of Enterprise Credit On September 12, 2025, the Corporation announced the appointment of Dean C. Athanasia and James P. DeMare as Co-Presidents, with responsibility for the Corporation’s lines of business. Therefore, the Board has determined that effective December 31, 2025, the following members of management will no longer be designated as executive officers: Lindsay D. Hans, President, Co-Head Merrill Wealth Management; Kathleen A. Knox, President, The Private Bank; Matthew M. Koder, President, Global Corporate & Investment Banking (a named executive officer in the Corporation’s 2025 Proxy Statement); and Eric A. Schimpf, President, Co-Head Merrill Wealth Management.\n"
  }
]