[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.02\nTEXT: ITEM 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. b) On December 8, 2025, Berkshire Hathaway Inc. (“Berkshire”) announced that Marc D. Hamburg, Berkshire’s Senior Vice President and Chief Financial Officer will retire from Berkshire on June 1, 2027. Mr. Hamburg will resign as Berkshire’s Chief Financial Officer on June 1, 2026 and work with his replacement from that date until his retirement on June 1, 2027 to ensure a smooth and seamless transition. c) On December 8, 2025, Berkshire announced that Mr. Charles C. Chang, age 57, will succeed Mr. Hamburg as Berkshire’s Senior Vice President and Chief Financial Officer on June 1, 2026. Mr. Chang has been Berkshire Hathaway Energy’s (“BHE”) Senior Vice President and Chief Financial Officer since joining BHE on October 1, 2024. Prior to joining BHE, Mr. Chang had been a partner at PricewaterhouseCoopers since 2002. There are no family relationships between Mr. Chang and any of Berkshire’s directors or executive officers. Since Mr. Chang joined BHE there have been no transactions between Mr. Chang and Berkshire in which the amount involved exceeded $120,000 and in which Mr. Chang had a material financial interest. The details regarding Mr. Chang’s compensation arrangements have not been finalized. Berkshire will disclose such information in an amendment to this Form 8-K once such information is finalized. On December 8, 2025, Berkshire issued a press release announcing certain leadership changes including the changes reported above. A copy of the press release is attached as Exhibit 99.1.\nTEXT: ITEM 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. b) On December 8, 2025, Berkshire Hathaway Inc. (“Berkshire”) announced that Marc D. Hamburg, Berkshire’s Senior Vice President and Chief Financial Officer will retire from Berkshire on June 1, 2027. Mr. Hamburg will resign as Berkshire’s Chief Financial Officer on June 1, 2026 and work with his replacement from that date until his retirement on June 1, 2027 to ensure a smooth and seamless transition. c) On December 8, 2025, Berkshire announced that Mr. Charles C. Chang, age 57, will succeed Mr. Hamburg as Berkshire’s Senior Vice President and Chief Financial Officer on June 1, 2026. Mr. Chang has been Berkshire Hathaway Energy’s (“BHE”) Senior Vice President and Chief Financial Officer since joining BHE on October 1, 2024. Prior to joining BHE, Mr. Chang had been a partner at PricewaterhouseCoopers since 2002. There are no family relationships between Mr. Chang and any of Berkshire’s directors or executive officers. Since Mr. Chang joined BHE there have been no transactions between Mr. Chang and Berkshire in which the amount involved exceeded $120,000 and in which Mr. Chang had a material financial interest. The details regarding Mr. Chang’s compensation arrangements have not been finalized. Berkshire will disclose such information in an amendment to this Form 8-K once such information is finalized. On December 8, 2025, Berkshire issued a press release announcing certain leadership changes including the changes reported above. A copy of the press release is attached as Exhibit 99.1.\nTITLE: Item 9.01\nTEXT: ITEM 9.01 Financial Statements and Exhibits Exhibit 99.1 Press release issued by Berkshire Hathaway Inc. dated December 8, 2025 Exhibit 104 Cover Page Interactive Data File (embedded within the Inline XBRL document).\nTEXT: ITEM 9.01 Financial Statements and Exhibits Financial Statements and Exhibits Financial Statements and Exhibits Exhibit 99.1 Press release issued by Berkshire Hathaway Inc. dated December 8, 2025 Exhibit 104 Cover Page Interactive Data File (embedded within the Inline XBRL document). Exhibit 99.1 Press release issued by Berkshire Hathaway Inc. dated December 8, 2025 Exhibit 104 Cover Page Interactive Data File (embedded within the Inline XBRL document). Exhibit 99.1 Press release issued by Berkshire Hathaway Inc. dated December 8, 2025 Exhibit 104 Cover Page Interactive Data File (embedded within the Inline XBRL document). Exhibit 99.1 Press release issued by Berkshire Hathaway Inc. dated December 8, 2025 Press release issued by Berkshire Hathaway Inc. dated December 8, 2025 Press release issued by Berkshire Hathaway Inc. dated December 8, 2025 Exhibit 104 Cover Page Interactive Data File (embedded within the Inline XBRL document). Cover Page Interactive Data File (embedded within the Inline XBRL document).\n"
  }
]