[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.03\nTEXT: Item 5.03Amendments to Articles of Incorporation or Bylaws; Change in Fiscal Year. Amendments to Articles of Incorporation or Bylaws; Change in Fiscal Year. Amendments to Articles of Incorporation or Bylaws; Change in Fiscal Year. Amendments to Articles of Incorporation or Bylaws; Change in Fiscal Year. On December 3, 2025, the Board of Directors (the “Board”) of Chevron Corporation (the “Corporation”) approved and adopted amended and restated By-Laws of the Corporation (the “By-Laws”), effective December 3, 2025. The following is a summary of the changes, all of which relate to simplifying Article II (titled “Officers”) to provide the Corporation with the flexibility to modernize officer titles and align officer title nomenclature with prevailing practice: On December 3, 2025, the Board of Directors (the “Board”) of Chevron Corporation (the “Corporation”) approved and adopted amended and restated By-Laws of the Corporation (the “By-Laws”), effective December 3, 2025. The following is a summary of the changes, all of which relate to simplifying Article II (titled “Officers”) to provide the Corporation with the flexibility to modernize officer titles and align officer title nomenclature with prevailing practice: •Amended Article II, Section 2, to (i) provide that the Corporation shall have, in addition to a Chief Executive Officer and a Secretary, such other officers as may be elected by the Board to hold such offices that are created by resolution of the Board or created as authorized by the Board; (ii) delete the creation of other specific officers; and (iii) provide that officers shall have such powers and perform such duties as may from time to time be granted or assigned by the By-Laws, the Board or, subject to the control of the Board, by a committee thereof or by the Executive Committee, or as may otherwise be in accordance with the direction of the Board. Amended Article II, Section 2, to (i) provide that the Corporation shall have, in addition to a Chief Executive Officer and a Secretary, such other officers as may be elected by the Board to hold such offices that are created by resolution of the Board or created as authorized by the Board; (ii) delete the creation of other specific officers; and (iii) provide that officers shall have such powers and perform such duties as may from time to time be granted or assigned by the By-Laws, the Board or, subject to the control of the Board, by a committee thereof or by the Executive Committee, or as may otherwise be in accordance with the direction of the Board. •Amended Article II, Sections 3 and 7, to delete the reference to the other powers and duties of the Chief Executive Officer and the Secretary, respectively, each of which was added to Article II, Section 2. Amended Article II, Sections 3 and 7, to delete the reference to the other powers and duties of the Chief Executive Officer and the Secretary, respectively, each of which was added to Article II, Section 2. •Deleted Article II, Sections 4 through 6 and Sections 8 through 13, referencing the creation of Vice President and Chief Financial Officer; Vice President and General Counsel; Executive Vice Presidents, Senior Vice Presidents, and Vice Presidents; Assistant Secretaries; Treasurer; Assistant Treasurers; Controller; General Tax Counsel; and Other Officers. Deleted Article II, Sections 4 through 6 and Sections 8 through 13, referencing the creation of Vice President and Chief Financial Officer; Vice President and General Counsel; Executive Vice Presidents, Senior Vice Presidents, and Vice Presidents; Assistant Secretaries; Treasurer; Assistant Treasurers; Controller; General Tax Counsel; and Other Officers. •Renumbered various sections in Article II to reflect these amendments. Renumbered various sections in Article II to reflect these amendments.\n"
  },
  {
    "cluster": 2,
    "content": "TITLE: Item 8.01\nTEXT: Item 8.01Other Events. On December 3, 2025, the Board approved an updated list of executive officers as set forth below. The updated list reflects the addition of two executive officers (as indicated below), as well as changes in certain officer titles to modernize and align them with prevailing practice. On December 3, 2025, the Board approved an updated list of executive officers as set forth below. The updated list reflects the addition of two executive officers (as indicated below), as well as changes in certain officer titles to modernize and align them with prevailing practice. Michael K. WirthChief Executive OfficerMark A. NelsonVice Chairman and Executive Vice President, Oil, Products & GasEimear P. BonnerChief Financial OfficerT. Ryder BoothChief Technology and Engineering OfficerJeffrey B. GustavsonPresident, New EnergiesRobert C. Neff, Jr.*President, UpstreamR. Hewitt PateChief Legal OfficerAndrew B. Walz*President, Downstream, Midstream and Chemicals* New appointment Michael K. WirthChief Executive OfficerMark A. NelsonVice Chairman and Executive Vice President, Oil, Products & GasEimear P. BonnerChief Financial OfficerT. Ryder BoothChief Technology and Engineering OfficerJeffrey B. GustavsonPresident, New EnergiesRobert C. Neff, Jr.*President, UpstreamR. Hewitt PateChief Legal OfficerAndrew B. Walz*President, Downstream, Midstream and Chemicals* New appointment Michael K. WirthChief Executive OfficerMark A. NelsonVice Chairman and Executive Vice President, Oil, Products & GasEimear P. BonnerChief Financial OfficerT. Ryder BoothChief Technology and Engineering OfficerJeffrey B. GustavsonPresident, New EnergiesRobert C. Neff, Jr.*President, UpstreamR. Hewitt PateChief Legal OfficerAndrew B. Walz*President, Downstream, Midstream and Chemicals* New appointment Michael K. WirthChief Executive Officer Chief Executive Officer Chief Executive Officer Mark A. NelsonVice Chairman and Executive Vice President, Oil, Products & Gas Vice Chairman and Executive Vice President, Oil, Products & Gas Vice Chairman and Executive Vice President, Oil, Products & Gas Eimear P. BonnerChief Financial Officer Chief Financial Officer Chief Financial Officer T. Ryder BoothChief Technology and Engineering Officer Chief Technology and Engineering Officer Chief Technology and Engineering Officer Jeffrey B. GustavsonPresident, New Energies President, New Energies President, New Energies Robert C. Neff, Jr.*President, Upstream R. Hewitt PateChief Legal Officer Andrew B. Walz*President, Downstream, Midstream and Chemicals President, Downstream, Midstream and Chemicals President, Downstream, Midstream and Chemicals\nTITLE: Item 9.01\nTEXT: Item 9.01Financial Statements and Exhibits. Financial Statements and Exhibits. Financial Statements and Exhibits. Financial Statements and Exhibits. Exhibit NumberDescription3.2By-Laws of Chevron Corporation, as amended and restated December 3, 2025.104Cover Page Interactive Data File, formatted in Inline XBRL. Exhibit NumberDescription3.2By-Laws of Chevron Corporation, as amended and restated December 3, 2025.104Cover Page Interactive Data File, formatted in Inline XBRL. Exhibit NumberDescription3.2By-Laws of Chevron Corporation, as amended and restated December 3, 2025.104Cover Page Interactive Data File, formatted in Inline XBRL. Exhibit NumberDescription 3.2By-Laws of Chevron Corporation, as amended and restated December 3, 2025. By-Laws of Chevron Corporation, as amended and restated December 3, 2025. By-Laws of Chevron Corporation, as amended and restated December 3, 2025. By-Laws of Chevron Corporation, as amended and restated December 3, 2025. By-Laws of Chevron Corporation, as amended and restated December 104Cover Page Interactive Data File, formatted in Inline XBRL. Cover Page Interactive Data File, formatted in Inline XBRL. Cover Page Interactive Data File, formatted in Inline XBRL. Cover Page Interactive Data File, formatted in Inline XBRL. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Dated: December 5, 2025 Dated: December 5, 2025 CHEVRON CORPORATIONBy:/s/ Christopher A. ButnerChristopher A. ButnerAssistant Secretary and Senior Counsel CHEVRON CORPORATIONBy:/s/ Christopher A. ButnerChristopher A. ButnerAssistant Secretary and Senior Counsel CHEVRON CORPORATIONBy:/s/ Christopher A. ButnerChristopher A. ButnerAssistant Secretary and Senior Counsel By:/s/ Christopher A. Butner /s/ Christopher A. Butner /s/ Christopher A. Butner /s/ Christopher A. Butner Christopher A. Butner Christopher A. Butner Christopher A. Butner Christopher A. Butner Assistant Secretary and Senior Counsel Assistant Secretary and Senior Counsel Assistant Secretary and Senior Counsel Assistant Secretary and Senior Counsel\n"
  }
]