[
  {
    "cluster": 1,
    "content": "TITLE: Item 7.01\nTEXT: Item 7.01 Regulation FD Disclosure On September 25, 2025, Chevron Corporation (“Chevron” or “the Company”) reported current estimates of relevant factors that could impact its financial results for third quarter 2025. On September 25, 2025, Chevron Corporation (“Chevron” or “the Company”) reported current estimates of relevant factors that could impact its financial results for third quarter 2025. Estimated impacts from the Hess Corporation (“Hess”) acquisition (July 1 - September 30, 2025): Estimated impacts from the Hess Corporation (“Hess”) acquisition (July 1 - September 30, 2025): In third quarter 2025, Hess-related impacts on the Company’s earnings are estimated to be a loss of $(200) to $(400) million. Excluding severance and other costs related to the transaction, Hess-related impacts on the Company’s adjusted earnings in third quarter 2025 are estimated to be $50 to $150 million. Additional details are provided in the table below: In third quarter 2025, Hess-related impacts on the Company’s earnings are estimated to be a loss of $(200) to $(400) million. Excluding severance and other costs related to the transaction, Hess-related impacts on the Company’s adjusted earnings in third quarter 2025 are estimated to be $50 to $150 million. Additional details are provided in the table below: Unit3Q 2025OutlookCommentsAdjusted earnings (loss), after-tax1$ MM$50 - 150After-tax loss of $(200)-(400), adjusted to exclude severance and other transaction costs of $(350)-(450)Depreciation, depletion and amortization, pre-tax$ B$1.2 - 1.4Legacy Hess & purchase price allocation impactsNet oil-equivalent production2MBOED450 - 500Includes downtimeCapital expenditures$ B$1.0 - 1.25Proceeds and deposits related to asset sales$ MM$410Malaysia/Thailand JDA asset sale1 Non-GAAP financial measure as defined below.2 Excludes volumes received under percentage of proceeds contracts in the Bakken. Unit3Q 2025OutlookCommentsAdjusted earnings (loss), after-tax1$ MM$50 - 150After-tax loss of $(200)-(400), adjusted to exclude severance and other transaction costs of $(350)-(450)Depreciation, depletion and amortization, pre-tax$ B$1.2 - 1.4Legacy Hess & purchase price allocation impactsNet oil-equivalent production2MBOED450 - 500Includes downtimeCapital expenditures$ B$1.0 - 1.25Proceeds and deposits related to asset sales$ MM$410Malaysia/Thailand JDA asset sale1 Non-GAAP financial measure as defined below.2 Excludes volumes received under percentage of proceeds contracts in the Bakken. Unit3Q 2025OutlookCommentsAdjusted earnings (loss), after-tax1$ MM$50 - 150After-tax loss of $(200)-(400), adjusted to exclude severance and other transaction costs of $(350)-(450)Depreciation, depletion and amortization, pre-tax$ B$1.2 - 1.4Legacy Hess & purchase price allocation impactsNet oil-equivalent production2MBOED450 - 500Includes downtimeCapital expenditures$ B$1.0 - 1.25Proceeds and deposits related to asset sales$ MM$410Malaysia/Thailand JDA asset sale1 Non-GAAP financial measure as defined below.2 Excludes volumes received under percentage of proceeds contracts in the Bakken. Unit3Q 2025OutlookComments Adjusted earnings (loss), after-tax1$ MM$50 - 150After-tax loss of $(200)-(400), adjusted to exclude severance and other transaction costs of $(350)-(450) Adjusted earnings (loss), after-tax1 Adjusted earnings (loss), after-tax1 Adjusted earnings (loss), after-tax After-tax loss of $(200)-(400), adjusted to exclude severance and other transaction costs of $(350)-(450) After-tax loss of $(200)-(400), adjusted to exclude severance and other transaction costs of $(350)-(450) Depreciation, depletion and amortization, pre-tax$ B$1.2 - 1.4Legacy Hess & purchase price allocation impacts Depreciation, depletion and amortization, pre-tax Depreciation, depletion and amortization, pre-tax Legacy Hess & purchase price allocation impacts Legacy Hess & purchase price allocation impacts Net oil-equivalent production2MBOED450 - 500Includes downtime Net oil-equivalent production2 Net oil-equivalent production2 Net oil-equivalent production Capital expenditures$ B$1.0 - 1.25 Proceeds and deposits related to asset sales$ MM$410Malaysia/Thailand JDA asset sale Proceeds and deposits related to asset sales Proceeds and deposits related to asset sales Malaysia/Thailand JDA asset sale Malaysia/Thailand JDA asset sale 1 Non-GAAP financial measure as defined below. 1 Non-GAAP financial measure as defined below. 1 Non-GAAP financial measure as defined below. Non-GAAP financial measure as defined below. 2 Excludes volumes received under percentage of proceeds contracts in the Bakken. 2 Excludes volumes received under percentage of proceeds contracts in the Bakken. 2 Excludes volumes received under percentage of proceeds contracts in the Bakken. Excludes volumes received under percentage of proceeds contracts in the Bakken. The Company expects to realize synergies from the Hess transaction in future quarterly earnings. Approximately half of the cash outflows associated with the severance and other transaction costs related to the Hess acquisition are expected to occur in third quarter 2025, and the remainder is expected within the next 12 months. Overall, the Company expects a working capital outflow of $0.5 to $1.5 billion in third quarter 2025. The Company expects to realize synergies from the Hess transaction in future quarterly earnings. Approximately half of the cash outflows associated with the severance and other transaction costs related to the Hess acquisition are expected to occur in third quarter 2025, and the remainder is expected within the next 12 months. Overall, the Company expects a working capital outflow of $0.5 to $1.5 billion in third quarter 2025. In addition, the Company expects to have approximately 2 billion shares of common stock outstanding at September 30, 2025, and approximately 1.95 billion weighted average shares outstanding during third quarter 2025. In addition, the Company expects to have approximately 2 billion shares of common stock outstanding at September 30, 2025, and approximately 1.95 billion weighted average shares outstanding during third quarter 2025. The preliminary financial information presented is an estimate based on information available to management as of the date of this filing and has not been reviewed by the Company’s independent registered accounting firm. The preliminary financial information presented is not to be considered comprehensive of all items that could impact Chevron’s financial results for the quarter, which will be reported on or around October 31, 2025, and is subject to adjustments or changes pending the finalization of the Company’s financial reporting process. It is possible that the financial impact of these items may differ from the estimates provided, including differences due to final accounting determinations, changes in facts, circumstances or assumptions or other developments in the interim. Our “Sensitivities and Forward Guidance” document that provides consolidated guidance and sensitivities is available on chevron.com/investors/events-presentations. The preliminary financial information presented is an estimate based on information available to management as of the date of this filing and has not been reviewed by the Company’s independent registered accounting firm. The preliminary financial information presented is not to be considered comprehensive of all items that could impact Chevron’s financial results for the quarter, which will be reported on or around October 31, 2025, and is subject to adjustments or changes pending the finalization of the Company’s financial reporting process. It is possible that the financial impact of these items may differ from the estimates provided, including differences due to final accounting determinations, changes in facts, circumstances or assumptions or other developments in the interim. Our “Sensitivities and Forward Guidance” document that provides consolidated guidance and sensitivities is available on chevron.com/investors/events-presentations. The information included herein shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any Company filing under the Securities Act of 1933 or the Securities Exchange Act of 1934. Website references provided in this report are provided for convenience only, and the content on the referenced website is not incorporated by reference into this report. The information included herein shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any Company filing under the Securities Act of 1933 or the Securities Exchange Act of 1934. Website references provided in this report are provided for convenience only, and the content on the referenced website is not incorporated by reference into this report. As used in this report, terms such as “the Company,” “Chevron,” “we,” “its” and “our” may refer to Chevron Corporation, one or more of its consolidated subsidiaries, or to all of them taken as a whole. All of these terms are used for convenience only and are not intended as a precise description of any of the separate companies, each of which manages its own affairs. As used in this report, terms such as “the Company,” “Chevron,” “we,” “its” and “our” may refer to Chevron Corporation, one or more of its consolidated subsidiaries, or to all of them taken as a whole. All of these terms are used for convenience only and are not intended as a precise description of any of the separate companies, each of which manages its own affairs. Non-GAAP Financial Measure - This report includes a reference to adjusted earnings/(loss), which reflect earnings or losses excluding significant non-operational items including impairment charges, write-offs, severance costs, Hess Corporation acquisition costs, gains on asset sales, unusual tax items, effects of pension settlements and curtailments, foreign currency effects and other special items. We believe it is useful for investors to consider adjusted earnings in comparing the underlying performance of our business across periods. This additional information is not meant to be considered in isolation or as a substitute for net income (loss) as prepared in accordance with U.S. GAAP. Non-GAAP Financial Measure - This report includes a reference to adjusted earnings/(loss), which reflect earnings or losses excluding significant non-operational items including impairment charges, write-offs, severance costs, Hess Corporation acquisition costs, gains on asset sales, unusual tax items, effects of pension settlements and curtailments, foreign currency effects and other special items. We believe it is useful for investors to consider adjusted earnings in comparing the underlying performance of our business across periods. This additional information is not meant to be considered in isolation or as a substitute for net income (loss) as prepared in accordance with U.S. GAAP. CAUTIONARY STATEMENTS RELEVANT TO FORWARD-LOOKING INFORMATION FOR THE PURPOSE OF “SAFE HARBOR” PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995 CAUTIONARY STATEMENTS RELEVANT TO FORWARD-LOOKING INFORMATION FOR THE PURPOSE OF “SAFE HARBOR” PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995 This report of Chevron Corporation contains forward-looking statements relating to Chevron’s operations, assets and strategy that are based on management’s current expectations, estimates, and projections about the petroleum, chemicals, and other energy-related industries. Words or phrases such as “anticipates,” “expects,” “intends,” “plans,” “targets,” “advances,” “commits,” “drives,” “aims,” “forecasts,” “projects,” “believes,” “approaches,” “seeks,” “schedules,” “estimates,” “positions,” “pursues,” “progress,” “design,” “enable,” “may,” “can,” “could,” “should,” “will,” “budgets,” “outlook,” “trends,” “guidance,” “focus,” “on track,” “trajectory,” “goals,” “objectives,” “strategies,” “opportunities,” “poised,” “potential,” “ambitions,” “future,” “aspires” and similar expressions, and variations or negatives of these words, are intended to identify such forward-looking statements, but not all forward-looking statements include such words. These statements are not guarantees of future performance and are subject to numerous risks, uncertainties and other factors, many of which are beyond the company’s control and are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. The reader should not place undue reliance on these forward-looking statements, which speak only as of the date of this report. Unless legally required, Chevron undertakes no obligation to update publicly any forward-looking statements, whether as a result of new information, future events or otherwise. This report of Chevron Corporation contains forward-looking statements relating to Chevron’s operations, assets and strategy that are based on management’s current expectations, estimates, and projections about the petroleum, chemicals, and other energy-related industries. Words or phrases such as “anticipates,” “expects,” “intends,” “plans,” “targets,” “advances,” “commits,” “drives,” “aims,” “forecasts,” “projects,” “believes,” “approaches,” “seeks,” “schedules,” “estimates,” “positions,” “pursues,” “progress,” “design,” “enable,” “may,” “can,” “could,” “should,” “will,” “budgets,” “outlook,” “trends,” “guidance,” “focus,” “on track,” “trajectory,” “goals,” “objectives,” “strategies,” “opportunities,” “poised,” “potential,” “ambitions,” “future,” “aspires” and similar expressions, and variations or negatives of these words, are intended to identify such forward-looking statements, but not all forward-looking statements include such words. These statements are not guarantees of future performance and are subject to numerous risks, uncertainties and other factors, many of which are beyond the company’s control and are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. The reader should not place undue reliance on these forward-looking statements, which speak only as of the date of this report. Unless legally required, Chevron undertakes no obligation to update publicly any forward-looking statements, whether as a result of new information, future events or otherwise. Among the important factors that could cause actual results to differ materially from those in the forward-looking statements are: changing crude oil and natural gas prices and demand for the company’s products, and production curtailments due to market conditions; crude oil production quotas or other actions that might be imposed by the Organization of Petroleum Exporting Countries and other producing countries; technological advancements; changes to government policies in the countries in which the company operates; public health crises, such as pandemics and epidemics, and any related government policies and actions; disruptions in the company’s global supply chain, including supply chain constraints and escalation of the cost of goods and services; changing economic, regulatory and political environments in the various countries in which the company operates; general domestic and international economic, market and political conditions, including the conflict between Russia and Ukraine, the conflict in the Middle East and the global response to these hostilities; changing refining, marketing and chemicals margins; the company’s ability to realize anticipated cost savings and efficiencies associated with enterprise structural cost reduction initiatives; actions of competitors or regulators; timing of exploration expenses; changes in projected future cash flows; timing of crude oil liftings; uncertainties about the estimated quantities of crude oil, natural gas liquids and natural gas reserves; the competitiveness of alternate-energy sources or product substitutes; pace and scale of the development of large carbon capture and offset markets; the results of operations and financial condition of the company’s suppliers, vendors, partners and equity affiliates; the inability or failure of the company’s joint-venture partners to fund their share of operations and development activities; the potential failure to achieve expected net production from existing and future crude oil and natural gas development projects; potential delays in the development, construction or start-up of planned projects; the potential disruption or interruption of the company’s operations due to war, accidents, political events, civil unrest, severe weather, cyber threats, terrorist acts, or other natural or human causes beyond the company’s control; the potential liability for remedial actions or assessments under existing or future environmental regulations and litigation; significant operational, investment or product changes undertaken or required by existing or future environmental statutes and regulations, including international agreements and national or regional legislation and regulatory measures related to greenhouse gas emissions and climate change; the potential liability resulting from pending or future litigation; the company’s ability to successfully integrate the operations of the company and Hess Corporation and achieve the anticipated benefits and projected synergies from the transaction; the company’s future acquisitions or dispositions of assets or shares or the delay or failure of such transactions to close based on required closing conditions; the potential for gains and losses from asset dispositions or impairments; government mandated sales, divestitures, recapitalizations, taxes and tax audits, tariffs, sanctions, changes in fiscal terms or restrictions on scope of company operations; foreign currency movements compared with the U.S. dollar; higher inflation and related impacts; material reductions in corporate liquidity and access to debt markets; changes to the company’s capital allocation strategies; the effects of changed accounting rules under generally accepted accounting principles promulgated by rule-setting bodies; the company’s ability to identify and mitigate the risks and hazards inherent in operating in the global energy industry; and the factors set forth under the heading “Risk Factors” on pages 20 through 27 of the company’s 2024 Annual Report on Form 10-K and in subsequent filings with the U.S. Securities and Exchange Commission. Other unpredictable or unknown factors not discussed in this report could also have material adverse effects on forward-looking statements. Among the important factors that could cause actual results to differ materially from those in the forward-looking statements are: changing crude oil and natural gas prices and demand for the company’s products, and production curtailments due to market conditions; crude oil production quotas or other actions that might be imposed by the Organization of Petroleum Exporting Countries and other producing countries; technological advancements; changes to government policies in the countries in which the company operates; public health crises, such as pandemics and epidemics, and any related government policies and actions; disruptions in the company’s global supply chain, including supply chain constraints and escalation of the cost of goods and services; changing economic, regulatory and political environments in the various countries in which the company operates; general domestic and international economic, market and political conditions, including the conflict between Russia and Ukraine, the conflict in the Middle East and the global response to these hostilities; changing refining, marketing and chemicals margins; the company’s ability to realize anticipated cost savings and efficiencies associated with enterprise structural cost reduction initiatives; actions of competitors or regulators; timing of exploration expenses; changes in projected future cash flows; timing of crude oil liftings; uncertainties about the estimated quantities of crude oil, natural gas liquids and natural gas reserves; the competitiveness of alternate-energy sources or product substitutes; pace and scale of the development of large carbon capture and offset markets; the results of operations and financial condition of the company’s suppliers, vendors, partners and equity affiliates; the inability or failure of the company’s joint-venture partners to fund their share of operations and development activities; the potential failure to achieve expected net production from existing and future crude oil and natural gas development projects; potential delays in the development, construction or start-up of planned projects; the potential disruption or interruption of the company’s operations due to war, accidents, political events, civil unrest, severe weather, cyber threats, terrorist acts, or other natural or human causes beyond the company’s control; the potential liability for remedial actions or assessments under existing or future environmental regulations and litigation; significant operational, investment or product changes undertaken or required by existing or future environmental statutes and regulations, including international agreements and national or regional legislation and regulatory measures related to greenhouse gas emissions and climate change; the potential liability resulting from pending or future litigation; the company’s ability to successfully integrate the operations of the company and Hess Corporation and achieve the anticipated benefits and projected synergies from the transaction; the company’s future acquisitions or dispositions of assets or shares or the delay or failure of such transactions to close based on required closing conditions; the potential for gains and losses from asset dispositions or impairments; government mandated sales, divestitures, recapitalizations, taxes and tax audits, tariffs, sanctions, changes in fiscal terms or restrictions on scope of company operations; foreign currency movements compared with the U.S. dollar; higher inflation and related impacts; material reductions in corporate liquidity and access to debt markets; changes to the company’s capital allocation strategies; the effects of changed accounting rules under generally accepted accounting principles promulgated by rule-setting bodies; the company’s ability to identify and mitigate the risks and hazards inherent in operating in the global energy industry; and the factors set forth under the heading “Risk Factors” on pages 20 through 27 of the company’s 2024 Annual Report on Form 10-K and in subsequent filings with the U.S. Securities and Exchange Commission. Other unpredictable or unknown factors not discussed in this report could also have material adverse effects on forward-looking statements. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Dated: September 25, 2025 Dated: September 25, 2025 CHEVRON CORPORATIONBy/s/ Alana K. KnowlesAlana K. KnowlesVice President and Controller(Principal Accounting Officer andDuly Authorized Officer) CHEVRON CORPORATIONBy/s/ Alana K. KnowlesAlana K. KnowlesVice President and Controller(Principal Accounting Officer andDuly Authorized Officer) CHEVRON CORPORATIONBy/s/ Alana K. KnowlesAlana K. KnowlesVice President and Controller(Principal Accounting Officer andDuly Authorized Officer) By/s/ Alana K. Knowles Vice President and Controller Vice President and Controller Vice President and Controller (Principal Accounting Officer and (Principal Accounting Officer and (Principal Accounting Officer and Duly Authorized Officer) Duly Authorized Officer) Duly Authorized Officer)\n"
  }
]