[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.02\nTEXT: Item 5.02Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On October 29, 2025, in anticipation of her expected retirement from Chevron Corporation (“Chevron”) in April 2026, Alana K. Knowles elected to resign from her position as Controller of Chevron, effective February 28, 2026. (b) On October 29, 2025, in anticipation of her expected retirement from Chevron Corporation (“Chevron”) in April 2026, Alana K. Knowles elected to resign from her position as Controller of Chevron, effective February 28, 2026. (c) On October 29, 2025, the Board of Directors of Chevron elected Amit R. Ghai to the position of Controller of Chevron, effective March 1, 2026. In this role, Mr. Ghai will serve as Chevron’s principal accounting officer. (c) On October 29, 2025, the Board of Directors of Chevron elected Amit R. Ghai to the position of Controller of Chevron, effective March 1, 2026. In this role, Mr. Ghai will serve as Chevron’s principal accounting officer. Mr. Ghai, age 53, has held positions with Chevron and its subsidiaries since 2004, and currently serves as Assistant Controller, a position he has held since October 2020. Prior to that, he served as Controller, Downstream & Chemicals, from July 2019 through October 2020, and as General Manager, Finance, Supply and Trading, from June 2016 through July 2019. Prior to these roles, Mr. Ghai held numerous positions of increasing responsibility in the areas of finance, accounting, and treasury. Mr. Ghai, age 53, has held positions with Chevron and its subsidiaries since 2004, and currently serves as Assistant Controller, a position he has held since October 2020. Prior to that, he served as Controller, Downstream & Chemicals, from July 2019 through October 2020, and as General Manager, Finance, Supply and Trading, from June 2016 through July 2019. Prior to these roles, Mr. Ghai held numerous positions of increasing responsibility in the areas of finance, accounting, and treasury. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Dated: November 3, 2025 Dated: November 3, 2025 CHEVRON CORPORATIONBy:/s/ Christine L. CavalloChristine L. CavalloAssistant Secretary CHEVRON CORPORATIONBy:/s/ Christine L. CavalloChristine L. CavalloAssistant Secretary CHEVRON CORPORATIONBy:/s/ Christine L. CavalloChristine L. CavalloAssistant Secretary By:/s/ Christine L. Cavallo /s/ Christine L. Cavallo /s/ Christine L. Cavallo /s/ Christine L. Cavallo\n"
  }
]