[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.02\nTEXT: Item 2.02 Results of Operations and Financial Condition On October 31, 2025, Chevron Corporation (the “Company”) issued a news release announcing unaudited third quarter 2025 earnings of $3.5 billion. The news release is attached hereto as Exhibit 99.1 and incorporated herein by reference. On October 31, 2025, Chevron Corporation (the “Company”) issued a news release announcing unaudited third quarter 2025 earnings of $3.5 billion. The news release is attached hereto as Exhibit 99.1 and incorporated herein by reference. The information included herein and in Exhibit 99.1 shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended. The information included herein and in Exhibit 99.1 shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended.\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. Exhibit NumberDescription 99.1News release issued by Chevron Corporation, dated October 31, 2025.104Cover Page Interactive Data File (contained in Exhibit 101) Exhibit NumberDescription 99.1News release issued by Chevron Corporation, dated October 31, 2025.104Cover Page Interactive Data File (contained in Exhibit 101) Exhibit NumberDescription 99.1News release issued by Chevron Corporation, dated October 31, 2025.104Cover Page Interactive Data File (contained in Exhibit 101) Exhibit NumberDescription 99.1News release issued by Chevron Corporation, dated October 31, 2025. News release issued by Chevron Corporation, dated October 31, 2025. News release issued by Chevron Corporation, dated October 31, 2025. News release issued by Chevron Corporation, dated October 31, 2025. News release issued by Chevron Corporation, dated October 31, 2025. 104Cover Page Interactive Data File (contained in Exhibit 101) Cover Page Interactive Data File (contained in Exhibit 101) Cover Page Interactive Data File (contained in Exhibit 101) Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Dated: October 31, 2025 Dated: October 31, 2025 CHEVRON CORPORATIONBy/s/ Alana K. KnowlesAlana K. KnowlesVice President and Controller(Principal Accounting Officer andDuly Authorized Officer) CHEVRON CORPORATIONBy/s/ Alana K. KnowlesAlana K. KnowlesVice President and Controller(Principal Accounting Officer andDuly Authorized Officer) CHEVRON CORPORATIONBy/s/ Alana K. KnowlesAlana K. KnowlesVice President and Controller(Principal Accounting Officer andDuly Authorized Officer) By/s/ Alana K. Knowles Vice President and Controller Vice President and Controller Vice President and Controller (Principal Accounting Officer and (Principal Accounting Officer and (Principal Accounting Officer and Duly Authorized Officer) Duly Authorized Officer) Duly Authorized Officer)\n"
  }
]