{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenues, results, continue, affect, advertising, google, products, these, markets, item\n\nTEXT: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nTEXT: Please read the following discussion and analysis of our financial condition and results of operations together with “Note about Forward-Looking Statements,” Part I, Item 1 \"Business,\" Part I, Item 1A \"Risk Factors,\" and our consolidated financial statements and related notes included under Item 8 of this Annual Report on Form 10-K.\nTEXT: The following section generally discusses 2023 results compared to 2022 results. Discussion of 2022 results compared to 2021 results to the extent not included in this report can be found in Item 7 of our 2022 Annual Report on Form 10-K.\nTITLE: Understanding Alphabet’s Financial Results\nTEXT: Alphabet is a collection of businesses — the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For additional information on our segments, see Part I, Item 1 Business and Note 15 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Trends in Our Business and Financial Effect\nTEXT: The following long-term trends have contributed to the results of our consolidated operations, and we anticipate that they will continue to affect our future results:\nTITLE: •Users' behaviors and advertising continue to shift online as the digital economy evolves.\nTEXT: The continuing evolution of the online world has contributed to the growth of our business and our revenues since inception. We expect that this evolution will continue to benefit our business and our revenues, although at a slower pace than we have experienced historically, in particular after the outsized growth in our advertising revenues during the COVID-19 pandemic. In addition, we face increasing competition for user engagement and advertisers, which may affect our revenues.\nTEXT: •Users continue to access our products and services using diverse devices and modalities, which allows for new advertising formats that may benefit our revenues but adversely affect our margins.\nTEXT: Our users are accessing our products and services via diverse devices and modalities, such as smartphones, wearables, connected TVs, and smart home devices, and want to be able to be connected no matter where they are or what they are doing. We are focused on expanding our products and services to stay in front of these trends in order to maintain and grow our business.\nTEXT: We benefit from advertising revenues generated from different channels, including mobile, and newer advertising formats. The margins from these channels and newer products have generally been lower than those from traditional desktop search. Additionally, as the market for a particular device type or modality matures, our advertising revenues may be affected. For example, changing dynamics within the global smartphone market, such as increased market saturation in developed countries, can affect our mobile advertising revenues.\nTEXT: We expect TAC paid to our distribution partners and Google Network partners to increase as our revenues grow and TAC as a percentage of our advertising revenues (\"TAC rate\") to be affected by changes in device mix; geographic mix; partner agreement terms; partner mix; the percentage of queries channeled through paid access points; product mix; the relative revenue growth rates of advertising revenues from different channels; and revenue share terms.\nTEXT: We expect these trends to continue to affect our revenues and put pressure on our margins.\nTITLE: •As online advertising evolves, we continue to expand our product offerings, which may affect our monetization.\nTEXT: As interactions between users and advertisers change, and as online user behavior evolves, we continue to expand our product offerings to serve these changing needs, which may affect our monetization. For example, revenues from ads on YouTube and Google Play monetize at a lower rate than our traditional search ads. We also expect to continue to incorporate AI innovations into our products, such as AI in Search, that could affect our monetization trends. When developing new products and services we generally focus first on user experience and then on monetization.\nTEXT: •As users in developing economies increasingly come online, our revenues from international markets continue to increase, and may require continued investments. In addition, movements in foreign exchange rates affect such revenues.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: The shift to online, as well as the advent of the multi-device world, has brought opportunities outside of the U.S., including in emerging markets, such as India. We continue to invest heavily and develop localized versions of our products and advertising programs relevant to our users in these markets. This has led to a trend of increased revenues from emerging markets. We expect that our results will continue to be affected by our performance in these markets, particularly as low-cost mobile devices become more available. This trend could affect our revenues as developing markets initially monetize at a lower rate than more mature markets.\nTEXT: International revenues represent a significant portion of our revenues and are subject to fluctuations in foreign currency exchange rates relative to the U.S. dollar. While we have a foreign exchange risk management program designed to reduce our exposure to these fluctuations, this program does not fully offset their effect on our revenues and earnings.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenues, continue, business, other, services, advertising, products, platforms, devices, regulatory\n\nTITLE: •The revenues that we derive beyond advertising are increasing and may adversely affect our margins.\nTEXT: Revenues from cloud, consumer subscriptions, platforms, and devices, which may have differing characteristics than our advertising revenues, have grown over time, and we expect this trend to continue as we focus on expanding our products and services. The margins on these revenues vary significantly and are generally lower than the margins on our advertising revenues. For example, sales of our devices adversely affect our consolidated margins due to pressures on pricing and higher cost of sales.\nTEXT: •As we continue to serve our users and expand our businesses, we will invest heavily in operating and capital expenditures.\nTEXT: We continue to make significant research and development investments in areas of strategic focus as we seek to develop new, innovative offerings, improve our existing offerings, and rapidly and responsibly deploy AI across our businesses. We also expect to increase, relative to 2023, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. In addition, acquisitions and strategic investments contribute to the breadth and depth of our offerings, expand our expertise in engineering and other functional areas, and build strong partnerships around strategic initiatives.\nTEXT: •We continue to face an evolving regulatory environment, and we are subject to claims, lawsuits, investigations, and other forms of potential legal liability, which could affect our business practices and financial results.\nTEXT: Changes in social, political, economic, tax, and regulatory conditions or in laws and policies governing a wide range of topics and related legal matters, including investigations, lawsuits, and regulatory actions, have resulted in fines and caused us to change our business practices. As these global trends continue, our cost of doing business may increase, our ability to pursue certain business models or offer certain products or services may be limited, and we may need to change our business practices to comply with evolving regulatory and legal matters. Examples include the antitrust complaints filed by the U.S. Department of Justice and a number of state Attorneys General; legislative proposals and pending litigation in the U.S., EU, and around the world that could diminish or eliminate safe harbor protection for websites and online platforms; and the Digital Markets Act and Digital Services Act in Europe and various legislative proposals in the U.S. focused on large technology platforms. For additional information, see Item 1A Risk Factors and Legal Matters in Note 10 of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nTITLE: •Our employees are critical to our success and we expect to continue investing in them.\nTEXT: Our employees are among our best assets and are critical for our continued success. We expect to continue hiring talented employees around the globe and to provide competitive compensation programs. For additional information, see Culture and Workforce in Part I, Item 1 Business of this Annual Report on Form 10-K.\nTITLE: Revenues and Monetization Metrics\nTEXT: We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure and platform services as well as communication and collaboration tools; sales of other products and services, such as apps and in-app purchases, and devices; and fees received for consumer subscription-based products. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTEXT: In addition to the long-term trends and their financial effect on our business discussed above, fluctuations in our revenues have been, and may continue to be, affected by a combination of general factors, including:\nTEXT: •changes in foreign currency exchange rates;\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: •changes in pricing, such as those resulting from changes in fee structures, discounts, and customer incentives;\nTEXT: •general economic conditions and various external dynamics, including geopolitical events, regulations, and other measures and their effect on advertiser, consumer, and enterprise spending;\nTEXT: •new product and service launches; and\nTEXT: Additionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), revenues from other sources (\"Google subscriptions, platforms, and devices revenues\"), Google Cloud, and Other Bets revenues have been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ngoogle, revenues, properties, cost, subscriptions, search, other, which, such, services\n\nTITLE: Google Services\nTEXT: Google Services revenues consist of Google advertising as well as Google subscriptions, platforms, and devices revenues.\nTEXT: Google advertising revenues are comprised of the following:\nTEXT: •Google Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play;\nTEXT: •YouTube ads, which includes revenues generated on YouTube properties; and\nTEXT: •Google Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager.\nTEXT: We use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties.\nTEXT: Paid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users.\nTEXT: Impressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users.\nTEXT: As our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity.\nTEXT: Fluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been, and may continue to be, affected by factors in addition to the general factors described above, such as:\nTEXT: •advertiser competition for keywords;\nTEXT: •changes in advertising quality, formats, delivery or policy;\nTEXT: •seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and\nTEXT: •traffic growth in emerging markets compared to more mature markets and across various verticals and channels.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: Google Subscriptions, Platforms, and Devices\nTEXT: Google subscriptions, platforms, and devices revenues are comprised of the following:\nTEXT: •consumer subscriptions, which primarily include revenues from YouTube services, such YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\nTITLE: •platforms, which primarily include revenues from Google Play from the sales of apps and in-app purchases;\nTEXT: •devices, which primarily include sales of the Pixel family of devices; and\nTEXT: Fluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand, number of subscribers, and fluctuations in the timing of product launches.\nTITLE: Google Cloud\nTEXT: Google Cloud revenues are comprised of the following:\nTEXT: •Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as cybersecurity, databases, analytics, and AI offerings including our AI infrastructure, Vertex AI platform, and Duet AI for Google Cloud;\nTEXT: •Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Duet AI in Google Workspace; and\nTEXT: Fluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as customer usage.\nTITLE: Other Bets\nTEXT: Revenues from Other Bets are generated primarily from the sale of healthcare-related services and internet services.\nTITLE: Costs and Expenses\nTEXT: Our cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in compensation expenses may not directly correlate with changes in headcount, in particular due to annual stock-based compensation (SBC) awards that generally vest over four years.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenues, other, expenses, services, income, google, related, content, support, partners\n\nTITLE: Cost of Revenues\nTEXT: Cost of revenues is comprised of TAC and other costs of revenues.\nTEXT: ◦amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and\nTEXT: ◦amounts paid to Google Network partners primarily for ads displayed on their properties.\nTEXT: •Other cost of revenues primarily includes:\nTEXT: ◦compensation expense related to our data centers and other operations such as content review and customer and product support;\nTEXT: ◦content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee);\nTEXT: ◦depreciation expense related to our technical infrastructure; and\nTEXT: ◦inventory and other costs related to the devices we sell.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: TAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners.\nTITLE: Operating Expenses\nTEXT: Operating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative.\nTEXT: The main components of our R&D expenses are:\nTEXT: •compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services;\nTEXT: •third-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts.\nTEXT: The main components of our sales and marketing expenses are:\nTEXT: •compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and\nTEXT: •spending relating to our advertising and promotional activities in support of our products and services.\nTEXT: The main components of our general and administrative expenses are:\nTEXT: •compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions;\nTEXT: •expenses relating to legal matters, including certain fines and settlements; and\nTEXT: •third-party services fees, including audit, consulting, outside legal, and other outsourced administrative services.\nTITLE: Other Income (Expense), Net\nTEXT: OI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments.\nTEXT: For additional information, including how we account for our investments and factors that can drive fluctuations in the value of our investments, see Note 1 and Note 3 of the Notes to Consolidated Financial Statements included in Part II, Item 8 as well as Item 7A Quantitative and Qualitative Disclosures About Market Risk of this Annual Report on Form 10-K.\nTITLE: Provision for Income Taxes\nTEXT: Provision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nTEXT: For additional information, including a reconciliation of the U.S. federal statutory rate to our effective tax rate, see Note 14 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Executive Overview\nTEXT: The following table summarizes our consolidated financial results (in millions, except for per share information and percentages):\nTEXT: Year Ended December 31,20222023$ Change% ChangeConsolidated revenues$282,836 $307,394 $24,558 9 %Change in consolidated constant currency revenues(1)10 %Cost of revenues$126,203 $133,332 $7,129 6 %Operating expenses$81,791 $89,769 $7,978 10 %Operating income$74,842 $84,293 $9,451 13 %Operating margin26 %27 %1 %Other income (expense), net$(3,514)$1,424 $4,938 NMNet income$59,972 $73,795 $13,823 23 %Diluted EPS$4.56 $5.80 $1.24 27 %NM = Not Meaningful\nTABLE: TABLE: 2022 2023 $ Change % Change; Consolidated revenues $ 282,836 $ 307,394 $ 24,558 9 %; Change in consolidated constant currency revenues(1) 10 %; Cost of revenues $ 126,203 $ 133,332 $ 7,129 6 %; Operating expenses $ 81,791 $ 89,769 $ 7,978 10 %; Operating income $ 74,842 $ 84,293 $ 9,451 13 %; Operating margin 26 % 27 % 1 %; Other income (expense), net $ (3,514) $ 1,424 $ 4,938 NM; Net income $ 59,972 $ 73,795 $ 13,823 23 %; Diluted EPS $ 4.56 $ 5.80 $ 1.24 27 %.\nTITLE: Year Ended December 31,\nTITLE: 20222023$ Change% Change\nTITLE: 2022\nTITLE: 2023\nTITLE: $ Change\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenues, google, december, change, expenses, primarily, driven, charges, network, information\n\nTITLE: % Change\nTEXT: Change in consolidated constant currency revenues(1)\nTEXT: (1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency information.\nTEXT: •Revenues were $307.4 billion, an increase of 9% year over year, primarily driven by an increase in Google Services revenues of $19.0 billion, or 8%, and an increase in Google Cloud revenues of $6.8 billion, or 26%.\nTEXT: •Total constant currency revenues, which exclude the effect of hedging, increased 10% year over year.\nTEXT: •Cost of revenues was $133.3 billion, an increase of 6% year over year, primarily driven by increases in content acquisition costs, compensation expenses, and TAC. The increase in compensation expenses included charges related to employee severance associated with the reduction in our workforce. Additionally, cost of revenues benefited from a reduction in depreciation due to the change in estimated useful lives of our servers and network equipment.\nTEXT: •Operating expenses were $89.8 billion, an increase of 10% year over year, primarily driven by an increase in compensation expenses and charges related to our office space optimization efforts. The increase in compensation expenses was largely the result of charges related to employee severance associated with the reduction in our workforce and an increase in SBC expense. Operating expenses benefited from the change in the estimated useful lives of our servers and certain network equipment.\nTITLE: Other Information:\nTEXT: •In January 2023, we announced a reduction of our workforce, and as a result we recorded employee severance and related charges of $2.1 billion for the year ended December 31, 2023. In addition, we are taking actions to optimize our global office space. As a result, exit charges recorded during the year ended December 31, 2023, were $1.8 billion. In addition to these exit charges, for the year ended December 31, 2023, we incurred $269 million in accelerated rent and accelerated depreciation. For additional information, see Note 8 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTEXT: •In January 2023, we completed an assessment of the useful lives of our servers and network equipment, resulting in a change in the estimated useful life of our servers and certain network equipment to six years. The effect of this change was a reduction in depreciation expense of $3.9 billion for the year ended December 31, 2023, recognized primarily in cost of revenues and R&D expenses. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: •On July 21, 2023, the IRS announced a rule change allowing taxpayers to temporarily apply the regulations in effect prior to 2022 related to U.S. federal foreign tax credits. This announcement applies to foreign taxes paid or accrued in the fiscal years 2022 and 2023. A cumulative one-time adjustment applicable to the prior period for this tax rule change was recorded in 2023 and is reflected in our effective tax rate of 13.9% for the year ended December 31, 2023.\nTEXT: •Repurchases of Class A and Class C shares were $62.2 billion for the year ended December 31, 2023. For additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: •Operating cash flow was $101.7 billion for the year ended December 31, 2023.\nTEXT: •Capital expenditures, which primarily reflected investments in technical infrastructure, were $32.3 billion for the year ended December 31, 2023.\nTEXT: •As of December 31, 2023, we had 182,502 employees.\nTITLE: Financial Results\nTITLE: Revenues\nTEXT: The following table presents revenues by type (in millions):\nTEXT: Year Ended December 31,20222023Google Search & other$162,450 $175,033 YouTube ads29,243 31,510 Google Network32,780 31,312 Google advertising224,473 237,855 Google subscriptions, platforms, and devices29,055 34,688 Google Services total253,528 272,543 Google Cloud26,280 33,088 Other Bets1,068 1,527 Hedging gains (losses)1,960 236 Total revenues$282,836 $307,394\nTABLE: TABLE: 2022 2023; Google Search & other $ 162,450 $ 175,033; YouTube ads 29,243 31,510; Google Network 32,780 31,312; Google advertising 224,473 237,855; Google subscriptions, platforms, and devices 29,055 34,688; Google Services total 253,528 272,543; Google Cloud 26,280 33,088; Other Bets 1,068 1,527; Hedging gains (losses) 1,960 236; Total revenues $ 282,836 $ 307,394.\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: Google subscriptions, platforms, and devices\nTITLE: Google Services\nTEXT: Google Search & other revenues increased $12.6 billion from 2022 to 2023. The overall growth was driven by interrelated factors including increases in search queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending; and improvements we have made in ad formats and delivery.\nTEXT: YouTube ads revenues increased $2.3 billion from 2022 to 2023. The growth was driven by our brand and direct response advertising products, both of which benefited from increased spending by our advertisers.\nTEXT: Google Network revenues decreased $1.5 billion from 2022 to 2023, primarily driven by a decrease in Google Ad Manager and AdSense revenues.\nTITLE: Table of ContentsAlphabet Inc.\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ngoogle, revenues, changes, primarily, driven, growth, cost, devices, subscriptions, paid\n\nTITLE: Alphabet Inc.\nTEXT: The following table presents changes in monetization metrics for Google Search & other revenues (paid clicks and cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a percentage, from 2022 to 2023:\nTEXT: Google Search & otherPaid clicks change7 %Cost-per-click change1 %Google NetworkImpressions change(5)%Cost-per-impression change0 %\nTABLE: TABLE: Paid clicks change 7 %; Cost-per-click change 1 %; Impressions change (5) %; Cost-per-impression change 0 %.\nTEXT: Changes in paid clicks and impressions are driven by a number of interrelated factors, including changes in advertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search queries resulting from changes in user adoption and usage, primarily on mobile devices.\nTEXT: Changes in cost-per-click and cost-per-impression are driven by a number of interrelated factors including changes in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix, property mix, and changes in foreign currency exchange rates.\nTEXT: Google subscriptions, platforms, and devices\nTEXT: Google subscriptions, platforms, and devices revenues increased $5.6 billion from 2022 to 2023 primarily driven by growth in subscriptions, largely for YouTube services. The growth in YouTube services was primarily due to an increase in paid subscribers.\nTEXT: Google subscriptions, platforms, and devices revenues increased $1.0 billion from 2021 to 2022 primarily driven by growth in subscription and device revenues, partially offset by a decrease in platform revenues. The growth in subscriptions was largely for YouTube services, primarily due to an increase in paid subscribers. The growth in device revenues was primarily driven by increased sales of Pixel devices. The decrease in platform revenues was primarily due to Google Play, driven by the fee structure changes we announced in 2021 as well as a decrease in buyer spending. Additionally, the overall increase in Google subscriptions, platforms, and devices revenues was adversely affected by the unfavorable effect of foreign currency exchange rates.\nTITLE: Google Cloud\nTEXT: Google Cloud revenues increased $6.8 billion from 2022 to 2023. Growth was primarily driven by Google Cloud Platform followed by Google Workspace offerings. Google Cloud's infrastructure and platform services were the largest drivers of growth in Google Cloud Platform.\nTITLE: Revenues by Geography\nTEXT: The following table presents revenues by geography as a percentage of revenues, determined based on the addresses of our customers:\nTEXT: Year Ended December 31, 20222023United States48 %47 %EMEA29 %30 %APAC16 %17 %Other Americas6 %6 %Hedging gains (losses)1 %0 %\nTABLE: TABLE: 2022 2023; United States 48 % 47 %; EMEA 29 % 30 %; APAC 16 % 17 %; Other Americas 6 % 6 %; Hedging gains (losses) 1 % 0 %.\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: For additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenues, currency, constant, period, exchange, foreign, rates, hedging, effect, results\n\nTITLE: Use of Non-GAAP Constant Currency Information\nTEXT: International revenues, which represent a significant portion of our revenues, are generally transacted in multiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nTEXT: The effect of currency exchange rates on our business is an important factor in understanding period-to-period comparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP percentage change in constant currency revenues (\"percentage change in constant currency revenues\") for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe the presentation of results on a constant currency basis in addition to U.S. Generally Accepted Accounting Principles (GAAP) results helps improve the ability to understand our performance, because it excludes the effects of foreign currency volatility that are not indicative of our core operating results.\nTEXT: Constant currency information compares results between periods as if exchange rates had remained constant period over period. We define constant currency revenues as revenues excluding the effect of foreign currency exchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated level. We use constant currency revenues to determine the constant currency revenue percentage change on a year-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior year comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nTEXT: Constant currency revenue percentage change is calculated by determining the change in current period revenues over prior year comparable period revenues where current period foreign currency revenues are translated using prior year comparable period exchange rates and hedging effects are excluded from revenues of both periods.\nTEXT: These results should be considered in addition to, not as a substitute for, results reported in accordance with GAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not a measure of performance presented in accordance with GAAP.\nTEXT: The following table presents the foreign currency exchange effect on international revenues and total revenues (in millions, except percentages):\nTEXT: Year Ended December 31, 2023% Change from Prior PeriodYear Ended December 31,Less FX EffectConstant Currency RevenuesAs ReportedLess Hedging EffectLess FX EffectConstant Currency Revenues20222023United States$134,814 $146,286 $0 $146,286 9 %0 %9 %EMEA82,062 91,038 460 90,578 11 %1 %10 %APAC47,024 51,514 (1,759)53,273 10 %(3)%13 %Other Americas16,976 18,320 (654)18,974 8 %(4)%12 %Revenues, excluding hedging effect280,876 307,158 (1,953)309,111 9 %(1)%10 %Hedging gains (losses)1,960 236 Total revenues(1)$282,836 $307,394 $309,111 9 %0 %(1)%10 %\nTABLE: TABLE: Year Ended December 31, Less FX Effect Constant Currency Revenues As Reported Less Hedging Effect Less FX Effect Constant Currency Revenues; 2022 2023; United States $ 134,814 $ 146,286 $ 0 $ 146,286 9 % 0 % 9 %; EMEA 82,062 91,038 460 90,578 11 % 1 % 10 %; APAC 47,024 51,514 (1,759) 53,273 10 % (3) % 13 %; Other Americas 16,976 18,320 (654) 18,974 8 % (4) % 12 %; Revenues, excluding hedging effect 280,876 307,158 (1,953) 309,111 9 % (1) % 10 %; Hedging gains (losses) 1,960 236; Total revenues(1) $ 282,836 $ 307,394 $ 309,111 9 % 0 % (1) % 10 %.\nTITLE: Year Ended December 31, 2023\nTITLE: % Change from Prior Period\nTITLE: Year Ended December 31,\nTITLE: Less FX Effect\nTITLE: Constant Currency Revenues\nTITLE: As Reported\nTITLE: Less Hedging Effect\nTITLE: Less FX Effect\nTITLE: Constant Currency Revenues\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: Revenues, excluding hedging effect\nTEXT: (1)Total constant currency revenues of $309.1 billion for 2023 increased $28.2 billion compared to $280.9 billion in revenues, excluding hedging effect, for 2022.\nTEXT: EMEA revenue growth was favorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar weakening relative to the Euro, partially offset by the U.S. dollar strengthening relative to the Turkish lira.\nTEXT: APAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Japanese yen.\nTEXT: Other Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due to the U.S. dollar strengthening relative to the Argentine peso.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Costs and Expenses\nTITLE: Cost of Revenues\nTEXT: The following table presents cost of revenues, including TAC (in millions, except percentages):\nTEXT: Year Ended December 31, 202120222023TAC$45,566 $48,955 $50,886 Other cost of revenues65,373 77,248 82,446 Total cost of revenues$110,939 $126,203 $133,332 Total cost of revenues as a percentage of revenues43 %45 %43 %\nTABLE: TABLE: 2021 2022 2023; TAC $ 45,566 $ 48,955 $ 50,886; Other cost of revenues 65,373 77,248 82,446; Total cost of revenues $ 110,939 $ 126,203 $ 133,332; Total cost of revenues as a percentage of revenues 43 % 45 % 43 %.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nexpenses, revenues, other, compensation, primarily, google, reduction, cost, largely, charges\n\nTITLE: 2023\nTEXT: Cost of revenues increased $7.1 billion from 2022 to 2023 due to an increase in other cost of revenues and TAC of $5.2 billion and $1.9 billion, respectively.\nTEXT: The increase in TAC from 2022 to 2023 was largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to TAC. The TAC rate decreased from 21.8% to 21.4% from 2022 to 2023 primarily due to a revenue mix shift from Google Network properties to Google Search & other properties. The TAC rate on Google Search & other revenues and the TAC rate on Google Network revenues were both substantially consistent from 2022 to 2023.\nTEXT: The increase in other cost of revenues from 2022 to 2023 was primarily due to increases in content acquisition costs, largely for YouTube, and compensation expenses, which included $479 million of charges related to employee severance associated with the reduction in our workforce. Additionally, other cost of revenues benefited from a reduction in depreciation expense due to the change in estimated useful lives of our servers and network equipment.\nTEXT: The increase in other cost of revenues of $11.9 billion from 2021 to 2022 was primarily due to increases in device costs, compensation expenses, depreciation, and equipment-related expenses.\nTITLE: Research and Development\nTEXT: The following table presents R&D expenses (in millions, except percentages):\nTEXT: Year Ended December 31, 20222023Research and development expenses$39,500 $45,427 Research and development expenses as a percentage of revenues14 %15 %\nTABLE: TABLE: 2022 2023; Research and development expenses $ 39,500 $ 45,427; Research and development expenses as a percentage of revenues 14 % 15 %.\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: R&D expenses increased $5.9 billion from 2022 to 2023 primarily driven by an increase in compensation expenses of $2.9 billion, $870 million in charges related to our office space optimization efforts, and an increase in depreciation expense of $722 million. The $2.9 billion increase in compensation expenses was largely the result of a 4% increase in average headcount, after adjusting for roles affected by the reduction in our workforce, and an increase in SBC expense. Additionally, the increase in compensation expenses included $848 million in employee severance charges associated with the reduction in our workforce. The $722 million increase in depreciation expense reflected an offsetting benefit of the change in the estimated useful lives of our servers and network equipment.\nTITLE: Sales and Marketing\nTEXT: The following table presents sales and marketing expenses (in millions, except percentages):\nTEXT: Year Ended December 31, 20222023Sales and marketing expenses$26,567 $27,917 Sales and marketing expenses as a percentage of revenues9 %9 %\nTABLE: TABLE: 2022 2023; Sales and marketing expenses $ 26,567 $ 27,917; Sales and marketing expenses as a percentage of revenues 9 % 9 %.\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: Sales and marketing expenses increased $1.4 billion from 2022 to 2023, primarily driven by an increase in compensation expenses of $1.6 billion, partially offset by a decrease in advertising and promotional activities of $441 million. The $1.6 billion increase in compensation expenses was largely the result of $497 million in employee severance charges associated with the reduction in our workforce in addition to a combination of other factors, none of which were individually significant.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: General and Administrative\nTEXT: The following table presents general and administrative expenses (in millions, except percentages):\nTEXT: Year Ended December 31, 20222023General and administrative expenses$15,724 $16,425 General and administrative expenses as a percentage of revenues6 %5 %\nTABLE: TABLE: 2022 2023; General and administrative expenses $ 15,724 $ 16,425; General and administrative expenses as a percentage of revenues 6 % 5 %.\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: General and administrative expenses increased $701 million from 2022 to 2023, primarily driven by an increase in compensation expenses of $416 million, which was largely the result of $264 million in employee severance charges associated with the reduction in our workforce in addition to a combination of other factors, none of which were individually significant.\nTITLE: Segment Profitability\nTEXT: The following table presents segment operating income (loss) (in millions).\nTEXT: Year Ended December 31,20222023Operating income (loss):Google Services$82,699 $95,858 Google Cloud(1,922)1,716 Other Bets(4,636)(4,095)Alphabet-level activities(1)(1,299)(9,186)Total income from operations$74,842 $84,293\nTABLE: TABLE: 2022 2023; Google Services $ 82,699 $ 95,858; Google Cloud (1,922) 1,716; Other Bets (4,636) (4,095); Alphabet-level activities(1) (1,299) (9,186); Total income from operations $ 74,842 $ 84,293.\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\n"
    },
    {
      "cluster": 9,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nincome, securities, operating, driven, changes, change, loss, equity, related, december\n\nTITLE: 2023\nTEXT: (1)In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $2.0 billion and $236 million in 2022 and 2023, respectively. For the year ended December 31, 2023, Alphabet-level activities include charges related to the reduction in force and our office space optimization efforts totaling $3.9 billion. In addition, for the year ended December 31, 2023, we incurred $269 million in accelerated rent and accelerated depreciation. For additional information relating to our workforce reduction and other initiatives, see Note 8 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. For additional information relating to our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Google Services\nTEXT: Google Services operating income increased $13.2 billion from 2022 to 2023. The increase in operating income was primarily driven by an increase in revenues, partially offset by an increase in content acquisition costs and compensation expenses including an increase in SBC expense. Additionally, operating income benefited from a reduction in costs driven by the change in the estimated useful lives of our servers and certain network equipment.\nTITLE: Google Cloud\nTEXT: Google Cloud operating income of $1.7 billion for 2023 compared to an operating loss of $1.9 billion for 2022 represents an increase of $3.6 billion. The increase in operating income was primarily driven by an increase in revenues, partially offset by an increase in compensation expenses largely driven by headcount growth. Additionally, operating income benefited from a reduction in costs driven by the change in the estimated useful lives of our servers and certain network equipment.\nTITLE: Other Bets\nTEXT: Other Bets operating loss decreased $541 million from 2022 to 2023 primarily due to growth in revenues as well as a reduction in valuation-based compensation liabilities related to Other Bet companies.\nTITLE: Other Income (Expense), Net\nTEXT: The following table presents OI&E, (in millions):\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: Year Ended December 31, 20222023Interest income$2,174 $3,865 Interest expense(357)(308)Foreign currency exchange gain (loss), net(654)(1,238)Gain (loss) on debt securities, net(2,064)(1,215)Gain (loss) on equity securities, net(3,455)392 Performance fees798 257 Income (loss) and impairment from equity method investments, net(337)(628)Other381 299 Other income (expense), net$(3,514)$1,424\nTABLE: TABLE: 2022 2023; Interest income $ 2,174 $ 3,865; Interest expense (357) (308); Foreign currency exchange gain (loss), net (654) (1,238); Gain (loss) on debt securities, net (2,064) (1,215); Gain (loss) on equity securities, net (3,455) 392; Performance fees 798 257; Income (loss) and impairment from equity method investments, net (337) (628); Other 381 299; Other income (expense), net $ (3,514) $ 1,424.\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: OI&E, net increased $4.9 billion from 2022 to 2023. The increase was primarily due to fluctuations in the value of equity securities reflecting market driven changes in the value of our marketable equity securities, investment specific event driven changes in our non-marketable equity securities, and increased interest income due to interest rates.\nTEXT: For additional information, see Note 7 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Provision for Income Taxes\nTEXT: The following table presents provision for income taxes (in millions, except for effective tax rate):\nTEXT: Year Ended December 31, 20222023Income before provision for income taxes$71,328 $85,717 Provision for income taxes$11,356 $11,922 Effective tax rate15.9 %13.9 %\nTABLE: TABLE: 2022 2023; Income before provision for income taxes $ 71,328 $ 85,717; Provision for income taxes $ 11,356 $ 11,922; Effective tax rate 15.9 % 13.9 %.\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: In 2023, the Internal Revenue Services (IRS) issued a rule change allowing taxpayers to temporarily apply the regulations in effect prior to 2022 related to U.S. federal foreign tax credits, as well as a separate rule change with interim guidance on the capitalization and amortization of R&D expenses. A cumulative one-time adjustment applicable to the prior period for these tax rule changes was recorded in 2023.\nTEXT: The effective tax rate decreased from 2022 to 2023, reflecting the effect of the two tax rule changes described above, particularly the change related to foreign tax credits. The effect of these tax rule changes was partially offset by changes in uncertain tax benefits and a decrease in the U.S. federal Foreign Derived Intangible Income tax deduction.\nTEXT: The OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus around substantial changes to international tax policies, including the implementation of a minimum global effective tax rate of 15%. While various countries have implemented the legislation as of January 1, 2024, we do not expect a resulting material change to our income tax provision for the 2024 fiscal year. As additional jurisdictions enact such legislation, we expect our effective tax rate and cash tax payments could increase in future years.\nTITLE: Financial Condition\nTITLE: Cash, Cash Equivalents, and Marketable Securities\nTEXT: As of December 31, 2023, we had $110.9 billion in cash, cash equivalents, and short-term marketable securities. Cash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid government bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity securities.\n"
    },
    {
      "cluster": 10,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, activities, marketable, operating, used, financing, consists, primarily, securities, provided\n\nTITLE: Sources, Uses of Cash and Related Trends\nTEXT: Our principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash flow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth of the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital return to stockholders.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: The following table presents our cash flows (in millions): Year Ended December 31, 20222023Net cash provided by operating activities$91,495 $101,746 Net cash used in investing activities$(20,298)$(27,063)Net cash used in financing activities$(69,757)$(72,093)\nTABLE: TABLE: 2022 2023; Net cash provided by operating activities $ 91,495 $ 101,746; Net cash used in investing activities $ (20,298) $ (27,063); Net cash used in financing activities $ (69,757) $ (72,093).\nTITLE: Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTITLE: Cash Provided by Operating Activities\nTEXT: Our largest source of cash provided by operations are advertising revenues generated by Google Search & other properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash through consumer subscriptions and the sale of apps and in-app purchases and devices. In Google Cloud we generate cash through consumption-based fees and subscriptions for infrastructure, platform, collaboration tools, and other cloud services.\nTEXT: Our primary uses of cash from operating activities include payments to distribution and Google Network partners, to employees for compensation, and to content providers. Other uses of cash from operating activities include payments to suppliers for devices, to tax authorities for income taxes, and other general corporate expenditures.\nTEXT: Net cash provided by operating activities increased from 2022 to 2023 due to the increase in cash received from customers, partially offset by increases in cash paid for cost of revenues and operating expenses.\nTITLE: Cash Used in Investing Activities\nTEXT: Cash provided by investing activities consists primarily of maturities and sales of investments in marketable and non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and non-marketable securities, purchases of property and equipment, and payments for acquisitions.\nTEXT: Net cash used in investing activities increased from 2022 to 2023 due to a decrease in maturities and sales of marketable securities, partially offset by a decrease in payments for acquisitions.\nTITLE: Cash Used in Financing Activities\nTEXT: Cash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from the sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of stock, net payments related to stock-based award activities, and repayments of debt.\nTEXT: Net cash used in financing activities increased from 2022 to 2023 due to an increase in repurchases of stock.\nTITLE: Liquidity and Material Cash Requirements\nTEXT: We expect existing cash, cash equivalents, short-term marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future.\nTITLE: Capital Expenditures and Leases\nTEXT: We make investments in land and buildings for data centers and offices and information technology assets through purchases of property and equipment and lease arrangements to provide capacity for the growth of our services and products.\nTEXT: Our capital investments in property and equipment consist primarily of the following major categories:\nTEXT: •technical infrastructure, which consists of our investments in servers and network equipment for computing, storage, and networking requirements for ongoing business activities, including AI, (collectively referred to as our information technology assets) and data center land and building construction; and\nTEXT: •office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\").\nTEXT: Construction in progress consists primarily of technical infrastructure and office facilities which have not yet been placed in service. The time frame from date of purchase to placement in service of these assets may extend from months to years. For example, our data center construction projects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct buildings, and secure and install information technology assets.\nTITLE: Table of ContentsAlphabet Inc.\n"
    },
    {
      "cluster": 11,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ndecember, term, lease, consolidated, class, respectively, included, additional, notes, statements\n\nTITLE: Alphabet Inc.\nTEXT: During the years ended December 31, 2022 and 2023, we spent $31.5 billion and $32.3 billion on capital expenditures, respectively. We expect to increase, relative to 2023, our investment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. Depreciation of our property and equipment commences when the deployment of such assets are completed and are ready for our intended use. Land is not depreciated. For the years ended December 31, 2022 and 2023, our depreciation on property and equipment were $13.5 billion and $11.9 billion, respectively.\nTEXT: For the years ended December 31, 2022 and 2023, we recognized total operating lease assets of $4.4 billion and $2.9 billion, respectively. As of December 31, 2023, the amount of total future lease payments under operating leases, which had a weighted average remaining lease term of eight years, was $17.7 billion, of which $3.2 billion is short-term. As of December 31, 2023, we have entered into leases that have not yet commenced with future short-term and long-term lease payments of $657 million and $3.3 billion, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2024 and 2026 with non-cancelable lease terms of one to 25 years.\nTEXT: For the years ended December 31, 2022 and 2023, our operating lease expenses (including variable lease costs) were $3.7 billion and $4.5 billion, respectively. Finance lease costs were not material for the years ended December 31, 2022 and 2023. For additional information, see Note 4 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Financing\nTEXT: We have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. As of December 31, 2023, we had no commercial paper outstanding.\nTEXT: As of December 31, 2023, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2024 and $6.0 billion expiring in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts have been borrowed under the credit facilities.\nTEXT: As of December 31, 2023, we had senior unsecured notes outstanding with a total carrying value of $12.9 billion with short-term and long-term future interest payments of $214 million and $3.6 billion, respectively. For additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTEXT: We primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure and devices we sell. We have agreements where we may purchase components directly from suppliers and then supply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of these arrangements result in a portion of the cash received from and paid to the contract manufacturers to be presented as financing activities in the Consolidated Statements of Cash Flows included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Share Repurchase Program\nTEXT: During 2023 we repurchased and subsequently retired 528 million shares for $62.2 billion.\nTEXT: In April 2023, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. As of December 31, 2023, $36.3 billion remains available for Class A and Class C share repurchases.\nTEXT: The following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\nTEXT: Year Ended December 31, 2022Year Ended December 31, 2023SharesAmountSharesAmountClass A share repurchases61$6,719 78$9,316 Class C share repurchases46952,577 45052,868 Total share repurchases(1)530$59,296 528$62,184 (1) Shares repurchased include unsettled repurchases as of December 31, 2023.\nTABLE: TABLE: Year Ended December 31, 2022 Year Ended December 31, 2023; Shares Amount Shares Amount; Class A share repurchases 61 $ 6,719 78 $ 9,316; Class C share repurchases 469 52,577 450 52,868; Total share repurchases(1) 530 $ 59,296 528 $ 62,184.\nTITLE: Year Ended December 31, 2022Year Ended December 31, 2023\nTITLE: Year Ended December 31, 2022\nTITLE: Year Ended December 31, 2023\nTITLE: SharesAmountSharesAmount\nTITLE: Shares\nTITLE: Amount\nTITLE: Shares\nTITLE: Amount\nTEXT: For additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: European Commission Fines\nTEXT: In 2017, 2018 and 2019, the EC announced decisions that certain actions taken by Google infringed European competition law and imposed fines of €2.4 billion ($2.7 billion as of June 27, 2017), €4.3 billion ($5.1 billion as of June 30, 2018), and €1.5 billion ($1.7 billion as of March 20, 2019), respectively. On September 14, 2022, the General Court reduced the 2018 fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal to the European Court of Justice.\nTEXT: While each EC decision is under appeal, we included the fines in accrued expenses and other current liabilities on our Consolidated Balance Sheets as we provided bank guarantees (in lieu of a cash payment) for the fines. For additional information, see Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n"
    },
    {
      "cluster": 12,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nestimates, which, financial, these, based, certain, agreements, changes, fair, value\n\nTITLE: Taxes\nTEXT: As of December 31, 2023, we had income taxes payable of $4.2 billion, of which $2.1 billion was short-term, related to a one-time transition tax payable incurred as a result of the U.S. Tax Cuts and Jobs Act (\"Tax Act\"). As permitted by the Tax Act, we will pay the transition tax in annual interest-free installments through 2025. We also have long-term taxes payable of $6.3 billion primarily related to uncertain tax positions as of December 31, 2023.\nTITLE: Purchase Commitments and Other Contractual Obligations\nTEXT: As of December 31, 2023, we had material purchase commitments and other contractual obligations of $45.9 billion, of which $31.6 billion was short-term. These amounts primarily consist of purchase orders for certain technical infrastructure as well as the non-cancelable portion or the minimum cancellation fee in certain agreements related to commitments to purchase licenses, including content licenses, inventory and network capacity. For those agreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities and/or pricing as of December 31, 2023. In certain instances, the amount of our contractual obligations may change based on the expected timing of order fulfillment from our suppliers. For more information related to our content licenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTEXT: In addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and energy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar commitment. The amounts to be paid under these agreements are based on the actual volumes to be generated and are not readily determinable.\nTITLE: Critical Accounting Estimates\nTEXT: We prepare our consolidated financial statements in accordance with GAAP. In doing so, we have to make estimates and assumptions. Our critical accounting estimates are those estimates that involve a significant level of uncertainty at the time the estimate was made, and changes in them have had or are reasonably likely to have a material effect on our financial condition or results of operations. Accordingly, actual results could differ materially from our estimates. We base our estimates on past experience and other assumptions that we believe are reasonable under the circumstances, and we evaluate these estimates on an ongoing basis. We have reviewed our critical accounting estimates with the Audit and Compliance Committee of our Board of Directors.\nTEXT: For a summary of significant accounting policies and the effect on our financial statements, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Fair Value Measurements of Non-Marketable Equity Securities\nTEXT: We measure certain financial instruments at fair value on a nonrecurring basis, consisting primarily of our non-marketable equity securities. These investments are accounted for under the measurement alternative method (\"the measurement alternative\") and are measured at cost, less impairment, subject to upward and downward adjustments resulting from observable price changes for identical or similar investments of the same issuer. These adjustments require quantitative assessments of the fair value of our securities, which may require the use of unobservable inputs. Adjustments are determined primarily based on a market approach as of the transaction date and involve the use of estimates using the best information available, which may include cash flow projections or other available market data.\nTEXT: Non-marketable equity securities are also evaluated for impairment, based on qualitative factors including the companies' financial and liquidity position and access to capital resources, among others. When indicators of impairment exist, we prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach, which requires judgment and the use of unobservable inputs, including discount rates, investee revenues and costs, and comparable market data of private and public companies, among others.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: When the quantitative remeasurements of fair value indicate an impairment exists, we write down the investment to its current fair value.\nTEXT: We also have compensation arrangements with payouts based on realized returns from certain investments, i.e. performance fees. We record compensation expense based on the estimated payouts on an ongoing basis, which may result in expense recognized before investment returns are realized and compensation is paid and may require the use of unobservable inputs.\nTITLE: Property and Equipment\nTEXT: We assess the reasonableness of the useful lives of our property and equipment periodically as well as when other changes occur, such as when there are changes to ongoing business operations, changes in the planned use and utilization of assets, or technological advancements, that could indicate a change in the period over which we expect to benefit from the assets.\n"
    },
    {
      "cluster": 13,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nmatters, loss, income, such, taxes, uncertain, provision, these, related, amount\n\nTITLE: Income Taxes\nTEXT: We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes.\nTEXT: Recording an uncertain tax position involves various qualitative considerations, including evaluation of comparable and resolved tax exposures, applicability of tax laws, and likelihood of settlement. We evaluate uncertain tax positions periodically, considering changes in facts and circumstances, such as new regulations or recent judicial opinions, as well as the status of audit activities by taxing authorities. Although we believe we have adequately reserved for our uncertain tax positions, no assurance can be given that the final tax outcome of these matters will not be different. To the extent that the final tax outcome of these matters is different than the amounts recorded, such differences will affect the provision for income taxes and the effective tax rate in the period in which such determination is made.\nTEXT: The provision for income taxes includes the effect of reserve provisions and changes to reserves as well as the related net interest and penalties. In addition, we are subject to the continuous examination of our income tax returns by the IRS and other tax authorities which may assert assessments against us. We regularly assess the likelihood of adverse outcomes resulting from these examinations and assessments to determine the adequacy of our provision for income taxes.\nTITLE: Loss Contingencies\nTEXT: We are regularly subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, privacy, data security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury consumer protection, and other matters. Certain of these matters include speculative claims for substantial or indeterminate amounts of damages. We record a liability when we believe that it is probable that a loss has been incurred and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the possible loss in Note 10 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTEXT: We evaluate, on a regular basis, developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments and changes to our disclosures. Significant judgment is required to determine both the likelihood and the estimated amount of a loss related to such matters. Until the final resolution of such matters, there may be an exposure to loss in excess of the amount recorded, and such amounts could be material.\nTITLE: Change in Accounting Estimate\nTEXT: In January 2023, we completed an assessment of the useful lives of our servers and network equipment resulting in a change in the estimated useful life of our servers and certain network equipment to six years. This change in accounting estimate was effective beginning fiscal year 2023. For additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstatements, financial, consolidated, company, audit, accounting, pcaob, income, opinion, december\n\nTEXT: Financial Statements and Supplementary Data\nTITLE: Alphabet Inc.\nTEXT: INDEX TO CONSOLIDATED FINANCIAL STATEMENTS PageReports of Independent Registered Public Accounting Firm (PCAOB ID: 42)48Financial Statements:Consolidated Balance Sheets51Consolidated Statements of Income52Consolidated Statements of Comprehensive Income53Consolidated Statements of Stockholders’ Equity54Consolidated Statements of Cash Flows55Notes to Consolidated Financial Statements56\nTABLE: TABLE: Reports of Independent Registered Public Accounting Firm (PCAOB ID: 42) 48; Consolidated Balance Sheets 51; Consolidated Statements of Income 52; Consolidated Statements of Comprehensive Income 53; Consolidated Statements of Stockholders’ Equity 54; Consolidated Statements of Cash Flows 55; Notes to Consolidated Financial Statements 56.\nTEXT: Reports of Independent Registered Public Accounting Firm (PCAOB ID: 42)\nTEXT: Consolidated Statements of Income\nTEXT: Consolidated Statements of Comprehensive Income\nTEXT: Consolidated Statements of Stockholders’ Equity\nTEXT: Consolidated Statements of Cash Flows\nTEXT: Notes to Consolidated Financial Statements\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTEXT: To the Stockholders and the Board of Directors of Alphabet Inc.\nTITLE: Opinion on the Financial Statements\nTEXT: We have audited the accompanying consolidated balance sheets of Alphabet Inc. (the Company) as of December 31, 2022 and 2023, the related consolidated statements of income, comprehensive income, stockholders' equity and cash flows for each of the three years in the period ended December 31, 2023, and the related notes and financial statement schedule listed in the Index at Item 15 (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2022 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2023, in conformity with U.S. generally accepted accounting principles.\nTEXT: We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2023, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated January 30, 2024 expressed an unqualified opinion thereon.\nTITLE: Basis for Opinion\nTEXT: These financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nTITLE: Critical Audit Matter\nTEXT: The critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nTITLE: Table of ContentsAlphabet Inc.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nloss, matters, management, these, company, lawsuits, other, related, contingencies, claims\n\nTITLE: Alphabet Inc.\nTEXT: Loss Contingencies Description of the MatterThe Company is regularly subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by its users, goods and services offered by advertisers or publishers using their platforms, personal injury, consumer protection, and other matters. As described in Note 10 to the consolidated financial statements “Commitments and contingencies” such claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders could result in adverse consequences.Significant judgment is required to determine both the likelihood, and the estimated amount, of a loss related to such matters. Auditing management’s accounting for and disclosure of loss contingencies from these matters involved challenging and subjective auditor judgment in assessing the Company’s evaluation of the probability of a loss, and the estimated amount or range of loss.How We Addressed the Matter in Our AuditWe tested relevant controls over the identified risks associated with management’s accounting for and disclosure of these matters. This included controls over management’s assessment of the probability of incurrence of a loss and whether the loss or range of loss was reasonably estimable and the development of related disclosures.Our audit procedures included gaining an understanding of previous rulings and the status of ongoing lawsuits, reviewing letters addressing the matters from internal and external legal counsel, meeting with internal legal counsel to discuss the allegations, and obtaining a representation letter from management on these matters. We also evaluated the Company’s disclosures in relation to these matters.\nTABLE: TABLE: Description of the Matter The Company is regularly subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by its users, goods and services offered by advertisers or publishers using their platforms, personal injury, consumer protection, and other matters. As described in Note 10 to the consolidated financial statements “Commitments and contingencies” such claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders could result in adverse consequences.Significant judgment is required to determine both the likelihood, and the estimated amount, of a loss related to such matters. Auditing management’s accounting for and disclosure of loss contingencies from these matters involved challenging and subjective auditor judgment in assessing the Company’s evaluation of the probability of a loss, and the estimated amount or range of loss.; How We Addressed the Matter in Our Audit We tested relevant controls over the identified risks associated with management’s accounting for and disclosure of these matters. This included controls over management’s assessment of the probability of incurrence of a loss and whether the loss or range of loss was reasonably estimable and the development of related disclosures.Our audit procedures included gaining an understanding of previous rulings and the status of ongoing lawsuits, reviewing letters addressing the matters from internal and external legal counsel, meeting with internal legal counsel to discuss the allegations, and obtaining a representation letter from management on these matters. We also evaluated the Company’s disclosures in relation to these matters..\nTEXT: The Company is regularly subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by its users, goods and services offered by advertisers or publishers using their platforms, personal injury, consumer protection, and other matters. As described in Note 10 to the consolidated financial statements “Commitments and contingencies” such claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders could result in adverse consequences.\nTEXT: Significant judgment is required to determine both the likelihood, and the estimated amount, of a loss related to such matters. Auditing management’s accounting for and disclosure of loss contingencies from these matters involved challenging and subjective auditor judgment in assessing the Company’s evaluation of the probability of a loss, and the estimated amount or range of loss.\nTEXT: We tested relevant controls over the identified risks associated with management’s accounting for and disclosure of these matters. This included controls over management’s assessment of the probability of incurrence of a loss and whether the loss or range of loss was reasonably estimable and the development of related disclosures.\nTEXT: Our audit procedures included gaining an understanding of previous rulings and the status of ongoing lawsuits, reviewing letters addressing the matters from internal and external legal counsel, meeting with internal legal counsel to discuss the allegations, and obtaining a representation letter from management on these matters. We also evaluated the Company’s disclosures in relation to these matters.\nTEXT: /s/ Ernst & Young LLPWe have served as the Company's auditor since 1999.San Jose, CaliforniaJanuary 30, 2024\nTABLE: TABLE: .\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTEXT: To the Stockholders and the Board of Directors of Alphabet Inc.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfinancial, internal, control, reporting, company, accordance, reasonable, audit, based, opinion\n\nTITLE: Opinion on Internal Control Over Financial Reporting\nTEXT: We have audited Alphabet Inc.’s internal control over financial reporting as of December 31, 2023, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Alphabet Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2023, based on the COSO criteria.\nTEXT: We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the 2023 consolidated financial statements of the Company and our report dated January 30, 2024 expressed an unqualified opinion thereon.\nTITLE: Basis for Opinion\nTEXT: The Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nTEXT: Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nTITLE: Definition and Limitations of Internal Control Over Financial Reporting\nTEXT: A company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nTEXT: Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nTEXT: /s/ Ernst & Young LLPSan Jose, CaliforniaJanuary 30, 2024\nTABLE: TABLE: .\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nclass, income, share, total, liabilities, shares, current, assets, other, stock\n\nTITLE: CONSOLIDATED BALANCE SHEETS\nTEXT: (in millions, except par value per share amounts)As of December 31,20222023AssetsCurrent assets:Cash and cash equivalents$21,879 $24,048 Marketable securities91,883 86,868 Total cash, cash equivalents, and marketable securities113,762 110,916 Accounts receivable, net40,258 47,964 Other current assets10,775 12,650 Total current assets164,795 171,530 Non-marketable securities30,492 31,008 Deferred income taxes5,261 12,169 Property and equipment, net112,668 134,345 Operating lease assets14,381 14,091 Goodwill28,960 29,198 Other non-current assets8,707 10,051 Total assets$365,264 $402,392 Liabilities and Stockholders’ EquityCurrent liabilities:Accounts payable$5,128 $7,493 Accrued compensation and benefits14,028 15,140 Accrued expenses and other current liabilities37,866 46,168 Accrued revenue share8,370 8,876 Deferred revenue3,908 4,137 Total current liabilities69,300 81,814 Long-term debt14,701 13,253 Deferred revenue, non-current599 911 Income taxes payable, non-current9,258 8,474 Deferred income taxes514 485 Operating lease liabilities12,501 12,460 Other long-term liabilities2,247 1,616 Total liabilities109,120 119,013 Commitments and Contingencies (Note 10)Stockholders’ equity:Preferred stock, $0.001 par value per share, 100 shares authorized; no shares issued and outstanding0 0 Class A, Class B, and Class C stock and additional paid-in capital, $0.001 par value per share: 300,000 shares authorized (Class A 180,000, Class B 60,000, Class C 60,000); 12,849 (Class A 5,964, Class B 883, Class C 6,002) and 12,460 (Class A 5,899, Class B 870, Class C 5,691) shares issued and outstanding68,184 76,534 Accumulated other comprehensive income (loss)(7,603)(4,402)Retained earnings195,563 211,247 Total stockholders’ equity256,144 283,379 Total liabilities and stockholders’ equity$365,264 $402,392\nTABLE: TABLE: 2022 2023; Cash and cash equivalents $ 21,879 $ 24,048; Marketable securities 91,883 86,868; Total cash, cash equivalents, and marketable securities 113,762 110,916; Accounts receivable, net 40,258 47,964; Other current assets 10,775 12,650; Total current assets 164,795 171,530; Non-marketable securities 30,492 31,008; Deferred income taxes 5,261 12,169; Property and equipment, net 112,668 134,345; Operating lease assets 14,381 14,091; Goodwill 28,960 29,198; Other non-current assets 8,707 10,051; Total assets $ 365,264 $ 402,392; Accounts payable $ 5,128 $ 7,493; Accrued compensation and benefits 14,028 15,140; Accrued expenses and other current liabilities 37,866 46,168; Accrued revenue share 8,370 8,876; Deferred revenue 3,908 4,137; Total current liabilities 69,300 81,814; Long-term debt 14,701 13,253; Deferred revenue, non-current 599 911; Income taxes payable, non-current 9,258 8,474; Deferred income taxes 514 485; Operating lease liabilities 12,501 12,460; Other long-term liabilities 2,247 1,616; Total liabilities 109,120 119,013; Preferred stock, $0.001 par value per share, 100 shares authorized; no shares issued and outstanding 0 0; Class A, Class B, and Class C stock and additional paid-in capital, $0.001 par value per share: 300,000 shares authorized (Class A 180,000, Class B 60,000, Class C 60,000); 12,849 (Class A 5,964, Class B 883, Class C 6,002) and 12,460 (Class A 5,899, Class B 870, Class C 5,691) shares issued and outstanding 68,184 76,534; Accumulated other comprehensive income (loss) (7,603) (4,402); Retained earnings 195,563 211,247; Total stockholders’ equity 256,144 283,379; Total liabilities and stockholders’ equity $ 365,264 $ 402,392.\nTITLE: As of December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTITLE: Assets\nTITLE: Liabilities and Stockholders’ Equity\nTEXT: Preferred stock, $0.001 par value per share, 100 shares authorized; no shares issued and outstanding\nTEXT: Class A, Class B, and Class C stock and additional paid-in capital, $0.001 par value per share: 300,000 shares authorized (Class A 180,000, Class B 60,000, Class C 60,000); 12,849 (Class A 5,964, Class B 883, Class C 6,002) and 12,460 (Class A 5,899, Class B 870, Class C 5,691) shares issued and outstanding\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: CONSOLIDATED STATEMENTS OF INCOME\nTEXT: (in millions, except per share amounts) Year Ended December 31, 202120222023Revenues$257,637 $282,836 $307,394 Costs and expenses:Cost of revenues110,939 126,203 133,332 Research and development31,562 39,500 45,427 Sales and marketing22,912 26,567 27,917 General and administrative13,510 15,724 16,425 Total costs and expenses178,923 207,994 223,101 Income from operations78,714 74,842 84,293 Other income (expense), net12,020 (3,514)1,424 Income before income taxes90,734 71,328 85,717 Provision for income taxes14,701 11,356 11,922 Net income$76,033 $59,972 $73,795 Basic net income per share of Class A, Class B, and Class C stock$5.69 $4.59 $5.84 Diluted net income per share of Class A, Class B, and Class C stock$5.61 $4.56 $5.80\nTABLE: TABLE: 2021 2022 2023; Revenues $ 257,637 $ 282,836 $ 307,394; Cost of revenues 110,939 126,203 133,332; Research and development 31,562 39,500 45,427; Sales and marketing 22,912 26,567 27,917; General and administrative 13,510 15,724 16,425; Total costs and expenses 178,923 207,994 223,101; Income from operations 78,714 74,842 84,293; Other income (expense), net 12,020 (3,514) 1,424; Income before income taxes 90,734 71,328 85,717; Provision for income taxes 14,701 11,356 11,922; Net income $ 76,033 $ 59,972 $ 73,795; Basic net income per share of Class A, Class B, and Class C stock $ 5.69 $ 4.59 $ 5.84; Diluted net income per share of Class A, Class B, and Class C stock $ 5.61 $ 4.56 $ 5.80.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, stock, other, change, expense, december, comprehensive, loss, gains, losses\n\nTITLE: CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nTEXT: (in millions) Year Ended December 31, 202120222023Net income$76,033 $59,972 $73,795 Other comprehensive income (loss):Change in foreign currency translation adjustment(1,442)(1,836)735 Available-for-sale investments:Change in net unrealized gains (losses)(1,312)(4,720)1,344 Less: reclassification adjustment for net (gains) losses included in net income(64)1,007 1,168 Net change, net of income tax benefit (expense) of $394, $1,056, and $(698)(1,376)(3,713)2,512 Cash flow hedges:Change in net unrealized gains (losses)716 1,275 168 Less: reclassification adjustment for net (gains) losses included in net income(154)(1,706)(214)Net change, net of income tax benefit (expense) of $(122), $110, and $2562 (431)(46)Other comprehensive income (loss)(2,256)(5,980)3,201 Comprehensive income$73,777 $53,992 $76,996\nTABLE: TABLE: 2021 2022 2023; Net income $ 76,033 $ 59,972 $ 73,795; Change in foreign currency translation adjustment (1,442) (1,836) 735; Change in net unrealized gains (losses) (1,312) (4,720) 1,344; Less: reclassification adjustment for net (gains) losses included in net income (64) 1,007 1,168; Net change, net of income tax benefit (expense) of $394, $1,056, and $(698) (1,376) (3,713) 2,512; Change in net unrealized gains (losses) 716 1,275 168; Less: reclassification adjustment for net (gains) losses included in net income (154) (1,706) (214); Net change, net of income tax benefit (expense) of $(122), $110, and $2 562 (431) (46); Other comprehensive income (loss) (2,256) (5,980) 3,201; Comprehensive income $ 73,777 $ 53,992 $ 76,996.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: Net change, net of income tax benefit (expense) of $394, $1,056, and $(698)\nTEXT: Net change, net of income tax benefit (expense) of $(122), $110, and $2\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: CONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nTEXT: (in millions) Class A, Class B, Class C Stock andAdditional Paid-In CapitalAccumulatedOtherComprehensiveIncome (Loss)RetainedEarningsTotalStockholders’Equity SharesAmountBalance as of December 31, 202013,504 $58,510 $633 $163,401 $222,544 Stock issued145 12 0 0 12 Stock-based compensation expense0 15,539 0 0 15,539 Tax withholding related to vesting of restricted stock units and other0 (10,273)0 0 (10,273)Repurchases of stock(407)(2,324)0 (47,950)(50,274)Sale of interest in consolidated entities0 310 0 0 310 Net income0 0 0 76,033 76,033 Other comprehensive income (loss)0 0 (2,256)0 (2,256)Balance as of December 31, 202113,242 61,774 (1,623)191,484 251,635 Stock issued137 8 0 0 8 Stock-based compensation expense0 19,525 0 0 19,525 Tax withholding related to vesting of restricted stock units and other0 (9,754)0 (1)(9,755)Repurchases of stock(530)(3,404)0 (55,892)(59,296)Sale of interest in consolidated entities0 35 0 0 35 Net income0 0 0 59,972 59,972 Other comprehensive income (loss)0 0 (5,980)0 (5,980)Balance as of December 31, 202212,849 68,184 (7,603)195,563 256,144 Stock issued139 0 0 0 0 Stock-based compensation expense0 22,578 0 0 22,578 Tax withholding related to vesting of restricted stock units and other0 (10,164)0 9 (10,155)Repurchases of stock(528)(4,064)0 (58,120)(62,184)Net income0 0 0 73,795 73,795 Other comprehensive income (loss)0 0 3,201 0 3,201 Balance as of December 31, 202312,460 $76,534 $(4,402)$211,247 $283,379\nTABLE: TABLE: Class A, Class B, Class C Stock andAdditional Paid-In Capital AccumulatedOtherComprehensiveIncome (Loss) RetainedEarnings TotalStockholders’Equity; Shares Amount; Balance as of December 31, 2020 13,504 $ 58,510 $ 633 $ 163,401 $ 222,544; Stock issued 145 12 0 0 12; Stock-based compensation expense 0 15,539 0 0 15,539; Tax withholding related to vesting of restricted stock units and other 0 (10,273) 0 0 (10,273); Repurchases of stock (407) (2,324) 0 (47,950) (50,274); Sale of interest in consolidated entities 0 310 0 0 310; Net income 0 0 0 76,033 76,033; Other comprehensive income (loss) 0 0 (2,256) 0 (2,256); Balance as of December 31, 2021 13,242 61,774 (1,623) 191,484 251,635; Stock issued 137 8 0 0 8; Stock-based compensation expense 0 19,525 0 0 19,525; Tax withholding related to vesting of restricted stock units and other 0 (9,754) 0 (1) (9,755); Repurchases of stock (530) (3,404) 0 (55,892) (59,296); Sale of interest in consolidated entities 0 35 0 0 35; Net income 0 0 0 59,972 59,972; Other comprehensive income (loss) 0 0 (5,980) 0 (5,980); Balance as of December 31, 2022 12,849 68,184 (7,603) 195,563 256,144; Stock issued 139 0 0 0 0; Stock-based compensation expense 0 22,578 0 0 22,578; Tax withholding related to vesting of restricted stock units and other 0 (10,164) 0 9 (10,155); Repurchases of stock (528) (4,064) 0 (58,120) (62,184); Net income 0 0 0 73,795 73,795; Other comprehensive income (loss) 0 0 3,201 0 3,201; Balance as of December 31, 2023 12,460 $ 76,534 $ (4,402) $ 211,247 $ 283,379.\nTITLE: Class A, Class B, Class C Stock andAdditional Paid-In Capital\nTITLE: Class A, Class B, Class C Stock and\nTITLE: Additional Paid-In Capital\nTITLE: AccumulatedOtherComprehensiveIncome (Loss)\nTITLE: RetainedEarnings\nTITLE: TotalStockholders’Equity\nTITLE: SharesAmount\nTITLE: Shares\nTITLE: Amount\nTEXT: Balance as of December 31, 2020\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, securities, other, activities, income, based, purchases, marketable, equivalents, alphabet\n\nTITLE: CONSOLIDATED STATEMENTS OF CASH FLOWS\nTEXT: (in millions) Year Ended December 31, 202120222023Operating activitiesNet income$76,033 $59,972 $73,795 Adjustments:Depreciation of property and equipment10,273 13,475 11,946 Stock-based compensation expense15,376 19,362 22,460 Deferred income taxes1,808 (8,081)(7,763)(Gain) loss on debt and equity securities, net(12,270)5,519 823 Other1,955 3,483 4,330 Changes in assets and liabilities, net of effects of acquisitions:Accounts receivable, net(9,095)(2,317)(7,833)Income taxes, net(625)584 523 Other assets(1,846)(5,046)(2,143)Accounts payable283 707 664 Accrued expenses and other liabilities7,304 3,915 3,937 Accrued revenue share1,682 (445)482 Deferred revenue774 367 525 Net cash provided by operating activities91,652 91,495 101,746 Investing activitiesPurchases of property and equipment(24,640)(31,485)(32,251)Purchases of marketable securities(135,196)(78,874)(77,858)Maturities and sales of marketable securities128,294 97,822 86,672 Purchases of non-marketable securities(2,838)(2,531)(3,027)Maturities and sales of non-marketable securities934 150 947 Acquisitions, net of cash acquired, and purchases of intangible assets(2,618)(6,969)(495)Other investing activities541 1,589 (1,051)Net cash used in investing activities(35,523)(20,298)(27,063)Financing activitiesNet payments related to stock-based award activities(10,162)(9,300)(9,837)Repurchases of stock(50,274)(59,296)(61,504)Proceeds from issuance of debt, net of costs20,199 52,872 10,790 Repayments of debt(21,435)(54,068)(11,550)Proceeds from sale of interest in consolidated entities, net310 35 8 Net cash used in financing activities(61,362)(69,757)(72,093)Effect of exchange rate changes on cash and cash equivalents(287)(506)(421)Net increase (decrease) in cash and cash equivalents(5,520)934 2,169 Cash and cash equivalents at beginning of period26,465 20,945 21,879 Cash and cash equivalents at end of period$20,945 $21,879 $24,048 Supplemental disclosures of cash flow informationCash paid for income taxes, net of refunds$13,412 $18,892 $19,164\nTABLE: TABLE: 2021 2022 2023; Net income $ 76,033 $ 59,972 $ 73,795; Depreciation of property and equipment 10,273 13,475 11,946; Stock-based compensation expense 15,376 19,362 22,460; Deferred income taxes 1,808 (8,081) (7,763); (Gain) loss on debt and equity securities, net (12,270) 5,519 823; Other 1,955 3,483 4,330; Accounts receivable, net (9,095) (2,317) (7,833); Income taxes, net (625) 584 523; Other assets (1,846) (5,046) (2,143); Accounts payable 283 707 664; Accrued expenses and other liabilities 7,304 3,915 3,937; Accrued revenue share 1,682 (445) 482; Deferred revenue 774 367 525; Net cash provided by operating activities 91,652 91,495 101,746; Purchases of property and equipment (24,640) (31,485) (32,251); Purchases of marketable securities (135,196) (78,874) (77,858); Maturities and sales of marketable securities 128,294 97,822 86,672; Purchases of non-marketable securities (2,838) (2,531) (3,027); Maturities and sales of non-marketable securities 934 150 947; Acquisitions, net of cash acquired, and purchases of intangible assets (2,618) (6,969) (495); Other investing activities 541 1,589 (1,051); Net cash used in investing activities (35,523) (20,298) (27,063); Net payments related to stock-based award activities (10,162) (9,300) (9,837); Repurchases of stock (50,274) (59,296) (61,504); Proceeds from issuance of debt, net of costs 20,199 52,872 10,790; Repayments of debt (21,435) (54,068) (11,550); Proceeds from sale of interest in consolidated entities, net 310 35 8; Net cash used in financing activities (61,362) (69,757) (72,093); Effect of exchange rate changes on cash and cash equivalents (287) (506) (421); Net increase (decrease) in cash and cash equivalents (5,520) 934 2,169; Cash and cash equivalents at beginning of period 26,465 20,945 21,879; Cash and cash equivalents at end of period $ 20,945 $ 21,879 $ 24,048; Cash paid for income taxes, net of refunds $ 13,412 $ 18,892 $ 19,164.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTITLE: Operating activities\nTITLE: Investing activities\nTITLE: Financing activities\nTITLE: Net increase (decrease) in cash and cash equivalents(5,520)934 2,169\nTITLE: Net increase (decrease) in cash and cash equivalents\nTITLE: Cash and cash equivalents at end of period$20,945 $21,879 $24,048\nTITLE: Cash and cash equivalents at end of period\nTITLE: Supplemental disclosures of cash flow information\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Nature of Operations\nTEXT: Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google.\nTEXT: We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers with infrastructure and platform services as well as communication and collaboration tools; sales of other products and services, such as fees received for consumer subscription-based products, apps and in-app purchases, and devices.\nTITLE: Basis of Consolidation\nTEXT: The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated.\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ngoogle, revenues, services, advertising, basis, network, cloud, which, customers, properties\n\nTITLE: Use of Estimates\nTEXT: Preparation of consolidated financial statements in conformity with GAAP requires us to make estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates due to uncertainties. On an ongoing basis, we evaluate our estimates, including those related to the allowance for credit losses; content licenses; contingent liabilities; fair values of financial instruments and goodwill; income taxes; inventory; and useful lives of property and equipment, among others. We base our estimates on assumptions, both historical and forward looking, that are believed to be reasonable, and the results of which form the basis for making judgments about the carrying values of assets and liabilities.\nTEXT: In January 2023, we completed an assessment of the useful lives of our servers and network equipment and adjusted the estimated useful life of our servers from four years to six years and the estimated useful life of certain network equipment from five years to six years. This change in accounting estimate was effective beginning in fiscal year 2023. Based on the carrying value of servers and certain network equipment as of December 31, 2022, and those placed in service during the year ended December 31, 2023, the effect of this change in estimate was a reduction in depreciation expense of $3.9 billion and an increase in net income of $3.0 billion, or $0.24 per basic and $0.24 per diluted share, for the year ended December 31, 2023.\nTITLE: Revenue Recognition\nTEXT: Revenues are recognized when control of the promised goods or services is transferred to our customers, and the collectibility of an amount that we expect in exchange for those goods or services is probable. Sales and other similar taxes are excluded from revenues.\nTITLE: Advertising Revenues\nTEXT: We generate advertising revenues primarily by delivering advertising on:\nTEXT: •Google Search and other properties, including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc. and other Google owned and operated properties like Gmail, Google Maps, and Google Play;\nTEXT: •Google Network properties, including revenues from Google Network properties participating in AdMob, AdSense, and Google Ad Manager.\nTEXT: Our customers generally purchase advertising inventory through Google Ads, Google Ad Manager, Google Display & Video 360, and Google Marketing Platform, among others.\nTEXT: We offer advertising by delivering both performance and brand advertising. We recognize revenues for performance advertising when a user engages with the advertisement. For brand advertising, we recognize revenues when the ad is displayed, or a user views the ad.\nTEXT: For ads placed on Google Network properties, we evaluate whether we are the principal (i.e., report revenues on a gross basis) or agent (i.e., report revenues on a net basis). Generally, we report advertising revenues for ads placed on Google Network properties on a gross basis, that is, the amounts billed to our customers are recorded as revenues,\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: and amounts paid to Google Network partners are recorded as cost of revenues. Where we are the principal, we control the advertising inventory before it is transferred to our customers. Our control is evidenced by our sole ability to monetize the advertising inventory before it is transferred to our customers and is further supported by us being primarily responsible to our customers and having a level of discretion in establishing pricing.\nTITLE: Google Subscriptions, Platforms, and Devices\nTEXT: Google subscriptions, platforms, and devices revenues consist of revenues from:\nTEXT: •consumer subscriptions, which primarily include revenues from YouTube services, such YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\nTITLE: •platforms, which primarily include revenues from Google Play from the sales of apps and in-app purchases;\nTEXT: •devices, which primarily include sales of the Pixel family of devices; and\nTEXT: Subscription revenues are recognized ratably over the period of the subscription, primarily monthly. We report revenues from Google Play app sales and in-app purchases on a net basis, because our performance obligation is to facilitate a transaction between app developers and end users, for which we earn a service fee.\nTITLE: Google Cloud Revenues\nTEXT: Google Cloud revenues consist of revenues from:\nTEXT: •Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as cybersecurity, databases, analytics, and AI offerings including our AI infrastructure, Vertex AI platform, and Duet AI for Google Cloud;\nTEXT: •Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Duet AI in Google Workspace; and\nTEXT: Our cloud services are generally provided on either a consumption or subscription basis and may have contract terms longer than a year. Revenues related to cloud services provided on a consumption basis are recognized when the customer utilizes the services, based on the quantity of services consumed. Revenues related to cloud services provided on a subscription basis are recognized ratably over the contract term as the customer receives and consumes the benefits of the cloud services.\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nbased, costs, other, expense, software, fair, value, such, revenues, certain\n\nTITLE: Arrangements with Multiple Performance Obligations\nTEXT: Our contracts with customers may include multiple performance obligations. For such arrangements, we allocate revenues to each performance obligation based on its relative standalone selling price. We generally determine standalone selling prices based on the prices charged to customers.\nTITLE: Customer Incentives and Credits\nTEXT: Certain customers receive cash-based incentives or credits, which are accounted for as variable consideration. We estimate these amounts based on the expected amount to be provided to customers and reduce revenues. We believe that there will not be significant changes to our estimates of variable consideration.\nTITLE: Sales Commissions\nTEXT: We expense sales commissions when incurred when the period of the expected benefit is one year or less. We recognize an asset for certain sales commissions and amortize if the expected benefit period is greater than one year. These costs are recorded within sales and marketing expenses.\nTITLE: Cost of Revenues\nTEXT: Cost of revenues consists of TAC and other costs of revenues.\nTEXT: ◦amounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and\nTEXT: ◦amounts paid to Google Network partners primarily for ads displayed on their properties.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: •Other cost of revenues includes:\nTEXT: ◦compensation expense related to our data centers and other operations such as content review and customer and product support;\nTEXT: ◦content acquisition costs, which are payments to content providers from whom we license video and other content for distribution on YouTube and Google Play (we pay fees to these content providers based on revenues generated or a flat fee);\nTEXT: ◦depreciation expense related to our technical infrastructure; and\nTEXT: ◦inventory and other costs related to the devices we sell.\nTITLE: Software Development Costs\nTEXT: We expense software development costs, including costs to develop software products or the software component of products to be sold, leased, or marketed to external users, before technological feasibility is reached. Technological feasibility is typically reached shortly before the release of such products. As a result, development costs that meet the criteria for capitalization were not material for the periods presented.\nTEXT: Software development costs also include costs to develop software to be used solely to meet internal needs and cloud-based applications used to deliver our services. We capitalize development costs related to these software applications once the preliminary project stage is complete and it is probable that the project will be completed and the software will be used to perform the function intended. Costs capitalized for developing such software applications were not material for the periods presented.\nTITLE: Stock-based Compensation\nTEXT: Stock-based compensation (SBC) primarily consists of Alphabet restricted stock units (RSUs). RSUs are equity classified and measured at the fair market value of the underlying stock at the grant date. We recognize RSU expense using the straight-line attribution method over the requisite service period and account for forfeitures as they occur.\nTEXT: For RSUs, shares are issued on the vesting dates net of the applicable statutory income tax withholding to be paid by us on behalf of our employees. As a result, fewer shares are issued than the number of RSUs outstanding, and the income tax withholding is recorded as a reduction to additional paid-in capital.\nTEXT: Additionally, SBC includes other stock-based awards, such as performance stock units (PSUs) that include market conditions and awards that may be settled in cash or the stock of certain Other Bet companies. PSUs and certain awards granted by Other Bet companies are equity classified and expense is recognized over the requisite service period. Certain awards granted by Other Bet companies are liability classified and remeasured at fair value through settlement. The fair value of awards granted by Other Bet companies is based on the equity valuation of the respective Other Bet company.\nTITLE: Advertising and Promotional Expenses\nTEXT: We expense advertising and promotional costs in the period in which they are incurred. For the years ended December 31, 2021, 2022, and 2023, advertising and promotional expenses totaled approximately $7.9 billion, $9.2 billion, and $8.7 billion, respectively.\nTITLE: Performance Fees\nTEXT: Performance fees refer to compensation arrangements with payouts based on realized returns from certain investments. We record compensation expense based on the estimated payouts on an ongoing basis, which may result in expense recognized before investment returns are realized and compensation is paid and may require the use of unobservable inputs. Performance fees are recorded as a component of OI&E.\nTITLE: Fair Value Measurements\nTEXT: Fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that is determined based on assumptions that market participants would use in pricing an asset or a liability. Assets and liabilities recorded at fair value are measured and classified in accordance with a three-tier fair value hierarchy based on the observability of the inputs available in the market used to measure fair value:\nTEXT: Level 1 - Observable inputs that reflect quoted prices (unadjusted) for identical assets or liabilities in active markets.\nTITLE: Table of ContentsAlphabet Inc.\n"
    },
    {
      "cluster": 9,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsecurities, marketable, value, fair, credit, financial, debt, instruments, equity, inputs\n\nTITLE: Alphabet Inc.\nTEXT: Level 2 - Inputs that are based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant inputs are observable in the market or can be derived from observable market data. Where applicable, these models project future cash flows and discount the future amounts to a present value using market-based observable inputs including interest rate curves, foreign exchange rates, and credit ratings.\nTEXT: Level 3 - Unobservable inputs that are supported by little or no market activities.\nTEXT: The fair value hierarchy requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The determination of fair value involves the use of appropriate valuation methods and relevant inputs into valuation models.\nTEXT: Our financial assets and liabilities that are measured at fair value on a recurring basis include cash equivalents, marketable securities, derivative financial instruments, and certain non-marketable debt securities. Our financial assets measured at fair value on a nonrecurring basis include non-marketable equity securities. Other financial assets and liabilities are carried at cost with fair value disclosed, if required.\nTEXT: We measure certain other instruments, including SBC awards settled in the stock of Other Bet companies, and certain assets and liabilities acquired in a business combination, also at fair value on a nonrecurring basis.\nTITLE: Financial Instruments\nTEXT: Our financial instruments include cash, cash equivalents, marketable and non-marketable securities, derivative financial instruments and accounts receivable.\nTITLE: Credit Risks\nTEXT: We are subject to credit risk primarily from cash equivalents, marketable debt securities, derivative financial instruments, including foreign exchange contracts, and accounts receivable. We manage our credit risk exposure through timely assessment of our counterparty creditworthiness, credit limits and use of collateral management. Foreign exchange contracts are transacted with various financial institutions with high credit standing. Accounts receivable are typically unsecured and are derived from revenues earned from customers located around the world. We manage our credit risk exposure by performing ongoing evaluations to determine customer credit and we limit the amount of credit we extend. We generally do not require collateral from our customers.\nTITLE: Cash Equivalents\nTEXT: We invest excess cash primarily in government bonds, corporate debt securities, mortgage-backed and asset-backed securities, time deposits, and money market funds.\nTITLE: Marketable Securities\nTEXT: We classify all marketable debt securities that have effective maturities of three months or less from the date of purchase as cash equivalents and those with effective maturities of greater than three months as marketable securities on our Consolidated Balance Sheets. We determine the appropriate classification of our investments in marketable debt securities at the time of purchase and reevaluate such designation at each balance sheet date. We have classified and accounted for our marketable debt securities as available-for-sale. After consideration of our risk versus reward objectives, as well as our liquidity requirements, we may sell these debt securities prior to their effective maturities. As we view these securities as available to support current operations, we classify highly liquid securities with maturities beyond 12 months as current assets under the caption marketable securities on the Consolidated Balance Sheets. We carry these securities at fair value, and report the unrealized gains and losses, net of taxes, as a component of stockholders’ equity, except for the changes in allowance for expected credit losses, which are recorded in OI&E. For certain marketable debt securities we have elected the fair value option, for which changes in fair value are recorded in OI&E. We determine any realized gains or losses on the sale of marketable debt securities on a specific identification method, and we record such gains and losses as a component of OI&E.\nTEXT: Our investments in marketable equity securities are measured at fair value with the related gains and losses, including unrealized, recognized in OI&E. We classify our marketable equity securities subject to long-term lock-up restrictions beyond 12 months as other non-current assets on the Consolidated Balance Sheets.\nTITLE: Non-Marketable Securities\nTEXT: Non-marketable securities primarily consist of equity securities. We account for non-marketable equity securities through which we exercise significant influence but do not have control over the investee under the equity method. All other non-marketable equity securities that we hold are primarily accounted for under the measurement alternative. Under the measurement alternative, the carrying value is measured at cost, less any impairment, plus or minus\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: changes resulting from observable price changes in orderly transactions for identical or similar investments of the same issuer. Adjustments are determined primarily based on a market approach as of the transaction date and are recorded as a component of OI&E.\nTEXT: Non-marketable securities that do not have effective contractual maturity dates are classified as other non-current assets on the Consolidated Balance Sheets.\nTITLE: Derivative Financial Instruments\nTEXT: See Note 3 for the accounting policy pertaining to derivative financial instruments.\n"
    },
    {
      "cluster": 10,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncredit, information, whether, loss, value, assets, accounts, receivable, which, equity\n\nTITLE: Accounts Receivable\nTEXT: Our payment terms for accounts receivable vary by the types and locations of our customers and the products or services offered. The term between invoicing and when payment is due is not significant. For certain products or services and customers, we require payment before the products or services are delivered to the customer. Additionally, accounts receivable includes amounts for services performed in advance of the right to invoice the customer.\nTEXT: We maintain an allowance for credit losses for accounts receivable, which is recorded as an offset to accounts receivable, and changes in such are classified as general and administrative expense in the Consolidated Statements of Income. We assess collectibility by reviewing accounts receivable on a collective basis where similar characteristics exist and on an individual basis when we identify specific customers with known disputes or collectibility issues. In determining the amount of the allowance for credit losses, we consider historical collectibility based on past due status and make judgments about the creditworthiness of customers based on ongoing credit evaluations. We also consider customer-specific information, current market conditions, and reasonable and supportable forecasts of future economic conditions.\nTITLE: Other\nTEXT: Our financial instruments also include debt and equity investments in companies with which we also entered into commercial arrangements at or near the same time. For these transactions, judgment is required in assessing the substance of the arrangements, including assessing whether the components of the arrangements should be accounted for as separate transactions under the applicable GAAP, and determining the value of the components of the arrangements, including the fair value of the investments. Additionally, if our investment in such companies becomes impaired, any remaining performance obligations would be reassessed and may be reduced.\nTITLE: Impairment of Investments\nTEXT: We periodically review our debt and non-marketable equity securities for impairment.\nTEXT: For debt securities in an unrealized loss position, we determine whether a credit loss exists. The credit loss is estimated by considering available information relevant to the collectibility of the security and information about past events, current conditions, and reasonable and supportable forecasts. Any credit loss is recorded as a charge to OI&E, not to exceed the amount of the unrealized loss. Unrealized losses other than the credit loss are recognized in AOCI. If we have an intent to sell, or if it is more likely than not that we will be required to sell a debt security in an unrealized loss position before recovery of its amortized cost basis, we will write down the security to its fair value and record the corresponding charge as a component of OI&E.\nTEXT: For non-marketable equity securities, including equity method investments, we consider whether impairment indicators exist by evaluating the companies' financial and liquidity position and access to capital resources, among other indicators. If the assessment indicates that the investment is impaired, we write down the investment to its fair value by recording the corresponding charge as a component of OI&E. We prepare quantitative measurements of the fair value of our equity investments using a market approach or an income approach.\nTITLE: Inventory\nTEXT: Inventory consists primarily of finished goods and is stated at the lower of cost and net realizable value. Cost is computed using the first-in, first-out method.\nTITLE: Variable Interest Entities\nTEXT: We determine at the inception of each arrangement whether an entity in which we have made an investment or in which we have other variable interests is considered a variable interest entity (VIE). We consolidate VIEs when we are the primary beneficiary. We are the primary beneficiary of a VIE when we have the power to direct activities that most significantly affect the economic performance of the VIE and have the obligation to absorb the majority of their losses\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: or benefits. If we are not the primary beneficiary in a VIE, we account for the investment or other variable interests in a VIE in accordance with applicable GAAP.\nTEXT: Periodically, we assess whether any changes in our interest or relationship with the entity affect our determination of whether the entity is a VIE and, if so, whether we are the primary beneficiary.\nTITLE: Property and Equipment\nTEXT: Property and equipment includes the following categories: land and buildings, information technology assets, construction in progress, leasehold improvements, and furniture and fixtures. Land and buildings include land, offices, data centers, and related building improvements. Information technology assets include servers and network equipment. Construction in progress is the construction or development of property and equipment that have not yet been placed in service.\nTEXT: Property and equipment are stated at cost less accumulated depreciation. Depreciation is recorded using the straight-line method over the estimated useful lives of the assets, which we regularly evaluate. Land is not depreciated. We depreciate buildings over periods of seven to 25 years. We depreciate information technology assets generally over a period of six years for servers and network equipment. We depreciate leasehold improvements over the shorter of the remaining lease term or the estimated useful lives of the assets. Depreciation for buildings, information technology assets, leasehold improvements, and furniture and fixtures commences once they are ready for our intended use.\n"
    },
    {
      "cluster": 11,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nlease, assets, liabilities, payments, when, recognized, goodwill, based, value, included\n\nTITLE: Goodwill\nTEXT: We allocate goodwill to reporting units based on the expected benefit from the business combination. We evaluate our reporting units periodically, as well as when changes in our operating segments occur. For changes in reporting units, we reassign goodwill using a relative fair value allocation approach. We test our goodwill for impairment at least annually, or more frequently if events or changes in circumstances indicate that the asset may be impaired. Goodwill impairments were not material for the periods presented.\nTITLE: Leases\nTEXT: We determine if an arrangement is a lease at inception. Our lease agreements generally contain lease and non-lease components. Payments under our lease arrangements are primarily fixed. Non-lease components primarily include payments for maintenance and utilities. We combine fixed payments for non-lease components with lease payments and account for them together as a single lease component which increases the amount of our lease assets and liabilities.\nTEXT: Certain lease agreements contain variable payments, which are expensed as incurred and not included in the lease assets and liabilities. These amounts primarily include payments affected by the Consumer Price Index, and payments for maintenance and utilities.\nTEXT: Lease assets and liabilities are recognized at the present value of the future lease payments at the lease commencement date. The interest rate used to determine the present value of the future lease payments is our incremental borrowing rate, because the interest rate implicit in our leases is not readily determinable. Our incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments, and in economic environments where the leased asset is located. Our lease terms include periods under options to extend or terminate the lease when it is reasonably certain that we will exercise that option. We generally use the base, non-cancelable, lease term when determining the lease assets and liabilities. Lease assets also include any prepaid lease payments and lease incentives.\nTEXT: Operating lease assets and liabilities are included on our Consolidated Balance Sheets. The current portion of our operating lease liabilities is included in accrued expenses and other current liabilities, and the long-term portion is included in operating lease liabilities. Finance lease assets are included in property and equipment, net. Finance lease liabilities are included in accrued expenses and other current liabilities or long-term debt.\nTEXT: Operating lease expense (excluding variable lease costs) is recognized on a straight-line basis over the lease term.\nTITLE: Impairment of Long-Lived Assets\nTEXT: We review leases, property and equipment, and intangible assets, excluding goodwill, for impairment when events or changes in circumstances indicate the carrying amount may not be recoverable. The evaluation is performed at the lowest level of identifiable cash flows independent of other assets. We measure recoverability of these assets by comparing the carrying amounts to the future undiscounted cash flows that the assets or the asset group are expected\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: to generate. If the carrying value of the assets or asset group is not recoverable, the impairment recognized is measured as the amount by which the carrying value exceeds its fair value.\nTITLE: Income Taxes\nTEXT: We account for income taxes using the asset and liability method, under which we recognize the amount of taxes payable or refundable for the current year and deferred tax assets and liabilities for the future tax consequences of events that have been recognized in our financial statements or tax returns. We measure current and deferred tax assets and liabilities based on provisions of enacted tax law. We evaluate the likelihood of future realization of our deferred tax assets based on all available evidence and establish a valuation allowance to reduce deferred tax assets when it is more likely than not that they will not be realized or release a valuation allowance to increase deferred tax assets when it is more likely than not that they will be realized. We have elected to account for the tax effects of the global intangible low tax Income provision as a current period expense.\nTEXT: We recognize the financial statement effects of a tax position when it is more likely than not that, based on technical merits, the position will be sustained upon examination. The tax benefits of the position recognized in the financial statements are then measured based on the largest amount of benefit that is greater than 50% likely to be realized upon settlement with a taxing authority. In addition, we recognize interest and penalties related to unrecognized tax benefits as a component of the income tax provision.\nTITLE: Business Combinations\nTEXT: We include the results of operations of the businesses that we acquire as of the acquisition date. We allocate the purchase price of the acquisitions to the assets acquired and liabilities assumed based on their estimated fair values, except for revenue contracts acquired, which are recognized in accordance with our revenue recognition policy. The excess of the purchase price over the fair values of identifiable assets and liabilities is recorded as goodwill. Acquisition-related expenses are recognized separately from the business combination and are expensed as incurred.\n"
    },
    {
      "cluster": 12,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nrevenues, google, revenue, december, disclosures, periods, backlog, financial, exchange, annual\n\nTITLE: Foreign Currency\nTEXT: We translate the financial statements of our international subsidiaries to U.S. dollars using month-end exchange rates for assets and liabilities, and average rates for the annual period derived from month-end exchange rates for revenues, costs, and expenses. We record translation gains and losses in AOCI as a component of stockholders’ equity. We reflect net foreign exchange transaction gains and losses resulting from the conversion of the transaction currency to functional currency as a component of foreign currency exchange gain (loss) in OI&E.\nTITLE: Recent Accounting Pronouncements\nTEXT: In November 2023, the Financial Standards Accounting Board (FASB) issued Accounting Standards Update (ASU) 2023-07 \"Segment Reporting (Topic 280):Improvements to Reportable Segment Disclosures\" which expands annual and interim disclosure requirements for reportable segments, primarily through enhanced disclosures about significant segment expenses. ASU 2023-07 is effective for our annual periods beginning January 1, 2024, and for interim periods beginning January 1, 2025, with early adoption permitted. We are currently evaluating the potential effect that the updated standard will have on our financial statement disclosures.\nTEXT: In December 2023, the FASB issued ASU 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes, specifically related to the rate reconciliation and income taxes paid. ASU 2023-09 is effective for our annual periods beginning January 1, 2025, with early adoption permitted. We are currently evaluating the potential effect that the updated standard will have on our financial statement disclosures.\nTITLE: Prior Period ReclassificationsCertain amounts in prior periods have been reclassified to conform with current period presentation.\nTITLE: Prior Period Reclassifications\nTEXT: Certain amounts in prior periods have been reclassified to conform with current period presentation.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Disaggregated Revenues\nTEXT: The following table presents revenues disaggregated by type (in millions):\nTEXT: Year Ended December 31,202120222023Google Search & other$148,951 $162,450 $175,033 YouTube ads28,845 29,243 31,510 Google Network31,701 32,780 31,312 Google advertising209,497 224,473 237,855 Google subscriptions, platforms, and devices28,032 29,055 34,688 Google Services total237,529 253,528 272,543 Google Cloud19,206 26,280 33,088 Other Bets753 1,068 1,527 Hedging gains (losses)149 1,960 236 Total revenues$257,637 $282,836 $307,394\nTABLE: TABLE: 2021 2022 2023; Google Search & other $ 148,951 $ 162,450 $ 175,033; YouTube ads 28,845 29,243 31,510; Google Network 31,701 32,780 31,312; Google advertising 209,497 224,473 237,855; Google subscriptions, platforms, and devices 28,032 29,055 34,688; Google Services total 237,529 253,528 272,543; Google Cloud 19,206 26,280 33,088; Other Bets 753 1,068 1,527; Hedging gains (losses) 149 1,960 236; Total revenues $ 257,637 $ 282,836 $ 307,394.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: Google subscriptions, platforms, and devices\nTEXT: No individual customer or groups of affiliated customers represented more than 10% of our revenues in 2021, 2022, or 2023.\nTEXT: The following table presents revenues disaggregated by geography, based on the addresses of our customers (in millions):\nTEXT: Year Ended December 31, 202120222023United States$117,854 46 %$134,814 48 %$146,286 47 %EMEA(1)79,107 31 82,062 29 91,038 30 APAC(1)46,123 18 47,024 16 51,514 17 Other Americas(1)14,404 5 16,976 6 18,320 6 Hedging gains (losses)149 0 1,960 1 236 0 Total revenues$257,637 100 %$282,836 100 %$307,394 100 %\nTABLE: TABLE: 2021 2022 2023; United States $ 117,854 46 % $ 134,814 48 % $ 146,286 47 %; EMEA(1) 79,107 31 82,062 29 91,038 30; APAC(1) 46,123 18 47,024 16 51,514 17; Other Americas(1) 14,404 5 16,976 6 18,320 6; Hedging gains (losses) 149 0 1,960 1 236 0; Total revenues $ 257,637 100 % $ 282,836 100 % $ 307,394 100 %.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: (1) Regions represent Europe, the Middle East, and Africa (EMEA); Asia-Pacific (APAC); and Canada and Latin America (\"Other Americas\").\nTITLE: Revenue Backlog\nTEXT: As of December 31, 2023, we had $74.1 billion of remaining performance obligations (“revenue backlog”), primarily related to Google Cloud. Our revenue backlog represents commitments in customer contracts for future services that have not yet been recognized as revenue. The estimated revenue backlog and timing of revenue recognition for these commitments is largely driven by our ability to deliver in accordance with relevant contract terms and when our customers utilize services. We expect to recognize approximately half of the revenue backlog as revenues over the next 24 months with the remaining to be recognized thereafter. Revenue backlog includes related deferred revenue currently recorded as well as amounts that will be invoiced in future periods, and excludes contracts with an original expected term of one year or less and cancellable contracts.\nTITLE: Deferred Revenues\nTEXT: We record deferred revenues when cash payments are received or due in advance of our performance, including amounts which are refundable. Deferred revenues primarily relate to Google Cloud and Google subscriptions, platforms, and devices. Total deferred revenue as of December 31, 2022 was $4.5 billion, of which $2.4 billion was recognized as revenues for the year ended December 31, 2023.\nTITLE: Fair Value Measurements\nTITLE: Investments Measured at Fair Value on a Recurring Basis\nTEXT: Cash, cash equivalents, and marketable equity securities are measured at fair value and classified within Level 1\nTITLE: Table of ContentsAlphabet Inc.\n"
    },
    {
      "cluster": 13,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nvalue, fair, securities, recorded, debt, marketable, total, unrealized, cash, other\n\nTITLE: Alphabet Inc.\nTEXT: and Level 2 in the fair value hierarchy, because we use quoted prices for identical assets in active markets or inputs that are based upon quoted prices for similar instruments in active markets.\nTEXT: Debt securities are measured at fair value and classified within Level 2 in the fair value hierarchy, because we use quoted market prices to the extent available or alternative pricing sources and models utilizing market observable inputs to determine fair value. For certain marketable debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. The fair value option was elected for these securities to align with the unrealized gains and losses from related derivative contracts.\nTEXT: The following tables summarize our cash, cash equivalents, and marketable securities measured at fair value on a recurring basis (in millions):\nTEXT: As of December 31, 2022Fair Value HierarchyAdjusted CostGross Unrealized GainsGross Unrealized LossesFair ValueCash and Cash EquivalentsMarketable SecuritiesFair value changes recorded in other comprehensive incomeTime depositsLevel 2$5,297 $0 $0 $5,297 $5,293 $4 Government bondsLevel 241,03664 (2,045)39,055 283 38,772 Corporate debt securitiesLevel 228,5788 (1,569)27,017 1 27,016 Mortgage-backed and asset-backed securitiesLevel 216,1765 (1,242)14,939 0 14,939 Total investments with fair value change reflected in other comprehensive income(1)$91,087 $77 $(4,856)$86,308 $5,577 $80,731 Fair value adjustments recorded in net incomeMoney market fundsLevel 1$7,234 $7,234 $0 Current marketable equity securities(2)Level 14,013 0 4,013 Mutual fundsLevel 2339 0 339 Government bondsLevel 21,877 440 1,437 Corporate debt securitiesLevel 23,744 65 3,679 Mortgage-backed and asset-backed securitiesLevel 21,686 2 1,684 Total investments with fair value change recorded in net income$18,893 $7,741 $11,152 Cash0 8,561 0 Total$91,087 $77 $(4,856)$105,201 $21,879 $91,883\nTABLE: TABLE: Fair Value Hierarchy Adjusted Cost Gross Unrealized Gains Gross Unrealized Losses Fair Value Cash and Cash Equivalents Marketable Securities; Time deposits Level 2 $ 5,297 $ 0 $ 0 $ 5,297 $ 5,293 $ 4; Government bonds Level 2 41,036 64 (2,045) 39,055 283 38,772; Corporate debt securities Level 2 28,578 8 (1,569) 27,017 1 27,016; Mortgage-backed and asset-backed securities Level 2 16,176 5 (1,242) 14,939 0 14,939; Total investments with fair value change reflected in other comprehensive income(1) $ 91,087 $ 77 $ (4,856) $ 86,308 $ 5,577 $ 80,731; Money market funds Level 1 $ 7,234 $ 7,234 $ 0; Current marketable equity securities(2) Level 1 4,013 0 4,013; Mutual funds Level 2 339 0 339; Government bonds Level 2 1,877 440 1,437; Corporate debt securities Level 2 3,744 65 3,679; Mortgage-backed and asset-backed securities Level 2 1,686 2 1,684; Total investments with fair value change recorded in net income $ 18,893 $ 7,741 $ 11,152; Cash 0 8,561 0; Total $ 91,087 $ 77 $ (4,856) $ 105,201 $ 21,879 $ 91,883.\nTITLE: As of December 31, 2022\nTITLE: Fair Value HierarchyAdjusted CostGross Unrealized GainsGross Unrealized LossesFair ValueCash and Cash EquivalentsMarketable Securities\nTITLE: Fair Value Hierarchy\nTITLE: Adjusted Cost\nTITLE: Gross Unrealized Gains\nTITLE: Gross Unrealized Losses\nTITLE: Fair Value\nTITLE: Cash and Cash Equivalents\nTITLE: Marketable Securities\nTITLE: Fair value changes recorded in other comprehensive income\nTEXT: Total investments with fair value change reflected in other comprehensive income(1)\nTITLE: Fair value adjustments recorded in net income\nTEXT: Current marketable equity securities(2)\nTEXT: Total investments with fair value change recorded in net income\nTEXT: (1)Represents gross unrealized gains and losses for debt securities recorded to AOCI.\nTEXT: (2)The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $803 million as of December 31, 2022 is included within other non-current assets.\nTITLE: Table of ContentsAlphabet Inc.\n"
    },
    {
      "cluster": 14,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nvalue, fair, securities, marketable, equity, investments, total, december, recorded, other\n\nTITLE: Alphabet Inc.\nTEXT: As of December 31, 2023Fair Value HierarchyAdjusted CostGross Unrealized GainsGross Unrealized LossesFair ValueCash and Cash EquivalentsMarketable SecuritiesFair value changes recorded in other comprehensive incomeTime depositsLevel 2$2,628 $0 $0 $2,628 $2,628 $0 Government bondsLevel 238,106 233 (679)37,660 1,993 35,667 Corporate debt securitiesLevel 222,457 112 (637)21,932 0 21,932 Mortgage-backed and asset-backed securitiesLevel 217,243 88 (634)16,697 0 16,697 Total investments with fair value change reflected in other comprehensive income(1)$80,434 $433 $(1,950)$78,917 $4,621 $74,296 Fair value adjustments recorded in net incomeMoney market fundsLevel 1$6,480 $6,480 $0 Current marketable equity securities(2)Level 14,2820 4,282Mutual fundsLevel 23110 311Government bondsLevel 21,952347 1,605Corporate debt securitiesLevel 23,78291 3,691Mortgage-backed and asset-backed securitiesLevel 22,6830 2,683Total investments with fair value change recorded in net income$19,490 $6,918 $12,572 Cash0 12,509 0 Total$80,434 $433 $(1,950)$98,407 $24,048 $86,868\nTABLE: TABLE: Fair Value Hierarchy Adjusted Cost Gross Unrealized Gains Gross Unrealized Losses Fair Value Cash and Cash Equivalents Marketable Securities; Time deposits Level 2 $ 2,628 $ 0 $ 0 $ 2,628 $ 2,628 $ 0; Government bonds Level 2 38,106 233 (679) 37,660 1,993 35,667; Corporate debt securities Level 2 22,457 112 (637) 21,932 0 21,932; Mortgage-backed and asset-backed securities Level 2 17,243 88 (634) 16,697 0 16,697; Total investments with fair value change reflected in other comprehensive income(1) $ 80,434 $ 433 $ (1,950) $ 78,917 $ 4,621 $ 74,296; Money market funds Level 1 $ 6,480 $ 6,480 $ 0; Current marketable equity securities(2) Level 1 4,282 0 4,282; Mutual funds Level 2 311 0 311; Government bonds Level 2 1,952 347 1,605; Corporate debt securities Level 2 3,782 91 3,691; Mortgage-backed and asset-backed securities Level 2 2,683 0 2,683; Total investments with fair value change recorded in net income $ 19,490 $ 6,918 $ 12,572; Cash 0 12,509 0; Total $ 80,434 $ 433 $ (1,950) $ 98,407 $ 24,048 $ 86,868.\nTITLE: As of December 31, 2023\nTITLE: Fair Value HierarchyAdjusted CostGross Unrealized GainsGross Unrealized LossesFair ValueCash and Cash EquivalentsMarketable Securities\nTITLE: Fair Value Hierarchy\nTITLE: Adjusted Cost\nTITLE: Gross Unrealized Gains\nTITLE: Gross Unrealized Losses\nTITLE: Fair Value\nTITLE: Cash and Cash Equivalents\nTITLE: Marketable Securities\nTITLE: Fair value changes recorded in other comprehensive income\nTEXT: Total investments with fair value change reflected in other comprehensive income(1)\nTITLE: Fair value adjustments recorded in net income\nTEXT: Current marketable equity securities(2)\nTEXT: Total investments with fair value change recorded in net income\nTEXT: (1)Represents gross unrealized gains and losses for debt securities recorded to AOCI.\nTEXT: (2)The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $1.4 billion as of December 31, 2023 is included within other non-current assets.\nTITLE: Investments Measured at Fair Value on a Nonrecurring Basis\nTEXT: Our non-marketable equity securities are investments in privately held companies without readily determinable market values. The carrying value of our non-marketable equity securities is adjusted to fair value upon observable transactions for identical or similar investments of the same issuer or impairment. Non-marketable equity securities that have been remeasured during the period based on observable transactions are classified within Level 2 or Level 3 in the fair value hierarchy because we estimate the value based on valuation methods, including option pricing models, market comparable approach, and common stock equivalent method, which may include a combination of the observable transaction price at the transaction date and other unobservable inputs including volatility, expected time to exit, risk free rate, and the rights, and obligations of the securities we hold. These inputs significantly vary based on investment type. The fair value of non-marketable equity securities that have been remeasured due to impairment are classified within Level 3.\nTEXT: As of December 31, 2023, the carrying value of our non-marketable equity securities was $28.8 billion, of which $13.7 billion were remeasured at fair value during the year ended December 31, 2023, and primarily classified within Level 2 of the fair value hierarchy at the time of measurement.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Debt Securities\nTEXT: The following table summarizes the estimated fair value of investments in available-for-sale marketable debt securities by effective contractual maturity dates (in millions):\nTEXT: As of December 31, 2023Due in one year or less$11,231 Due in one year through five years41,477 Due in five years through 10 years15,351 Due after 10 years14,216 Total$82,275\nTABLE: TABLE: Due in one year or less $ 11,231; Due in one year through five years 41,477; Due in five years through 10 years 15,351; Due after 10 years 14,216; Total $ 82,275.\n"
    },
    {
      "cluster": 15,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsecurities, debt, losses, loss, december, gain, equity, marketable, fair, gains\n\nTITLE: As of December 31, 2023\nTEXT: Due in one year through five years\nTEXT: Due in five years through 10 years\nTEXT: The following tables present fair values and gross unrealized losses recorded to AOCI, aggregated by investment category and the length of time that individual securities have been in a continuous loss position (in millions):\nTEXT: As of December 31, 2022 Less than 12 Months12 Months or GreaterTotal Fair ValueUnrealizedLossFair ValueUnrealizedLossFair ValueUnrealizedLossGovernment bonds$21,039 $(1,004)$13,438 $(1,041)$34,477 $(2,045)Corporate debt securities11,228 (440)15,125 (1,052)26,353 (1,492)Mortgage-backed and asset-backed securities7,725 (585)6,964 (657)14,689 (1,242)Total$39,992 $(2,029)$35,527 $(2,750)$75,519 $(4,779)\nTABLE: TABLE: Less than 12 Months 12 Months or Greater Total; Fair Value UnrealizedLoss Fair Value UnrealizedLoss Fair Value UnrealizedLoss; Government bonds $ 21,039 $ (1,004) $ 13,438 $ (1,041) $ 34,477 $ (2,045); Corporate debt securities 11,228 (440) 15,125 (1,052) 26,353 (1,492); Mortgage-backed and asset-backed securities 7,725 (585) 6,964 (657) 14,689 (1,242); Total $ 39,992 $ (2,029) $ 35,527 $ (2,750) $ 75,519 $ (4,779).\nTITLE: As of December 31, 2022\nTITLE: Less than 12 Months12 Months or GreaterTotal\nTITLE: Less than 12 Months\nTITLE: 12 Months or Greater\nTITLE: Total\nTITLE: Fair ValueUnrealizedLossFair ValueUnrealizedLossFair ValueUnrealizedLoss\nTITLE: Fair Value\nTITLE: UnrealizedLoss\nTITLE: Fair Value\nTITLE: UnrealizedLoss\nTITLE: Fair Value\nTITLE: UnrealizedLoss\nTEXT: As of December 31, 2023 Less than 12 Months12 Months or GreaterTotal Fair ValueUnrealizedLossFair ValueUnrealizedLossFair ValueUnrealizedLossGovernment bonds$1,456 $(22)$13,897 $(657)$15,353 $(679)Corporate debt securities827 (5)15,367 (592)16,194 (597)Mortgage-backed and asset-backed securities2,945 (26)7,916 (608)10,861 (634)Total$5,228 $(53)$37,180 $(1,857)$42,408 $(1,910)\nTABLE: TABLE: Less than 12 Months 12 Months or Greater Total; Fair Value UnrealizedLoss Fair Value UnrealizedLoss Fair Value UnrealizedLoss; Government bonds $ 1,456 $ (22) $ 13,897 $ (657) $ 15,353 $ (679); Corporate debt securities 827 (5) 15,367 (592) 16,194 (597); Mortgage-backed and asset-backed securities 2,945 (26) 7,916 (608) 10,861 (634); Total $ 5,228 $ (53) $ 37,180 $ (1,857) $ 42,408 $ (1,910).\nTITLE: As of December 31, 2023\nTITLE: Less than 12 Months12 Months or GreaterTotal\nTITLE: Less than 12 Months\nTITLE: 12 Months or Greater\nTITLE: Total\nTITLE: Fair ValueUnrealizedLossFair ValueUnrealizedLossFair ValueUnrealizedLoss\nTITLE: Fair Value\nTITLE: UnrealizedLoss\nTITLE: Fair Value\nTITLE: UnrealizedLoss\nTITLE: Fair Value\nTITLE: UnrealizedLoss\nTEXT: We determine realized gains or losses on the sale or extinguishment of debt securities on a specific identification method.The following table summarizes gains and losses for debt securities, reflected as a component of OI&E (in millions):\nTEXT: Year Ended December 31, 202120222023Unrealized gain (loss) on fair value option debt securities$(122)$(557)$386 Gross realized gain on debt securities432 103 182 Gross realized loss on debt securities(329)(1,588)(1,833)(Increase) decrease in allowance for credit losses(91)(22)50 Total gain (loss) on debt securities recognized in other income (expense), net$(110)$(2,064)$(1,215)\nTABLE: TABLE: 2021 2022 2023; Unrealized gain (loss) on fair value option debt securities $ (122) $ (557) $ 386; Gross realized gain on debt securities 432 103 182; Gross realized loss on debt securities (329) (1,588) (1,833); (Increase) decrease in allowance for credit losses (91) (22) 50; Total gain (loss) on debt securities recognized in other income (expense), net $ (110) $ (2,064) $ (1,215).\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: Unrealized gain (loss) on fair value option debt securities\nTEXT: (Increase) decrease in allowance for credit losses\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Equity Investments\nTEXT: The carrying value of equity securities is measured as the total initial cost plus the cumulative net gain (loss). Gains and losses, including impairments, are included as a component of OI&E in the Consolidated Statements of Income. See Note 7 for further details on OI&E.\nTEXT: The carrying values for marketable and non-marketable equity securities are summarized below (in millions):\nTEXT: As of December 31, 2022As of December 31, 2023Marketable Equity SecuritiesNon-Marketable Equity SecuritiesTotalMarketable Equity SecuritiesNon-Marketable Equity SecuritiesTotalTotal initial cost$5,764 $16,157 $21,921 $5,418 $17,616 $23,034 Cumulative net gain (loss)(1)(608)12,372 11,764 555 11,150 11,705 Carrying value$5,156 $28,529 $33,685 $5,973 $28,766 $34,739\nTABLE: TABLE: As of December 31, 2022 As of December 31, 2023; Marketable Equity Securities Non-Marketable Equity Securities Total Marketable Equity Securities Non-Marketable Equity Securities Total; Total initial cost $ 5,764 $ 16,157 $ 21,921 $ 5,418 $ 17,616 $ 23,034; Cumulative net gain (loss)(1) (608) 12,372 11,764 555 11,150 11,705; Carrying value $ 5,156 $ 28,529 $ 33,685 $ 5,973 $ 28,766 $ 34,739.\nTITLE: As of December 31, 2022As of December 31, 2023\nTITLE: As of December 31, 2022\nTITLE: As of December 31, 2023\nTITLE: Marketable Equity SecuritiesNon-Marketable Equity SecuritiesTotalMarketable Equity SecuritiesNon-Marketable Equity SecuritiesTotal\nTITLE: Marketable Equity Securities\nTITLE: Non-Marketable Equity Securities\nTITLE: Total\nTITLE: Marketable Equity Securities\nTITLE: Non-Marketable Equity Securities\nTITLE: Total\nTEXT: (1)Non-marketable equity securities cumulative net gain (loss) is comprised of $16.8 billion gains and $4.5 billion losses (including impairments) as of December 31, 2022 and $18.1 billion gains and $6.9 billion losses (including impairments) as of December 31, 2023.\n"
    },
    {
      "cluster": 16,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nequity, securities, gains, losses, hedge, gain, period, value, foreign, marketable\n\nTITLE: Gains and Losses on Marketable and Non-marketable Equity Securities\nTEXT: Gains and losses (including impairments), net, for marketable and non-marketable equity securities included in OI&E are summarized below (in millions):\nTEXT: Year Ended December 31, 202120222023Realized net gain (loss) on equity securities sold during the period$1,196 $(442)$690 Unrealized net gain (loss) on marketable equity securities1,335 (3,242)790 Unrealized net gain (loss) on non-marketable equity securities(1)9,849 229 (1,088)Total gain (loss) on equity securities in other income (expense), net$12,380 $(3,455)$392\nTABLE: TABLE: 2021 2022 2023; Realized net gain (loss) on equity securities sold during the period $ 1,196 $ (442) $ 690; Unrealized net gain (loss) on marketable equity securities 1,335 (3,242) 790; Unrealized net gain (loss) on non-marketable equity securities(1) 9,849 229 (1,088); Total gain (loss) on equity securities in other income (expense), net $ 12,380 $ (3,455) $ 392.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: Unrealized net gain (loss) on non-marketable equity securities(1)\nTEXT: (1)Unrealized gain (loss) on non-marketable equity securities accounted for under the measurement alternative is comprised of $10.0 billion, $3.3 billion, and $1.8 billion of upward adjustments as of December 31, 2021, 2022, and 2023, respectively, and $122 million, $3.0 billion, and $2.9 billion of downward adjustments (including impairments) as of December 31, 2021, 2022, and 2023, respectively.\nTEXT: In the table above, realized net gain (loss) on equity securities sold during the period reflects the difference between the sale proceeds and the carrying value of the equity securities at the beginning of the period or the purchase date, if later.\nTEXT: Cumulative net gains (losses) on equity securities sold during the period, which is summarized in the following table (in millions), represents the total net gains (losses) recognized after the initial purchase date of the equity security sold during the period. While these net gains (losses) may have been reflected in periods prior to the period of sale, we believe they are important supplemental information as they reflect the economic net gains (losses) on the securities sold during the period. Cumulative net gains (losses) are calculated as the difference between the sale price and the initial purchase price for the equity security sold during the period.\nTEXT: Equity Securities Sold During the Year Ended December 31, 20222023Total sale price$1,784 $1,981 Total initial cost937 1,512 Cumulative net gains (losses)$847 $469\nTABLE: TABLE: 2022 2023; Total sale price $ 1,784 $ 1,981; Total initial cost 937 1,512; Cumulative net gains (losses) $ 847 $ 469.\nTITLE: Equity Securities Sold During the Year Ended December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTITLE: Equity Securities Accounted for Under the Equity Method\nTEXT: As of December 31, 2022 and 2023, equity securities accounted for under the equity method had a carrying value of approximately $1.5 billion and $1.7 billion, respectively. Our share of gains and losses, including impairments, are included as a component of OI&E, in the Consolidated Statements of Income. See Note 7 for further details on OI&E.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Derivative Financial Instruments\nTEXT: We use derivative instruments to manage risks relating to our ongoing business operations. The primary risk managed is foreign exchange risk. We use foreign currency contracts to reduce the risk that our cash flows, earnings, and investment in foreign subsidiaries will be adversely affected by foreign currency exchange rate fluctuations. We also enter into derivative instruments to partially offset our exposure to other risks and enhance investment returns.\nTEXT: We recognize derivative instruments in the Consolidated Balance Sheets at fair value and classify the derivatives primarily within Level 2 in the fair value hierarchy. We present our collar contracts (an option strategy comprised of a combination of purchased and written options) at net fair values and present all other derivatives at gross fair values. The accounting treatment for derivatives is based on the intended use and hedge designation.\nTITLE: Cash Flow Hedges\nTEXT: We designate foreign currency forward and option contracts (including collars) as cash flow hedges to hedge certain forecasted revenue transactions denominated in currencies other than the U.S. dollar. These contracts have maturities of 24 months or less.\nTEXT: Cash flow hedge amounts included in the assessment of hedge effectiveness are deferred in AOCI and subsequently reclassified to revenue when the hedged item is recognized in earnings. We exclude forward points and time value from our assessment of hedge effectiveness and amortize them on a straight-line basis over the life of the hedging instrument in revenues. The difference between fair value changes of the excluded component and the amount amortized to revenues is recorded in AOCI.\nTEXT: As of December 31, 2023, the net accumulated gain on our foreign currency cash flow hedges before tax effect was $47 million, which is expected to be reclassified from AOCI into revenues within the next 12 months.\nTITLE: Fair Value Hedges\nTEXT: We designate foreign currency forward contracts as fair value hedges to hedge foreign currency risks for our marketable securities denominated in currencies other than the U.S. dollar. Fair value hedge amounts included in the assessment of hedge effectiveness are recognized in OI&E, along with the offsetting gains and losses of the related hedged items. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\n"
    },
    {
      "cluster": 17,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nforeign, derivatives, hedging, instruments, other, designated, contracts, investment, currency, hedge\n\nTITLE: Net Investment Hedges\nTEXT: We designate foreign currency forward contracts as net investment hedges to hedge the foreign currency risks related to our investment in foreign subsidiaries. Net investment hedge amounts included in the assessment of hedge effectiveness are recognized in AOCI along with the foreign currency translation adjustment. We exclude forward points from the assessment of hedge effectiveness and recognize changes in the excluded component in OI&E.\nTITLE: Other Derivatives\nTEXT: We enter into foreign currency forward and option contracts that are not designated as hedging instruments to hedge intercompany transactions and other monetary assets or liabilities denominated in currencies other than the functional currency of a subsidiary. Gains and losses on these derivatives that are not designated as accounting hedges are primarily recorded in OI&E along with the foreign currency gains and losses on monetary assets and liabilities.\nTEXT: We also use derivatives not designated as hedging instruments to manage risks relating to interest rates, commodity prices, credit exposures, and to enhance investment returns. From time to time, we enter into derivatives to hedge the market price risk on certain of our marketable equity securities. Gains and losses arising from other derivatives are primarily reflected within the “other” component of OI&E. See Note 7 for further details.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: The gross notional amounts of outstanding derivative instruments were as follows (in millions):\nTEXT: As of December 31,20222023Derivatives designated as hedging instruments:Foreign exchange contractsCash flow hedges $15,972 $18,039 Fair value hedges$2,117 $2,065 Net investment hedges$8,751 $9,472 Derivatives not designated as hedging instruments:Foreign exchange contracts$34,979 $39,722 Other contracts$7,932 $10,818\nTABLE: TABLE: 2022 2023; Cash flow hedges $ 15,972 $ 18,039; Fair value hedges $ 2,117 $ 2,065; Net investment hedges $ 8,751 $ 9,472; Foreign exchange contracts $ 34,979 $ 39,722; Other contracts $ 7,932 $ 10,818.\nTITLE: As of December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTITLE: Derivatives designated as hedging instruments:\nTITLE: Derivatives not designated as hedging instruments:\nTEXT: The fair values of outstanding derivative instruments were as follows (in millions):\nTEXT: As of December 31, 2022As of December 31, 2023 Assets(1)Liabilities(2)Assets(1)Liabilities(2)Derivatives designated as hedging instruments: Foreign exchange contracts$271 $556 $205 $242 Derivatives not designated as hedging instruments: Foreign exchange contracts365 207 134 156 Other contracts40 47 114 47 Total derivatives not designated as hedging instruments405 254 248 203 Total$676 $810 $453 $445\nTABLE: TABLE: As of December 31, 2022 As of December 31, 2023; Assets(1) Liabilities(2) Assets(1) Liabilities(2); Foreign exchange contracts $ 271 $ 556 $ 205 $ 242; Foreign exchange contracts 365 207 134 156; Other contracts 40 47 114 47; Total derivatives not designated as hedging instruments 405 254 248 203; Total $ 676 $ 810 $ 453 $ 445.\nTITLE: As of December 31, 2022As of December 31, 2023\nTITLE: As of December 31, 2022\nTITLE: As of December 31, 2023\nTITLE: Assets(1)Liabilities(2)Assets(1)Liabilities(2)\nTITLE: Assets(1)\nTITLE: Liabilities(2)\nTITLE: Assets(1)\nTITLE: Liabilities(2)\nTITLE: Derivatives designated as hedging instruments:\nTITLE: Derivatives not designated as hedging instruments:\nTEXT: (1) Derivative assets are recorded as other current and non-current assets in the Consolidated Balance Sheets.\nTEXT: (2) Derivative liabilities are recorded as accrued expenses and other liabilities, current and non-current in the Consolidated Balance Sheets.\nTEXT: The gains (losses) on derivatives in cash flow hedging and net investment hedging relationships recognized in other comprehensive income (OCI) are summarized below (in millions):\nTEXT: Year Ended December 31,202120222023Derivatives in cash flow hedging relationship:Foreign exchange contractsAmount included in the assessment of effectiveness$806 $1,699 $90 Amount excluded from the assessment of effectiveness48 (188)84 Derivatives in net investment hedging relationship:Foreign exchange contractsAmount included in the assessment of effectiveness754 608 (287)Total$1,608 $2,119 $(113)\nTABLE: TABLE: 2021 2022 2023; Amount included in the assessment of effectiveness $ 806 $ 1,699 $ 90; Amount excluded from the assessment of effectiveness 48 (188) 84; Amount included in the assessment of effectiveness 754 608 (287); Total $ 1,608 $ 2,119 $ (113).\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTITLE: Derivatives in cash flow hedging relationship:\nTITLE: Derivatives in net investment hedging relationship:\nTITLE: Table of ContentsAlphabet Inc.\n"
    },
    {
      "cluster": 18,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, amounts, consolidated, collateral, income, instruments, balance, derivatives, arrangements, december\n\nTITLE: Alphabet Inc.\nTEXT: The table below presents the gains (losses) of our derivatives on the Consolidated Statements of Income: (in millions):\nTEXT: Year Ended December 31,202120222023RevenuesOther income (expense), netRevenuesOther income (expense), netRevenuesOther income (expense), netTotal amounts in the Consolidated Statements of Income$257,637 $12,020 $282,836 $(3,514)$307,394 $1,424 Effect of cash flow hedges:Foreign exchange contractsAmount reclassified from AOCI to income$165 $0 $2,046 $0 $213 $0 Amount excluded from the assessment of effectiveness (amortized)(16)0 (85)0 24 0 Effect of fair value hedges:Foreign exchange contractsHedged items0 (95)0 (162)0 59 Derivatives designated as hedging instruments0 95 0 163 0 (59)Amount excluded from the assessment of effectiveness0 8 0 16 0 15 Effect of net investment hedges:Foreign exchange contractsAmount excluded from the assessment of effectiveness0 82 0 171 0 187 Effect of non designated hedges:Foreign exchange contracts0 (860)0(395)0 7 Other contracts0 101 0 144 0 53 Total gains (losses)$149 $(669)$1,961 $(63)$237 $262\nTABLE: TABLE: 2021 2022 2023; Revenues Other income (expense), net Revenues Other income (expense), net Revenues Other income (expense), net; Total amounts in the Consolidated Statements of Income $ 257,637 $ 12,020 $ 282,836 $ (3,514) $ 307,394 $ 1,424; Amount reclassified from AOCI to income $ 165 $ 0 $ 2,046 $ 0 $ 213 $ 0; Amount excluded from the assessment of effectiveness (amortized) (16) 0 (85) 0 24 0; Hedged items 0 (95) 0 (162) 0 59; Derivatives designated as hedging instruments 0 95 0 163 0 (59); Amount excluded from the assessment of effectiveness 0 8 0 16 0 15; Amount excluded from the assessment of effectiveness 0 82 0 171 0 187; Foreign exchange contracts 0 (860) 0 (395) 0 7; Other contracts 0 101 0 144 0 53; Total gains (losses) $ 149 $ (669) $ 1,961 $ (63) $ 237 $ 262.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTITLE: RevenuesOther income (expense), netRevenuesOther income (expense), netRevenuesOther income (expense), net\nTITLE: Revenues\nTITLE: Other income (expense), net\nTITLE: Revenues\nTITLE: Other income (expense), net\nTITLE: Revenues\nTITLE: Other income (expense), net\nTITLE: Effect of cash flow hedges:\nTEXT: Amount reclassified from AOCI to income\nTITLE: Effect of fair value hedges:\nTITLE: Effect of net investment hedges:\nTITLE: Effect of non designated hedges:\nTITLE: Offsetting of Derivatives\nTEXT: We enter into master netting arrangements and collateral security arrangements to reduce credit risk. Cash collateral received related to derivative instruments under our collateral security arrangements are included in other current assets with a corresponding liability. Cash and non-cash collateral pledged related to derivative instruments under our collateral security arrangements are included in other current assets.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: The gross amounts of derivative instruments subject to master netting arrangements with various counterparties, and cash and non-cash collateral received and pledged under such agreements were as follows (in millions):\nTEXT: As of December 31, 2022Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to OffsetGross Amounts RecognizedGross Amounts Offset in the Consolidated Balance SheetsNet Amounts Presented in the Consolidated Balance SheetsFinancial Instruments(1)Cash and Non-Cash Collateral Received or PledgedNet AmountsDerivatives assets$760 $(84)$676 $(463)$(132)$81 Derivatives liabilities$894 $(84)$810 $(463)$(28)$319 As of December 31, 2023Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to OffsetGross AmountsRecognizedGross Amounts Offset in the Consolidated Balance SheetsNet Amounts Presented in the Consolidated Balance SheetsFinancial Instruments(1)Cash and Non-Cash Collateral Received or PledgedNet AmountsDerivatives assets$535 $(82)$453 $(213)$(75)$165 Derivatives liabilities$527 $(82)$445 $(213)$(16)$216\nTABLE: TABLE: Gross Amounts Recognized Gross Amounts Offset in the Consolidated Balance Sheets Net Amounts Presented in the Consolidated Balance Sheets Financial Instruments(1) Cash and Non-Cash Collateral Received or Pledged Net Amounts; Derivatives assets $ 760 $ (84) $ 676 $ (463) $ (132) $ 81; Derivatives liabilities $ 894 $ (84) $ 810 $ (463) $ (28) $ 319; Gross AmountsRecognized Gross Amounts Offset in the Consolidated Balance Sheets Net Amounts Presented in the Consolidated Balance Sheets Financial Instruments(1) Cash and Non-Cash Collateral Received or Pledged Net Amounts; Derivatives assets $ 535 $ (82) $ 453 $ (213) $ (75) $ 165; Derivatives liabilities $ 527 $ (82) $ 445 $ (213) $ (16) $ 216.\nTITLE: As of December 31, 2022\nTITLE: Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset\nTITLE: Gross Amounts Recognized\nTITLE: Gross Amounts Offset in the Consolidated Balance Sheets\nTITLE: Net Amounts Presented in the Consolidated Balance Sheets\nTITLE: Financial Instruments(1)\nTITLE: Cash and Non-Cash Collateral Received or Pledged\nTITLE: Net Amounts\nTITLE: As of December 31, 2023\nTITLE: Gross Amounts Not Offset in the Consolidated Balance Sheets, but Have Legal Rights to Offset\nTITLE: Gross AmountsRecognized\nTITLE: Gross Amounts Offset in the Consolidated Balance Sheets\nTITLE: Net Amounts Presented in the Consolidated Balance Sheets\nTITLE: Financial Instruments(1)\nTITLE: Cash and Non-Cash Collateral Received or Pledged\nTITLE: Net Amounts\nTEXT: (1) The balances as of December 31, 2022 and 2023 were related to derivatives allowed to be net settled in accordance with our master netting agreements.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\n"
    },
    {
      "cluster": 19,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nlease, vies, december, these, debt, future, payments, term, operating, leases\n\nTITLE: 2023\nTEXT: Supplemental information related to operating leases was as follows (in millions):\nTEXT: Year Ended December 31,202120222023Cash payments for operating leases$2,489 $2,722 $3,173 New operating lease assets obtained in exchange for operating lease liabilities$2,951 $4,383 $2,877\nTABLE: TABLE: 2021 2022 2023; Cash payments for operating leases $ 2,489 $ 2,722 $ 3,173; New operating lease assets obtained in exchange for operating lease liabilities $ 2,951 $ 4,383 $ 2,877.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: As of December 31, 2023, our operating leases had a weighted average remaining lease term of 8.1 years and a weighted average discount rate of 3.1%. Future lease payments under operating leases as of December 31, 2023 were as follows (in millions):\nTEXT: 2024$3,179 20252,929 20262,450 20271,951 20281,488 Thereafter5,685 Total future lease payments17,682 Less imputed interest(2,431)Total lease liability balance$15,251\nTABLE: TABLE: 2024 $ 3,179; 2025 2,929; 2026 2,450; 2027 1,951; 2028 1,488; Thereafter 5,685; Total future lease payments 17,682; Less imputed interest (2,431); Total lease liability balance $ 15,251.\nTEXT: As of December 31, 2023, we have entered into leases that have not yet commenced with short-term and long-term future lease payments of $657 million and $3.3 billion that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2024 and 2026 with non-cancelable lease terms between one and 25 years.\nTITLE: Consolidated Variable Interest Entities\nTEXT: We consolidate VIEs in which we hold a variable interest and are the primary beneficiary. The results of operations and financial position of these VIEs are included in our consolidated financial statements.\nTEXT: For certain consolidated VIEs, their assets are not available to us and their creditors do not have recourse to us. As of December 31, 2022 and 2023, assets that can only be used to settle obligations of these VIEs were $4.1 billion and $4.9 billion, respectively, and the liabilities for which creditors only have recourse to the VIEs were $2.6 billion and $2.5 billion, respectively. We may continue to fund ongoing operations of certain VIEs that are included within Other Bets.\nTEXT: Total noncontrolling interests (NCI) in our consolidated subsidiaries were $3.8 billion and $3.4 billion as of December 31, 2022 and 2023, respectively, of which $1.1 billion is redeemable noncontrolling interest (RNCI) for both periods. NCI and RNCI are included within additional paid-in capital. Net loss attributable to noncontrolling interests was not material for any period presented and is included within the \"other\" component of OI&E. See Note 7 for further details on OI&E.\nTITLE: Unconsolidated Variable Interest Entities\nTEXT: We have investments in VIEs in which we are not the primary beneficiary. These VIEs include private companies that are primarily early stage companies and certain renewable energy entities in which activities involve power generation using renewable sources.\nTEXT: We have determined that the governance structures of these entities do not allow us to direct the activities that would significantly affect their economic performance. Therefore, we are not the primary beneficiary, and the results of operations and financial position of these VIEs are not included in our consolidated financial statements. We account for these investments primarily as non-marketable equity securities or equity method investments.\nTEXT: The maximum exposure of these unconsolidated VIEs is generally based on the current carrying value of the investments and any future funding commitments. The maximum exposure and carrying value of these unconsolidated VIEs were $2.8 billion and $2.7 billion, respectively, as of December 31, 2022 and $5.7 billion and $4.0 billion, respectively, as of December 31, 2023. The difference between the maximum exposure and the carrying value relates primarily to future funding commitments.\nTITLE: Short-Term Debt\nTEXT: We have a debt financing program of up to $10.0 billion through the issuance of commercial paper. Net proceeds from this program are used for general corporate purposes. We had no commercial paper outstanding as of December 31, 2022 and 2023.\nTEXT: Our short-term debt balance also includes the current portion of certain long-term debt.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Long-Term Debt\nTEXT: Total outstanding debt is summarized below (in millions, except percentages):\nTEXT: Effective Interest RateAs of December 31,MaturityCoupon Rate20222023Debt2014-2020 Notes issuances2024 - 20600.45% - 3.38%0.57% - 3.38%$13,000 $13,000 Future finance lease payments, net and other (1)2,142 1,746 Total debt15,142 14,746 Unamortized discount and debt issuance costs(143)(130)Less: Current portion of long-term notes(2)0 (1,000)Less: Current portion of future finance lease payments, net and other current debt(1)(2)(298)(363) Total long-term debt$14,701 $13,253\nTABLE: TABLE: Effective Interest Rate As of December 31,; Maturity Coupon Rate 2022 2023; 2014-2020 Notes issuances 2024 - 2060 0.45% - 3.38% 0.57% - 3.38% $ 13,000 $ 13,000; Future finance lease payments, net and other (1) 2,142 1,746; Total debt 15,142 14,746; Unamortized discount and debt issuance costs (143) (130); Less: Current portion of long-term notes(2) 0 (1,000); Less: Current portion of future finance lease payments, net and other current debt(1)(2) (298) (363); Total long-term debt $ 14,701 $ 13,253.\nTITLE: Effective Interest RateAs of December 31,\nTITLE: Effective Interest Rate\nTITLE: As of December 31,\nTITLE: MaturityCoupon Rate20222023\nTITLE: Maturity\nTITLE: Coupon Rate\nTITLE: 2022\nTITLE: 2023\nTITLE: Debt\nTEXT: Future finance lease payments, net and other (1)\nTITLE: Total debt15,142 14,746\n"
    },
    {
      "cluster": 20,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncurrent, liabilities, december, other, accrued, interest, expenses, equipment, less, notes\n\nTITLE: Total debt\nTEXT: Less: Current portion of long-term notes(2)\nTEXT: Less: Current portion of future finance lease payments, net and other current debt(1)(2)\nTITLE: Total long-term debt$14,701 $13,253\nTITLE: Total long-term debt\nTEXT: (1)Future finance lease payments are net of imputed interest.\nTEXT: (2)Total current portion of long-term debt is included within other accrued expenses and current liabilities. See Note 7 for further details.\nTEXT: The notes in the table above are fixed-rate senior unsecured obligations and generally rank equally with each other. We may redeem the notes at any time in whole or in part at specified redemption prices. The effective interest rates are based on proceeds received with interest payable semi-annually.\nTEXT: The total estimated fair value of the outstanding notes was approximately $9.9 billion and $10.3 billion as of December 31, 2022 and December 31, 2023, respectively. The fair value was determined based on observable market prices of identical instruments in less active markets and is categorized accordingly as Level 2 in the fair value hierarchy.\nTEXT: As of December 31, 2023, the aggregate future principal payments for long-term debt, including finance lease liabilities, for each of the next five years and thereafter were as follows (in millions):\nTEXT: 2024$1,299 20251,16320262,16520271,1432028132Thereafter8,960Total$14,862\nTABLE: TABLE: 2024 $ 1,299; 2025 1,163; 2026 2,165; 2027 1,143; 2028 132; Thereafter 8,960; Total $ 14,862.\nTITLE: Credit Facility\nTEXT: As of December 31, 2023, we had $10.0 billion of revolving credit facilities, of which $4.0 billion expires in April 2024 and $6.0 billion expires in April 2028. The interest rates for all credit facilities are determined based on a formula using certain market rates, as well as our progress toward the achievement of certain sustainability goals. No amounts were outstanding under the credit facilities as of December 31, 2022 and 2023.\nTITLE: Accounts Receivable\nTEXT: The allowance for credit losses on accounts receivable was $754 million and $771 million as of December 31, 2022 and 2023, respectively.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Property and Equipment, Net\nTEXT: Property and equipment, net, consisted of the following (in millions):\nTEXT: As of December 31,20222023Land and buildings$66,897 $74,083 Information technology assets66,267 80,594 Construction in progress27,657 35,229 Leasehold improvements10,575 11,425 Furniture and fixtures314 472 Property and equipment, gross171,710 201,803 Less: accumulated depreciation(59,042)(67,458)Property and equipment, net$112,668 $134,345\nTABLE: TABLE: 2022 2023; Land and buildings $ 66,897 $ 74,083; Information technology assets 66,267 80,594; Construction in progress 27,657 35,229; Leasehold improvements 10,575 11,425; Furniture and fixtures 314 472; Property and equipment, gross 171,710 201,803; Less: accumulated depreciation (59,042) (67,458); Property and equipment, net $ 112,668 $ 134,345.\nTITLE: As of December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: Our technical infrastructure is comprised of information technology assets, including servers and networking equipment, and data center land and buildings.\nTITLE: Accrued Expenses and Other Current Liabilities\nTEXT: Accrued expenses and other current liabilities consisted of the following (in millions):\nTEXT: As of December 31,20222023European Commission fines(1)$9,106 $9,525 Accrued purchases of property and equipment3,019 4,679 Accrued customer liabilities3,619 4,140 Current operating lease liabilities2,477 2,791 Income taxes payable, net1,632 2,748 Other accrued expenses and current liabilities18,013 22,285 Accrued expenses and other current liabilities$37,866 $46,168\nTABLE: TABLE: 2022 2023; European Commission fines(1) $ 9,106 $ 9,525; Accrued purchases of property and equipment 3,019 4,679; Accrued customer liabilities 3,619 4,140; Current operating lease liabilities 2,477 2,791; Income taxes payable, net 1,632 2,748; Other accrued expenses and current liabilities 18,013 22,285; Accrued expenses and other current liabilities $ 37,866 $ 46,168.\nTITLE: As of December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: (1) While each EC decision is under appeal, the fines are included in accrued expenses and other current liabilities on our Consolidated Balance Sheets, as we provided bank guarantees (in lieu of a cash payment) for the fines. Amounts include the effects of foreign exchange and interest. See Note 10 for further details.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\n"
    },
    {
      "cluster": 21,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, aoci, loss, other, december, amounts, comprehensive, reclassified, gains, losses\n\nTITLE: Accumulated Other Comprehensive Income (Loss)\nTEXT: Components of AOCI, net of income tax, were as follows (in millions):\nTEXT: Foreign Currency Translation AdjustmentsUnrealized Gains (Losses) on Available-for-Sale InvestmentsUnrealized Gains (Losses) on Cash Flow HedgesTotalBalance as of December 31, 2020$(864)$1,612 $(115)$633 Other comprehensive income (loss) before reclassifications(1,442)(1,312)668 (2,086)Amounts excluded from the assessment of hedge effectiveness recorded in AOCI0 0 48 48 Amounts reclassified from AOCI0 (64)(154)(218)Other comprehensive income (loss)(1,442)(1,376)562 (2,256)Balance as of December 31, 2021(2,306)236 447 (1,623)Other comprehensive income (loss) before reclassifications(1,836)(4,720)1,463 (5,093)Amounts excluded from the assessment of hedge effectiveness recorded in AOCI0 0 (188)(188)Amounts reclassified from AOCI0 1,007 (1,706)(699)Other comprehensive income (loss)(1,836)(3,713)(431)(5,980)Balance as of December 31, 2022(4,142)(3,477)16 (7,603)Other comprehensive income (loss) before reclassifications735 1,344 84 2,163 Amounts excluded from the assessment of hedge effectiveness recorded in AOCI0 0 84 84 Amounts reclassified from AOCI0 1,168 (214)954 Other comprehensive income (loss)735 2,512 (46)3,201 Balance as of December 31, 2023$(3,407)$(965)$(30)$(4,402)\nTABLE: TABLE: Foreign Currency Translation Adjustments Unrealized Gains (Losses) on Available-for-Sale Investments Unrealized Gains (Losses) on Cash Flow Hedges Total; Balance as of December 31, 2020 $ (864) $ 1,612 $ (115) $ 633; Other comprehensive income (loss) before reclassifications (1,442) (1,312) 668 (2,086); Amounts excluded from the assessment of hedge effectiveness recorded in AOCI 0 0 48 48; Amounts reclassified from AOCI 0 (64) (154) (218); Other comprehensive income (loss) (1,442) (1,376) 562 (2,256); Balance as of December 31, 2021 (2,306) 236 447 (1,623); Other comprehensive income (loss) before reclassifications (1,836) (4,720) 1,463 (5,093); Amounts excluded from the assessment of hedge effectiveness recorded in AOCI 0 0 (188) (188); Amounts reclassified from AOCI 0 1,007 (1,706) (699); Other comprehensive income (loss) (1,836) (3,713) (431) (5,980); Balance as of December 31, 2022 (4,142) (3,477) 16 (7,603); Other comprehensive income (loss) before reclassifications 735 1,344 84 2,163; Amounts excluded from the assessment of hedge effectiveness recorded in AOCI 0 0 84 84; Amounts reclassified from AOCI 0 1,168 (214) 954; Other comprehensive income (loss) 735 2,512 (46) 3,201; Balance as of December 31, 2023 $ (3,407) $ (965) $ (30) $ (4,402).\nTITLE: Foreign Currency Translation Adjustments\nTITLE: Unrealized Gains (Losses) on Available-for-Sale Investments\nTITLE: Unrealized Gains (Losses) on Cash Flow Hedges\nTITLE: Total\nTEXT: The effects on net income of amounts reclassified from AOCI were as follows (in millions):\nTEXT: Gains (Losses) Reclassified from AOCI to the Consolidated Statements of IncomeYear Ended December 31, AOCI ComponentsLocation202120222023Unrealized gains (losses) on available-for-sale investmentsOther income (expense), net$82 $(1,291)$(1,497)Benefit (provision) for income taxes(18)284 329 Net of income tax64 (1,007)(1,168)Unrealized gains (losses) on cash flow hedgesForeign exchange contractsRevenue165 2,046 213 Interest rate contractsOther income (expense), net6 6 6 Benefit (provision) for income taxes(17)(346)(5)Net of income tax154 1,706 214 Total amount reclassified, net of income tax$218 $699 $(954)\nTABLE: TABLE: AOCI Components Location 2021 2022 2023; Other income (expense), net $ 82 $ (1,291) $ (1,497); Benefit (provision) for income taxes (18) 284 329; Net of income tax 64 (1,007) (1,168); Foreign exchange contracts Revenue 165 2,046 213; Interest rate contracts Other income (expense), net 6 6 6; Benefit (provision) for income taxes (17) (346) (5); Net of income tax 154 1,706 214; Total amount reclassified, net of income tax $ 218 $ 699 $ (954).\nTITLE: Gains (Losses) Reclassified from AOCI to the Consolidated Statements of Income\nTITLE: Year Ended December 31,\nTITLE: AOCI ComponentsLocation202120222023\nTITLE: AOCI Components\nTITLE: Location\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Other Income (Expense), Net\nTEXT: Components of OI&E were as follows (in millions):\nTEXT: Year Ended December 31, 202120222023Interest income$1,499 $2,174 $3,865 Interest expense(1)(346)(357)(308)Foreign currency exchange gain (loss), net(240)(654)(1,238)Gain (loss) on debt securities, net(110)(2,064)(1,215)Gain (loss) on equity securities, net12,380 (3,455)392 Performance fees(1,908)798 257 Income (loss) and impairment from equity method investments, net334 (337)(628)Other411 381 299 Other income (expense), net$12,020 $(3,514)$1,424\nTABLE: TABLE: 2021 2022 2023; Interest income $ 1,499 $ 2,174 $ 3,865; Interest expense(1) (346) (357) (308); Foreign currency exchange gain (loss), net (240) (654) (1,238); Gain (loss) on debt securities, net (110) (2,064) (1,215); Gain (loss) on equity securities, net 12,380 (3,455) 392; Performance fees (1,908) 798 257; Income (loss) and impairment from equity method investments, net 334 (337) (628); Other 411 381 299; Other income (expense), net $ 12,020 $ (3,514) $ 1,424.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: (1) Interest expense is net of interest capitalized of $163 million, $128 million, and $181 million for the years ended December 31, 2021, 2022, and 2023, respectively.\nTITLE: Year Ended December 31, 2023\nTITLE: Severance and Related (1)Office SpaceTotal\nTITLE: Severance and Related (1)\nTITLE: Office Space\n"
    },
    {
      "cluster": 22,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nloss, matters, indemnification, possible, reasonably, agreements, certain, amount, cash, december\n\nTITLE: Total\nTEXT: (1)Severance includes amounts to be settled in cash, accounted for as one-time involuntary employee termination benefits, and SBC.\nTEXT: For segment reporting, the substantial majority of these charges are included within Alphabet-level activities in our segment results.\nTEXT: For the year ended December 31, 2023, changes in liabilities resulting from the severance charges and related accruals were as follows (in millions):\nTITLE: Severance and RelatedBalance as of December 31, 2022$0 Charges(1)1,656 Cash payments(1,579)Balance as of December 31, 2023(2)$77\nTABLE: TABLE: Balance as of December 31, 2022 $ 0; Charges(1) 1,656; Cash payments (1,579); Balance as of December 31, 2023(2) $ 77.\nTITLE: Severance and RelatedBalance as of December 31, 2022$0 Charges(1)1,656 Cash payments(1,579)Balance as of December 31, 2023(2)$77\nTITLE: Severance and Related\nTEXT: Balance as of December 31, 2023(2)\nTEXT: (1)Excludes non-cash SBC of $432 million.\nTEXT: (2)Included in accrued compensation and benefits on the Consolidated Balance Sheets.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Google ServicesGoogle CloudOther BetsTotal\nTITLE: Google Services\nTITLE: Google Cloud\nTITLE: Other Bets\nTITLE: Total\nTITLE: Commitments\nTEXT: We have content licensing agreements with future fixed or minimum guaranteed commitments of $10.6 billion as of December 31, 2023, of which the majority is paid over seven years ending in the first quarter of 2030.\nTITLE: Indemnifications\nTEXT: In the normal course of business, including to facilitate transactions in our services and products and corporate activities, we indemnify certain parties, including advertisers, Google Network partners, distribution partners, customers of Google Cloud offerings, lessors, and service providers with respect to certain matters. We have agreed to defend and/or hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made against certain parties. Several of these agreements limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers and directors, and our bylaws contain similar indemnification obligations to our agents.\nTEXT: It is not possible to make a reasonable estimate of the maximum potential amount under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Additionally, the payments we have made under such agreements have not had a material adverse effect on our results of operations, cash flows, or financial position. However, to the extent that valid indemnification claims arise in the future, future payments by us could be significant and could have a material adverse effect on our results of operations or cash flows in a particular period.\nTEXT: As of December 31, 2023, we did not have any material indemnification claims that were probable or reasonably possible.\nTITLE: Legal Matters\nTEXT: We record a liability when we believe that it is probable that a loss has been incurred, and the amount can be reasonably estimated. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. We evaluate developments in our legal matters that could affect the amount of liability that has been previously accrued, and the matters and related reasonably possible losses disclosed, and make adjustments as appropriate.\nTEXT: Certain outstanding matters seek speculative, substantial or indeterminate monetary amounts, substantial changes to our business practices and products, or structural remedies. Significant judgment is required to determine both the likelihood of there being a loss and the estimated amount of a loss related to such matters, and we may be unable to estimate the reasonably possible loss or range of losses. The outcomes of outstanding legal matters are inherently unpredictable and subject to significant uncertainties, and could, either individually or in aggregate, have a material adverse effect.\nTEXT: We expense legal fees in the period in which they are incurred.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\n"
    },
    {
      "cluster": 23,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ngoogle, decision, antitrust, general, court, state, district, june, laws, competition\n\nTITLE: Antitrust Investigations\nTEXT: On November 30, 2010, the EC's Directorate General for Competition opened an investigation into various antitrust-related complaints against us.\nTEXT: On June 27, 2017, the EC announced its decision that certain actions taken by Google regarding its display and ranking of shopping search results and ads infringed European competition law. The EC decision imposed a €2.4 billion ($2.7 billion as of June 27, 2017) fine. On September 11, 2017, we appealed the EC decision to the General Court, and on September 27, 2017, we implemented product changes to bring shopping ads into compliance with the EC's decision. We recognized a charge of $2.7 billion for the fine in the second quarter of 2017. On November 10, 2021, the General Court rejected our appeal, and we subsequently filed an appeal with the European Court of Justice on January 20, 2022.\nTEXT: On July 18, 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European competition law. The EC decision imposed a €4.3 billion ($5.1 billion as of June 30, 2018) fine and directed the termination of the conduct at issue. On October 9, 2018, we appealed the EC decision, and on October 29, 2018, we implemented changes to certain of our Android distribution practices. On September 14, 2022, the General Court reduced the fine from €4.3 billion to €4.1 billion. We subsequently filed an appeal with the European Court of Justice. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022.\nTEXT: On March 20, 2019, the EC announced its decision that certain contractual provisions in agreements that Google had with AdSense for Search partners infringed European competition law. The EC decision imposed a fine of €1.5 billion ($1.7 billion as of March 20, 2019) and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. On June 4, 2019, we appealed the EC decision. We recognized a charge of $1.7 billion for the fine in the first quarter of 2019.\nTEXT: From time to time we are subject to formal and informal inquiries and investigations on various competition matters by regulatory authorities in the U.S., Europe, and other jurisdictions globally. Examples, for which given their nature we cannot estimate a possible loss, include:\nTEXT: •In August 2019, we began receiving civil investigative demands from the U.S. Department of Justice (DOJ) requesting information and documents relating to our prior antitrust investigations and certain aspects of our business. The DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia on October 20, 2020 alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. The trial ended on November 16, 2023, and we expect a decision in 2024. Further, in June 2022, the Australian Competition and Consumer Commission (ACCC) and the United Kingdom's Competition and Markets Authority (CMA) each opened an investigation into Search distribution practices.\nTEXT: •On December 16, 2020, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Eastern District of Texas, alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for March 2025. Additionally, on January 24, 2023, the DOJ, along with a number of state Attorneys General, filed an antitrust complaint in the U.S. District Court for the Eastern District of Virginia alleging that Google’s digital advertising technology products violate U.S. antitrust laws, and on April 17, 2023, a number of additional state Attorneys General joined the complaint. The EC, the CMA, and the ACCC each opened a formal investigation into Google's advertising technology business practices on June 22, 2021, May 25, 2022, and June 29, 2022, respectively. On June 14, 2023, the EC issued a Statement of Objections (SO) informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology. We responded to the SO on December 1, 2023.\nTEXT: •On July 7, 2021, a number of state Attorneys General filed an antitrust complaint in the U.S. District Court for the Northern District of California, alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories. The U.S. District Court subsequently vacated the trial date with the states, and any final approval of the settlement is expected to occur in 2024. In May 2022, the EC and the CMA each opened investigations into Google Play’s business practices. Korean regulators are investigating Google Play's billing practices, including a formal review in May 2022 of Google's compliance with the new app store billing regulations.\nTEXT: We believe we have strong arguments against these claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Privacy Matters\nTEXT: We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information and advertising practices, which could result in significant fines, judgments, and product changes.\n"
    },
    {
      "cluster": 24,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nproducts, stock, class, result, loss, certain, services, these, business, common\n\nTITLE: Patent and Intellectual Property Claims\nTEXT: We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products.\nTEXT: Furthermore, many of our agreements with our customers and partners require us to indemnify them against certain intellectual property infringement claims, which would increase our costs as a result of defending such claims, and may require that we pay significant damages if there were an adverse ruling in any such claims. In addition, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business.\nTITLE: Other\nTEXT: We are subject to claims, lawsuits, regulatory and government investigations, other proceedings, and consent orders involving competition, intellectual property, data security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, in December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated antitrust laws related to Google Play's business. The presiding judge will determine remedies in 2024, and the range of potential remedies vary widely. We plan to appeal. We also periodically have data incidents that we report to relevant regulators as required by law.\nTEXT: These claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results.\nTEXT: We have ongoing legal matters relating to Russia. For example, civil judgments that include compounding penalties have been imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not believe these ongoing legal matters will have a material adverse effect.\nTITLE: Non-Income Taxes\nTEXT: We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations.\nTEXT: See, Note 14 for information regarding income tax contingencies.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Class A and Class B Common Stock and Class C Capital Stock\nTEXT: Our Board of Directors has authorized three classes of stock, Class A and Class B common stock, and Class C capital stock. The rights of the holders of each class of our common and capital stock are identical, except with respect to voting. Each share of Class A common stock is entitled to one vote per share. Each share of Class B common stock is entitled to 10 votes per share. Class C capital stock has no voting rights, except as required by applicable law. Shares of Class B common stock may be converted at any time at the option of the stockholder and automatically convert upon sale or transfer to Class A common stock.\n"
    },
    {
      "cluster": 25,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nclass, shares, share, undistributed, earnings, computation, income, december, basic, repurchases\n\nTITLE: Share Repurchases\nTEXT: In the years ended December 31, 2021, 2022, and 2023, we repurchased $50.3 billion, $59.3 billion, and $62.2 billion, respectively, of Alphabet's Class A and Class C shares.\nTEXT: In April 2023, the Board of Directors of Alphabet authorized the company to repurchase up to an additional $70.0 billion of its Class A and Class C shares. As of December 31, 2023, $36.3 billion remains available for Class A and Class C share repurchases.\nTEXT: The following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\nTEXT: Year Ended December 31, 2022Year Ended December 31, 2023SharesAmountSharesAmountClass A share repurchases61$6,719 78$9,316 Class C share repurchases46952,577 45052,868 Total share repurchases(1)530$59,296 528$62,184 (1) Shares repurchased include unsettled repurchases as of December 31, 2023.\nTABLE: TABLE: Year Ended December 31, 2022 Year Ended December 31, 2023; Shares Amount Shares Amount; Class A share repurchases 61 $ 6,719 78 $ 9,316; Class C share repurchases 469 52,577 450 52,868; Total share repurchases(1) 530 $ 59,296 528 $ 62,184.\nTITLE: Year Ended December 31, 2022Year Ended December 31, 2023\nTITLE: Year Ended December 31, 2022\nTITLE: Year Ended December 31, 2023\nTITLE: SharesAmountSharesAmount\nTITLE: Shares\nTITLE: Amount\nTITLE: Shares\nTITLE: Amount\nTEXT: Class A and Class C shares are repurchased in a manner deemed in the best interest of the company and its stockholders, taking into account the economic cost and prevailing market conditions, including the relative trading prices and volumes of the Class A and Class C shares. Repurchases are executed from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases or privately negotiated transactions, including through Rule 10b5-1 plans. The repurchase program does not have an expiration date.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: The following table sets forth the computation of basic and diluted net income per share of Class A, Class B, and Class C stock (in millions, except per share amounts):\nTEXT: Year Ended December 31, 2021 Class AClass BClass CBasic net income per share:NumeratorAllocation of undistributed earnings $34,200 $5,174 $36,659 DenominatorNumber of shares used in per share computation6,006 909 6,438 Basic net income per share$5.69 $5.69 $5.69 Diluted net income per share:NumeratorAllocation of undistributed earnings for basic computation $34,200 $5,174 $36,659 Reallocation of undistributed earnings as a result of conversion of Class B to Class A shares5,174 0 0 Reallocation of undistributed earnings(581)(77)581 Allocation of undistributed earnings$38,793 $5,097 $37,240 DenominatorNumber of shares used in basic computation6,006 909 6,438 Weighted-average effect of dilutive securitiesAdd:Conversion of Class B to Class A shares outstanding909 0 0 Restricted stock units and other contingently issuable shares0 0 200 Number of shares used in per share computation6,915 909 6,638 Diluted net income per share$5.61 $5.61 $5.61\nTABLE: TABLE: Class A Class B Class C; Allocation of undistributed earnings $ 34,200 $ 5,174 $ 36,659; Number of shares used in per share computation 6,006 909 6,438; Basic net income per share $ 5.69 $ 5.69 $ 5.69; Allocation of undistributed earnings for basic computation $ 34,200 $ 5,174 $ 36,659; Reallocation of undistributed earnings as a result of conversion of Class B to Class A shares 5,174 0 0; Reallocation of undistributed earnings (581) (77) 581; Allocation of undistributed earnings $ 38,793 $ 5,097 $ 37,240; Number of shares used in basic computation 6,006 909 6,438; Conversion of Class B to Class A shares outstanding 909 0 0; Restricted stock units and other contingently issuable shares 0 0 200; Number of shares used in per share computation 6,915 909 6,638; Diluted net income per share $ 5.61 $ 5.61 $ 5.61.\nTITLE: Year Ended December 31,\nTITLE: 2021\nTITLE: Class AClass BClass C\nTITLE: Class A\nTITLE: Class B\nTITLE: Class C\nTEXT: Year Ended December 31, 2022 Class AClass BClass CBasic net income per share:NumeratorAllocation of undistributed earnings$27,518 $4,072 $28,382 DenominatorNumber of shares used in per share computation5,994 887 6,182 Basic net income per share$4.59 $4.59 $4.59 Diluted net income per share:NumeratorAllocation of undistributed earnings for basic computation $27,518 $4,072 $28,382 Reallocation of undistributed earnings as a result of conversion of Class B to Class A shares4,072 0 0 Reallocation of undistributed earnings(230)(30)230 Allocation of undistributed earnings$31,360 $4,042 $28,612 DenominatorNumber of shares used in basic computation5,994 887 6,182 Weighted-average effect of dilutive securitiesAdd:Conversion of Class B to Class A shares outstanding887 0 0 Restricted stock units and other contingently issuable shares0 0 96 Number of shares used in per share computation6,881 887 6,278 Diluted net income per share$4.56 $4.56 $4.56\nTABLE: TABLE: Class A Class B Class C; Allocation of undistributed earnings $ 27,518 $ 4,072 $ 28,382; Number of shares used in per share computation 5,994 887 6,182; Basic net income per share $ 4.59 $ 4.59 $ 4.59; Allocation of undistributed earnings for basic computation $ 27,518 $ 4,072 $ 28,382; Reallocation of undistributed earnings as a result of conversion of Class B to Class A shares 4,072 0 0; Reallocation of undistributed earnings (230) (30) 230; Allocation of undistributed earnings $ 31,360 $ 4,042 $ 28,612; Number of shares used in basic computation 5,994 887 6,182; Conversion of Class B to Class A shares outstanding 887 0 0; Restricted stock units and other contingently issuable shares 0 0 96; Number of shares used in per share computation 6,881 887 6,278; Diluted net income per share $ 4.56 $ 4.56 $ 4.56.\nTITLE: Year Ended December 31,\nTITLE: 2022\nTITLE: Class AClass BClass C\nTITLE: Class A\nTITLE: Class B\nTITLE: Class C\n"
    },
    {
      "cluster": 26,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndecember, stock, income, shares, class, share, alphabet, rsus, total, undistributed\n\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: Year Ended December 31, 2023 Class AClass BClass CBasic net income per share:NumeratorAllocation of undistributed earnings$34,601 $5,124 $34,070 DenominatorNumber of shares used in per share computation5,922 877 5,831 Basic net income per share$5.84 $5.84 $5.84 Diluted net income per share:NumeratorAllocation of undistributed earnings for basic computation $34,601 $5,124 $34,070 Reallocation of undistributed earnings as a result of conversion of Class B to Class A shares5,124 0 0 Reallocation of undistributed earnings(287)(37)287 Allocation of undistributed earnings$39,438 $5,087 $34,357 DenominatorNumber of shares used in basic computation5,922 877 5,831 Weighted-average effect of dilutive securitiesAdd:Conversion of Class B to Class A shares outstanding877 0 0 Restricted stock units and other contingently issuable shares0 0 92 Number of shares used in per share computation6,799 877 5,923 Diluted net income per share$5.80 $5.80 $5.80\nTABLE: TABLE: Class A Class B Class C; Allocation of undistributed earnings $ 34,601 $ 5,124 $ 34,070; Number of shares used in per share computation 5,922 877 5,831; Basic net income per share $ 5.84 $ 5.84 $ 5.84; Allocation of undistributed earnings for basic computation $ 34,601 $ 5,124 $ 34,070; Reallocation of undistributed earnings as a result of conversion of Class B to Class A shares 5,124 0 0; Reallocation of undistributed earnings (287) (37) 287; Allocation of undistributed earnings $ 39,438 $ 5,087 $ 34,357; Number of shares used in basic computation 5,922 877 5,831; Conversion of Class B to Class A shares outstanding 877 0 0; Restricted stock units and other contingently issuable shares 0 0 92; Number of shares used in per share computation 6,799 877 5,923; Diluted net income per share $ 5.80 $ 5.80 $ 5.80.\nTITLE: Year Ended December 31,\nTITLE: 2023\nTITLE: Class AClass BClass C\nTITLE: Class A\nTITLE: Class B\nTITLE: Class C\nTITLE: Stock Plans\nTEXT: Our stock plans include the Alphabet Amended and Restated 2021 Stock Plan (\"Alphabet 2021 Stock Plan\") and Other Bets stock-based plans. Under our stock plans, RSUs and other types of awards may be granted. Under the Alphabet 2021 Stock Plan, an RSU award is an agreement to issue shares of our Class C stock at the time the award vests. RSUs generally vest over four years contingent upon employment on the vesting date.\nTEXT: As of December 31, 2023, there were 723 million shares of Class C stock reserved for future issuance under the Alphabet 2021 Stock Plan.\nTITLE: Stock-Based Compensation\nTEXT: For the years ended December 31, 2021, 2022, and 2023, total SBC expense was $15.7 billion, $19.5 billion, and $22.1 billion, including amounts associated with awards we expect to settle in Alphabet stock of $15.0 billion, $18.8 billion, and $21.7 billion, respectively.\nTEXT: During the year ended December 31, 2023, total SBC expense includes $432 million associated with workforce reduction costs. See Note 8 for further details.\nTEXT: For the years ended December 31, 2021, 2022, and 2023, we recognized tax benefits on total SBC expense, which are reflected in the provision for income taxes in the Consolidated Statements of Income, of $3.1 billion, $3.9 billion, and $4.5 billion, respectively.\nTEXT: For the years ended December 31, 2021, 2022, and 2023, tax benefit realized related to awards vested or exercised during the period was $5.9 billion, $4.7 billion, and $5.6 billion, respectively. These amounts do not include the indirect effects of stock-based awards, which primarily relate to the R&D tax credit.\nTITLE: Stock-Based Award Activities\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: The following table summarizes the activities for unvested Alphabet RSUs for the year ended December 31, 2023 (in millions, except per share amounts):\nTEXT: Unvested Restricted Stock Units Number of SharesWeighted-AverageGrant-DateFair ValueUnvested as of December 31, 2022324 $107.98 Granted263 $97.59 Vested(217)$100.36 Forfeited/canceled(32)$106.56 Unvested as of December 31, 2023338 $104.93\nTABLE: TABLE: Number of Shares Weighted-AverageGrant-DateFair Value; Unvested as of December 31, 2022 324 $ 107.98; Granted 263 $ 97.59; Vested (217) $ 100.36; Forfeited/canceled (32) $ 106.56; Unvested as of December 31, 2023 338 $ 104.93.\nTITLE: Unvested Restricted Stock Units\nTITLE: Number of SharesWeighted-AverageGrant-DateFair Value\nTITLE: Number of Shares\nTITLE: Weighted-AverageGrant-DateFair Value\nTEXT: The weighted-average grant-date fair value of RSUs granted during the years ended December 31, 2021 and 2022 was $97.46 and $127.22, respectively. Total fair value of RSUs, as of their respective vesting dates, during the years ended December 31, 2021, 2022, and 2023, were $28.8 billion, $23.9 billion, and $26.6 billion, respectively.\nTEXT: As of December 31, 2023, there was $33.5 billion of unrecognized compensation cost related to unvested RSUs. This amount is expected to be recognized over a weighted-average period of 2.5 years.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: Provision for income taxes consisted of the following (in millions):Year Ended December 31, 202120222023Current:Federal and state$10,126 $17,120 $17,125 Foreign2,692 2,434 2,526 Total12,818 19,554 19,651 Deferred:Federal and state2,018 (8,052)(7,482)Foreign(135)(146)(247)Total1,883 (8,198)(7,729)Provision for income taxes$14,701 $11,356 $11,922\nTABLE: TABLE: 2021 2022 2023; Federal and state $ 10,126 $ 17,120 $ 17,125; Foreign 2,692 2,434 2,526; Total 12,818 19,554 19,651; Federal and state 2,018 (8,052) (7,482); Foreign (135) (146) (247); Total 1,883 (8,198) (7,729); Provision for income taxes $ 14,701 $ 11,356 $ 11,922.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTITLE: Table of ContentsAlphabet Inc.\n"
    },
    {
      "cluster": 27,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndeferred, operating, income, federal, credit, assets, carryforwards, foreign, valuation, allowance\n\nTITLE: Alphabet Inc.\nTEXT: The reconciliation of federal statutory income tax rate to our effective income tax rate was as follows:\nTEXT: Year Ended December 31, 202120222023U.S. federal statutory tax rate21.0 %21.0 %21.0 %Foreign income taxed at different rates0.2 3.0 0.3 Foreign-derived intangible income deduction(2.5)(5.4)(4.6)Stock-based compensation expense(2.5)(1.2)(0.8)Federal research credit(1.6)(2.2)(1.8)Deferred tax asset valuation allowance0.6 0.9 0.6 State and local income taxes1.0 0.8 1.0 Effect of tax law change0.0 0.0 (1.4)Other0.0 (1.0)(0.4)Effective tax rate16.2 %15.9 %13.9 %\nTABLE: TABLE: 2021 2022 2023; U.S. federal statutory tax rate 21.0 % 21.0 % 21.0 %; Foreign income taxed at different rates 0.2 3.0 0.3; Foreign-derived intangible income deduction (2.5) (5.4) (4.6); Stock-based compensation expense (2.5) (1.2) (0.8); Federal research credit (1.6) (2.2) (1.8); Deferred tax asset valuation allowance 0.6 0.9 0.6; State and local income taxes 1.0 0.8 1.0; Effect of tax law change 0.0 0.0 (1.4); Other 0.0 (1.0) (0.4); Effective tax rate 16.2 % 15.9 % 13.9 %.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: In 2022, there was an increase in the U.S. Foreign Derived Intangible Income tax deduction from the effects of capitalization and amortization of R&D expenses starting in 2022 as required by the 2017 Tax Cuts and Jobs Act.\nTEXT: In 2023, the IRS issued a rule change allowing taxpayers to temporarily apply the regulations in effect prior to 2022 related to U.S. federal foreign tax credits as well as a separate rule change with interim guidance on the capitalization and amortization of R&D expenses. A cumulative one-time adjustment applicable to the prior period for these tax rule changes was recorded in 2023.\nTITLE: Deferred Income Taxes\nTEXT: Deferred income taxes reflect the net effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of our deferred tax assets and liabilities were as follows (in millions):\nTEXT: As of December 31,20222023Deferred tax assets:Accrued employee benefits$955 $1,855 Accruals and reserves not currently deductible1,956 2,481 Tax credits6,002 6,609 Net operating losses2,557 2,965 Operating leases2,711 3,526 Capitalized research and development(1)10,381 17,757 Other2,289 1,951 Total deferred tax assets26,851 37,144 Valuation allowance(9,553)(10,999)Total deferred tax assets net of valuation allowance17,298 26,145 Deferred tax liabilities:Property and equipment, net(6,607)(8,189)Net investment gains(2,361)(2,405)Operating leases(2,491)(2,965)Other(1,092)(902)Total deferred tax liabilities(12,551)(14,461)Net deferred tax assets (liabilities)$4,747 $11,684\nTABLE: TABLE: 2022 2023; Accrued employee benefits $ 955 $ 1,855; Accruals and reserves not currently deductible 1,956 2,481; Tax credits 6,002 6,609; Net operating losses 2,557 2,965; Operating leases 2,711 3,526; Capitalized research and development(1) 10,381 17,757; Other 2,289 1,951; Total deferred tax assets 26,851 37,144; Valuation allowance (9,553) (10,999); Total deferred tax assets net of valuation allowance 17,298 26,145; Property and equipment, net (6,607) (8,189); Net investment gains (2,361) (2,405); Operating leases (2,491) (2,965); Other (1,092) (902); Total deferred tax liabilities (12,551) (14,461); Net deferred tax assets (liabilities) $ 4,747 $ 11,684.\nTITLE: As of December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTEXT: Capitalized research and development(1)\nTEXT: (1)As required by the 2017 Tax Cuts and Jobs Act, effective January 1, 2022, our research and development expenditures were capitalized and amortized which resulted in substantially higher cash taxes starting in 2022 with an equal amount of deferred tax benefit.\nTEXT: As of December 31, 2023, our federal, state, and foreign net operating loss carryforwards for income tax purposes were approximately $7.1 billion, $18.6 billion, and $1.8 billion respectively. If not utilized, the federal net\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: operating loss carryforwards will begin to expire in 2024, foreign net operating loss carryforwards will begin to expire in 2025 and the state net operating loss carryforwards will begin to expire in 2029. It is more likely than not that the majority of the net operating loss carryforwards will not be realized; therefore, we have recorded a valuation allowance against them. The net operating loss carryforwards are subject to various annual limitations under the tax laws of the different jurisdictions.\nTEXT: As of December 31, 2023, our Federal and California research and development credit carryforwards for income tax purposes were approximately $600 million and $6.3 billion, respectively. If not utilized, the Federal R&D credit will begin to expire in 2037 and the California R&D credit can be carried over indefinitely. We believe the majority of the federal tax credit and state tax credit is not likely to be realized.\nTEXT: As of December 31, 2023, our investment tax credit carryforwards for state income tax purposes were approximately $1.0 billion and will begin to expire in 2029. We use the flow-through method of accounting for investment tax credits. We believe this tax credit is not likely to be realized.\nTEXT: As of December 31, 2023, we maintained a valuation allowance with respect to California deferred tax assets, certain federal net operating losses, certain state net operating losses and tax credits, net deferred tax assets relating to Other Bet companies, and certain foreign net operating losses that we believe are not likely to be realized. We continue to reassess the remaining valuation allowance quarterly, and if future evidence allows for a partial or full release of the valuation allowance, a tax benefit will be recorded accordingly.\n"
    },
    {
      "cluster": 28,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, positions, jurisdictions, related, unrecognized, benefits, taxes, provision, gross, december\n\nTITLE: Uncertain Tax Positions\nTEXT: The following table summarizes the activity related to our gross unrecognized tax benefits (in millions):\nTEXT: Year Ended December 31, 202120222023Beginning gross unrecognized tax benefits$3,837 $5,158 $7,055 Increases related to prior year tax positions529 253 740 Decreases related to prior year tax positions(263)(437)(682)Decreases related to settlement with tax authorities(329)(140)(21)Increases related to current year tax positions1,384 2,221 2,346 Ending gross unrecognized tax benefits$5,158 $7,055 $9,438\nTABLE: TABLE: 2021 2022 2023; Beginning gross unrecognized tax benefits $ 3,837 $ 5,158 $ 7,055; Increases related to prior year tax positions 529 253 740; Decreases related to prior year tax positions (263) (437) (682); Decreases related to settlement with tax authorities (329) (140) (21); Increases related to current year tax positions 1,384 2,221 2,346; Ending gross unrecognized tax benefits $ 5,158 $ 7,055 $ 9,438.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: We are subject to income taxes in the U.S. and foreign jurisdictions. Significant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. The total amount of gross unrecognized tax benefits was $5.2 billion, $7.1 billion, and $9.4 billion as of December 31, 2021, 2022, and 2023, respectively, of which $3.7 billion, $5.3 billion, and $7.4 billion, if recognized, would affect our effective tax rate, respectively.\nTEXT: As of December 31, 2022 and 2023, we accrued $346 million and $622 million in interest and penalties in provision for income taxes, respectively.\nTEXT: We file income tax returns in the U.S. federal jurisdiction and in many state and foreign jurisdictions. Our two major tax jurisdictions are the U.S. federal and Ireland. We are subject to the continuous examination of our income tax returns by the IRS and other tax authorities. The IRS is currently examining our 2016 through 2021 tax returns. We have also received tax assessments in multiple foreign jurisdictions asserting transfer pricing adjustments or permanent establishment. We continue to defend such claims as presented.\nTEXT: The tax years 2016 through 2022 remain subject to examination by the appropriate governmental agencies for Irish tax purposes. There are other ongoing audits in various other jurisdictions that are not material to our financial statements.\nTEXT: We regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. We continue to monitor the progress of ongoing discussions with tax authorities and the effect, if any, of the expected expiration of the statute of limitations in various taxing jurisdictions.\nTEXT: We believe that an adequate provision has been made for any adjustments that may result from tax examinations. However, the outcome of tax audits cannot be predicted with certainty. If any issues addressed in our tax audits are resolved in a manner not consistent with management's expectations, we could be required to adjust our provision for income taxes in the period such resolutions occur. Although the timing of resolution, settlement, and closure of audits is not certain, it is reasonably possible that our unrecognized tax benefits from certain U.S. federal, state, and non U.S. tax positions could decrease by approximately $700 million in the next 12 months. Positions that may be resolved include various U.S. and non-U.S. matters.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTITLE: Year Ended December 31,\nTITLE: 202120222023\nTITLE: 2021\nTITLE: 2022\nTITLE: 2023\nTEXT: See Note 2 for information relating to revenues by geography.\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\nTEXT: The following table presents long-lived assets by geographic area, which includes property and equipment, net and operating lease assets (in millions):\nTEXT: As of December 31, 20222023Long-lived assets:United States$93,565 $110,053 International33,484 38,383 Total long-lived assets$127,049 $148,436\nTABLE: TABLE: 2022 2023; United States $ 93,565 $ 110,053; International 33,484 38,383; Total long-lived assets $ 127,049 $ 148,436.\nTITLE: As of December 31,\nTITLE: 20222023\nTITLE: 2022\nTITLE: 2023\nTITLE: Table of ContentsAlphabet Inc.\nTITLE: Alphabet Inc.\n"
    }
  ]
}