{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, financial, acquisition, discussion, operations, results, share, cash, long, term\n\nTEXT: Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nTEXT: The following discussion provides an analysis of the Company’s financial condition and results of operations from management's perspective and should be read in conjunction with the consolidated financial statements and related notes included in this report. The discussion in this Form 10-K generally focuses on fiscal 2024 compared to fiscal 2023. A discussion of our results of operations and changes in financial condition for fiscal 2023 compared to fiscal 2022 has been omitted from this report, but can be found in Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our Form 10-K for fiscal 2023.\nTITLE: TABLE OF CONTENTS\nTEXT: Executive Summary28Results of Operations29Liquidity and Capital Resources31Critical Accounting Estimates34\nTABLE: TABLE: Executive Summary 28; Results of Operations 29; Liquidity and Capital Resources 31; Critical Accounting Estimates 34.\nTEXT: Liquidity and Capital Resources\nTITLE: EXECUTIVE SUMMARY\nTEXT: We reported net sales of $159.5 billion in fiscal 2024. Net earnings were $14.8 billion, or $14.91 per diluted share. Fiscal 2024 consisted of 53 weeks compared to 52 weeks in fiscal 2023. The 53rd week in fiscal 2024 added approximately $2.5 billion of net sales and increased diluted earnings per share by approximately $0.30.\nTEXT: During fiscal 2024, we opened ten new stores in the U.S. and two new stores in Mexico, resulting in a total store count of 2,347 at February 2, 2025. A total of 322 of our stores, or 13.7%, were located in Canada and Mexico. Total sales per retail square foot were $599.92 in fiscal 2024. Our inventory turnover ratio was 4.7 times at the end of fiscal 2024, compared to 4.3 times at the end of fiscal 2023. The increase in our inventory turnover ratio was primarily driven by lower average inventory levels within our Primary segment during fiscal 2024.\nTEXT: During fiscal 2024, we generated $19.8 billion of cash flow from operations, received approximately $10.0 billion of proceeds from the issuance of long-term debt, net of discounts, and received $316 million of proceeds from commercial paper borrowings, net of repayments. We utilized a combination of commercial paper borrowings and the issuance of long-term debt, together with cash on hand, to fund the acquisition of SRS, with cash purchase consideration totaling $17.7 billion. Specifically, in June 2024, leading up to the SRS acquisition on June 18, 2024, we raised commercial paper borrowings of over $15.0 billion to fund the transaction, of which approximately $10.0 billion was then immediately repaid with the proceeds from our issuance of long-term debt. We have subsequently repaid all of the commercial borrowings used to fund the acquisition and ended fiscal 2024 with $316 million of commercial paper borrowings outstanding.\nTEXT: During fiscal 2024, we also paid $8.9 billion in cash dividends, funded $3.5 billion in capital expenditures, repaid $1.5 billion of long-term debt, and funded $649 million of share repurchases, prior to pausing share repurchases in March 2024.\nTEXT: In February 2025, we announced a 2.2% increase in our quarterly cash dividend to $2.30 per share.\nTEXT: Our ROIC was 31.3% for fiscal 2024 and 36.7% for fiscal 2023. The decrease in ROIC was primarily driven by higher average long-term debt and higher average equity due to the financing of the SRS acquisition. See the Non-GAAP Financial Measures section below for our definition and calculation of ROIC.\nTITLE: SRS Acquisition\nTEXT: On March 27, 2024, we entered into a definitive agreement to acquire SRS, a leading residential specialty trade distribution company across several verticals serving the professional roofer, landscaper and pool contractor. On June 18, 2024, following the satisfaction or waiver of the applicable closing conditions, including receipt of the requisite regulatory approvals, the acquisition was completed and all merger consideration was transferred. We believe the acquisition of SRS will accelerate the Company’s growth with the Pro. The acquisition is expected to establish the Company as a leading specialty trade distributor across multiple verticals, complement our existing capabilities, and enable us to better serve complex project purchase occasions with the renovator/remodeler. Refer to Note 2 and Note 13 to our consolidated financial statements for further discussion of the impact of the acquisition on our consolidated financial statements.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nsales, retail, square, change, earnings, income, average, fiscal, transactions, ticket\n\nTITLE: RESULTS OF OPERATIONS\nTEXT: The following table presents the percentage relationship between net sales and major categories in our consolidated statements of earnings:\nTEXT: FiscalFiscalFiscal202420232022dollars in millions$% of Net Sales$% of Net Sales$% of Net SalesNet sales$159,514 $152,669 $157,403 Gross profit53,308 33.4 %50,960 33.4 %52,778 33.5 %Operating expenses:Selling, general and administrative28,748 18.0 26,598 17.4 26,284 16.7 Depreciation and amortization3,034 1.9 2,673 1.8 2,455 1.6 Total operating expenses31,782 19.9 29,271 19.2 28,739 18.3 Operating income21,526 13.5 21,689 14.2 24,039 15.3 Interest and other (income) expense:Interest income and other, net(201)(0.1)(178)(0.1)(55)— Interest expense2,321 1.5 1,943 1.3 1,617 1.0 Interest and other, net2,120 1.3 1,765 1.2 1,562 1.0 Earnings before provision for income taxes19,406 12.2 19,924 13.1 22,477 14.3 Provision for income taxes4,600 2.9 4,781 3.1 5,372 3.4 Net earnings$14,806 9.3 %$15,143 9.9 %$17,105 10.9 %\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2024 2023 2022; dollars in millions $ % of Net Sales $ % of Net Sales $ % of Net Sales; Net sales $ 159,514 $ 152,669 $ 157,403; Gross profit 53,308 33.4 % 50,960 33.4 % 52,778 33.5 %; Selling, general and administrative 28,748 18.0 26,598 17.4 26,284 16.7; Depreciation and amortization 3,034 1.9 2,673 1.8 2,455 1.6; Total operating expenses 31,782 19.9 29,271 19.2 28,739 18.3; Operating income 21,526 13.5 21,689 14.2 24,039 15.3; Interest income and other, net (201) (0.1) (178) (0.1) (55) —; Interest expense 2,321 1.5 1,943 1.3 1,617 1.0; Interest and other, net 2,120 1.3 1,765 1.2 1,562 1.0; Earnings before provision for income taxes 19,406 12.2 19,924 13.1 22,477 14.3; Provision for income taxes 4,600 2.9 4,781 3.1 5,372 3.4; Net earnings $ 14,806 9.3 % $ 15,143 9.9 % $ 17,105 10.9 %.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: dollars in millions$% of Net Sales$% of Net Sales$% of Net Sales\nTITLE: dollars in millions\nTITLE: $\nTITLE: % of Net Sales\nTITLE: $\nTITLE: % of Net Sales\nTITLE: $\nTITLE: % of Net Sales\nTEXT: Earnings before provision for income taxes\nTEXT: Note: Fiscal 2024 includes 53 weeks. Fiscal 2023 and fiscal 2022 include 52 weeks. Certain percentages may not sum to totals due to rounding.\nTEXT: % Change Selected financial and sales data:FiscalFiscalFiscalFiscalFiscal2024202320222024 vs. 20232023 vs. 2022Comparable sales (% change) (1)(1.8)%(3.2)%3.1 %N/AN/AComparable customer transactions (% change) (1) (2)(1.0)%(2.9)%(5.4)%N/AN/AComparable average ticket (% change) (1) (2) (3)(0.9)%(0.3)%8.8 %N/AN/ACustomer transactions (in millions) (2)1,637.21,621.81,666.40.9 %(2.7)%Average ticket (2) (3)$89.31$90.07$90.36(0.8)%(0.3)%Sales per retail square foot (2) (4)$599.92$604.55$627.17(0.8)%(3.6)%Diluted earnings per share (5)$14.91$15.11$16.69(1.3)%(9.5)%\nTABLE: TABLE: Selected financial and sales data: Fiscal Fiscal Fiscal Fiscal Fiscal; 2024 2023 2022 2024 vs. 2023 2023 vs. 2022; Comparable sales (% change) (1) (1.8) % (3.2) % 3.1 % N/A N/A; Comparable customer transactions (% change) (1) (2) (1.0) % (2.9) % (5.4) % N/A N/A; Comparable average ticket (% change) (1) (2) (3) (0.9) % (0.3) % 8.8 % N/A N/A; Customer transactions (in millions) (2) 1,637.2 1,621.8 1,666.4 0.9 % (2.7) %; Average ticket (2) (3) $89.31 $90.07 $90.36 (0.8) % (0.3) %; Sales per retail square foot (2) (4) $599.92 $604.55 $627.17 (0.8) % (3.6) %; Diluted earnings per share (5) $14.91 $15.11 $16.69 (1.3) % (9.5) %.\nTITLE: % Change\nTITLE: Selected financial and sales data:FiscalFiscalFiscalFiscalFiscal\nTITLE: Selected financial and sales data:\nTITLE: Fiscal\nTITLE: 2024202320222024 vs. 20232023 vs. 2022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: 2024 vs. 2023\nTITLE: 2023 vs. 2022\nTEXT: Comparable sales (% change) (1)\nTEXT: Comparable customer transactions (% change) (1) (2)\nTEXT: Comparable average ticket (% change) (1) (2) (3)\nTEXT: Customer transactions (in millions) (2)\nTEXT: Sales per retail square foot (2) (4)\nTEXT: (1)Does not include results from the 53rd week of fiscal 2024.\nTEXT: (2)Customer transactions, average ticket, and sales per retail square foot measures do not include results from HD Supply or SRS.\nTEXT: (3)Average ticket represents the average price paid per transaction and is used by management to monitor the performance of the Company, as it represents a primary driver in measuring sales performance.\nTEXT: (4)Sales per retail square foot represents sales divided by retail store square footage. Sales per retail square foot is a measure of the efficiency of sales based on the total square footage of our stores and is used by management to monitor the performance of the Company’s retail operations as an indicator of the productivity of owned and leased square footage for these retail operations.\nTEXT: (5)The 53rd week of fiscal 2024 increased diluted earnings per share by approximately $0.30.\nTITLE: FISCAL 2024 COMPARED TO FISCAL 2023\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, sales, comparable, increased, primarily, week, other, weeks, measures, lower\n\nTITLE: Sales\nTEXT: We assess our sales performance by evaluating both net sales and comparable sales.\nTEXT: Net Sales. Fiscal 2024 consisted of 53 weeks compared to 52 weeks in fiscal 2023. Net sales for fiscal 2024 increased $6.8 billion, or 4.5%, to $159.5 billion. The increase in net sales for fiscal 2024 was primarily driven by SRS, which contributed $6.4 billion of net sales during fiscal 2024, and incremental net sales of approximately $2.5 billion attributable to the additional week in fiscal 2024. This increase in net sales was partially offset by the impact of a negative comparable sales environment, primarily driven by decreases in comparable customer transactions and comparable average ticket.\nTEXT: Online sales, which consist of sales generated online through our websites and mobile applications for products picked up at our stores or delivered to customer locations, represented 15.1% of net sales and increased by 6.6% during fiscal 2024 compared to fiscal 2023, including the online sales attributable to the additional week in fiscal 2024.\nTEXT: A stronger U.S. dollar negatively impacted net sales by $298 million in fiscal 2024.\nTEXT: Comparable Sales. Comparable sales is a measure that highlights the performance of our existing locations and websites by measuring the change in net sales for a period over the comparable prior period of equivalent length. Comparable sales includes sales at all locations, physical and online, open greater than 52 weeks (including remodels and relocations) and excludes closed stores. Retail stores become comparable on the Monday following their 52nd week of operation. Acquisitions are typically included in comparable sales after they have been owned for more than 52 weeks. Our comparable sales results for fiscal 2024 exclude the 53rd week and compare weeks 1 through 52 in fiscal 2024 to the 52-week period reported for fiscal 2023. The method of calculating comparable sales varies across the retail industry. As a result, our method of calculating comparable sales may not be the same as similarly titled measures reported by other companies.\nTEXT: Total comparable sales decreased 1.8% in fiscal 2024, reflecting a 1.0% decrease in comparable customer transactions and a 0.9% decrease in comparable average ticket compared to fiscal 2023. The decrease in comparable customer transactions primarily reflects the impact of heightened macroeconomic uncertainties and other macroeconomic factors, including the impacts of a persisting high interest rate environment pressuring home improvement demand. The decrease in comparable average ticket primarily reflects price stabilization relative to last year, slightly offset by demand for new and innovative products.\nTEXT: For fiscal 2024, our Power and Building Materials merchandising departments posted positive comparable sales compared to fiscal 2023. All of our other merchandising departments posted negative comparable sales during fiscal 2024 compared to fiscal 2023.\nTITLE: Gross Profit\nTEXT: Gross profit increased $2.3 billion, or 4.6%, to $53.3 billion in fiscal 2024. Gross profit as a percent of net sales, or gross profit margin, was 33.4% for both fiscal 2024 and fiscal 2023, and primarily reflected lower transportation costs and lower shrink within our Primary segment, offset by the inclusion of SRS in our consolidated results.\nTITLE: Operating Expenses\nTEXT: Our operating expenses are composed of SG&A and depreciation and amortization.\nTEXT: Selling, General & Administrative. SG&A increased $2.2 billion, or 8.1%, to $28.7 billion in fiscal 2024. As a percent of net sales, SG&A was 18.0% in fiscal 2024 compared to 17.4% in fiscal 2023, which primarily reflects higher payroll costs, deleverage from a negative comparable sales environment and lower legal-related benefits.\nTEXT: Depreciation and Amortization. Depreciation and amortization increased $361 million, or 13.5%, to $3.0 billion in fiscal 2024. As a percent of net sales, depreciation and amortization was 1.9% in fiscal 2024 compared to 1.8% in fiscal 2023, primarily reflecting increased intangible asset amortization expense of $239 million, of which $218 million was related to SRS, as well as increased depreciation expense from ongoing investments in the business.\nTITLE: Interest and Other, net\nTEXT: Interest and other, net increased $355 million, or 20.1%, to $2.1 billion in fiscal 2024. As a percent of net sales, interest and other, net, was 1.3% in fiscal 2024 compared to 1.2% in fiscal 2023, primarily due to higher interest expense driven by higher long-term debt.\nTITLE: Provision for Income Taxes\nTEXT: Our combined effective income tax rate was 23.7% in fiscal 2024 compared to 24.0% in fiscal 2023.\nTITLE: Diluted Earnings per Share\nTEXT: Diluted earnings per share were $14.91 in fiscal 2024 compared to $15.11 in fiscal 2023. The decrease in diluted earnings per share for fiscal 2024 was primarily driven by lower net earnings during fiscal 2024, partially offset by lower diluted shares. The 53rd week increased diluted earnings per share by approximately $0.30 for fiscal 2024.\nTITLE: NON-GAAP FINANCIAL MEASURES\nTEXT: To provide clarity on our operating performance, we supplement our reporting with certain non-GAAP financial measures. However, this supplemental information should not be considered in isolation or as a substitute for the related GAAP measures. Non-GAAP financial measures presented herein may differ from similar measures used by other companies.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, cash, share, capital, debt, business, repurchases, roic, financial, other\n\nTITLE: Return on Invested Capital\nTEXT: We believe ROIC is meaningful for management, investors and ratings agencies because it measures how effectively we deploy our capital base. ROIC is a non-GAAP profitability measure, not a measure of financial performance under GAAP. We define ROIC as NOPAT, a non-GAAP financial measure, for the most recent twelve-month period, divided by average debt and equity. We define average debt and equity as the average of beginning and ending long-term debt (including current installments) and equity for the most recent twelve-month period.\nTEXT: The following table presents the calculation of ROIC, together with a reconciliation of NOPAT to net earnings (the most comparable GAAP financial measure):\nTEXT: FiscalFiscalFiscaldollars in millions2024 (2)20232022Net earnings$14,806 $15,143 $17,105 Interest and other, net2,120 1,765 1,562 Provision for income taxes4,600 4,781 5,372 Operating income21,526 21,689 24,039 Income tax adjustment (1)(5,102)(5,205)(5,745)NOPAT$16,424 $16,484 $18,294 Average debt and equity$52,431 $44,955 $41,055 ROIC31.3 %36.7 %44.6 %\nTABLE: TABLE: Fiscal Fiscal Fiscal; dollars in millions 2024 (2) 2023 2022; Net earnings $ 14,806 $ 15,143 $ 17,105; Interest and other, net 2,120 1,765 1,562; Provision for income taxes 4,600 4,781 5,372; Operating income 21,526 21,689 24,039; Income tax adjustment (1) (5,102) (5,205) (5,745); NOPAT $ 16,424 $ 16,484 $ 18,294; Average debt and equity $ 52,431 $ 44,955 $ 41,055; ROIC 31.3 % 36.7 % 44.6 %.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: dollars in millions2024 (2)20232022\nTITLE: dollars in millions\nTITLE: 2024 (2)\nTITLE: 2023\nTITLE: 2022\nTEXT: Note: Fiscal 2024 includes 53 weeks. Fiscal 2023 and fiscal 2022 include 52 weeks.\nTEXT: (1)Income tax adjustment is defined as operating income multiplied by our effective tax rate for the trailing twelve months.\nTEXT: (2)Fiscal 2024 only includes operating results for SRS since the acquisition date of June 18, 2024, consistent with our consolidated financial statements.\nTITLE: LIQUIDITY AND CAPITAL RESOURCES\nTEXT: At February 2, 2025, we had $1.7 billion in cash and cash equivalents, of which $1.1 billion was held by our foreign subsidiaries. We believe that our current cash position, cash flow generated from operations, funds available from our commercial paper program, and access to the long-term debt capital markets should be sufficient not only for our operating requirements, any required debt payments, and satisfaction of other contractual obligations, but also to enable us to invest in the business, fund dividend payments, and fund any share repurchases through the next several fiscal years. In addition, we believe we have the ability to obtain alternative sources of financing, if necessary.\nTEXT: Our material cash requirements include contractual and other obligations arising in the normal course of business. These obligations primarily include long-term debt and related interest payments, operating and finance lease obligations, and purchase obligations. In addition to our cash requirements, we follow a disciplined approach to capital allocation. This approach first prioritizes investing in the business, followed by paying dividends, with the intent of then returning excess cash to shareholders in the form of share repurchases. In March 2024, we paused share repurchases in anticipation of the acquisition of SRS and do not have plans to resume share repurchases in fiscal 2025.\nTEXT: During fiscal 2024, we invested approximately $3.5 billion back into our business in the form of capital expenditures. In line with our expectation of approximately 2.5% of fiscal 2025 net sales, we plan to invest approximately $4 billion back into our business in the form of capital expenditures in fiscal 2025, with investments across initiatives to improve the customer experience, including through technology and development of other differentiated capabilities, to continue to mature and build out Pro capabilities, as well as to build new stores. However, we may adjust our capital expenditures to support the operations of the business, to enhance long-term strategic positioning, or in response to the economic environment, as necessary or appropriate. We may also utilize strategic acquisitions to help accelerate our strategic initiatives.\nTEXT: During fiscal 2024, we paid cash dividends of $8.9 billion to shareholders. In February 2025, we announced a 2.2% increase in our quarterly cash dividend from $2.25 to $2.30 per share. We intend to pay a dividend in the future; however, any future dividend is subject to declaration by our Board based on our earnings, capital requirements, financial condition, and other factors considered relevant by our Board.\nTEXT: In August 2023, our Board approved a $15.0 billion share repurchase authorization that replaced the previous authorization of $15.0 billion, which was approved in August 2022. The August 2023 authorization does not have a prescribed expiration date. As of February 2, 2025, approximately $11.7 billion of the $15.0 billion share repurchase authorization remained available. During fiscal 2024, we made cash payments of $649 million for repurchases of our common stock through open market purchases, prior to pausing share repurchases in March 2024 as discussed above.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncredit, facility, commercial, paper, program, aggregate, borrowings, february, back, scheduled\n\nTITLE: DEBT\nTEXT: At the beginning of fiscal 2024, we had a commercial paper program that allowed for an aggregate of $5.0 billion in borrowings. In connection with our program, we had back-up credit facilities with a consortium of banks for an aggregate of $5.0 billion in borrowings, which consisted of a five-year $3.5 billion credit facility scheduled to expire in July 2027 and a 364-day $1.5 billion credit facility scheduled to expire in July 2024.\nTEXT: In May 2024, we increased our commercial paper program from $5.0 billion to $19.5 billion in connection with the anticipated financing of the acquisition of SRS (see Note 13 to our consolidated financial statements for details regarding the SRS acquisition). In May 2024, in connection with the increase in the commercial paper program, we entered into three additional back-up credit facilities that consisted of a 364-day $3.5 billion credit facility scheduled to expire in May 2025, a three-year $1.0 billion credit facility scheduled to expire in May 2027, and a 364-day $10.0 billion credit facility scheduled to expire in May 2025. The $10.0 billion credit facility also provided that the commitments and any borrowings under that facility would be reduced by the amount of net cash proceeds we receive from any future debt issuance.\nTEXT: In June 2024, leading up to the acquisition of SRS on June 18, 2024, we raised commercial paper borrowings of over $15.0 billion to fund the transaction. On June 25, 2024, we received the proceeds from the issuance of $10.0 billion of long-term debt, as further discussed below, and immediately used the proceeds to repay approximately $10.0 billion of these commercial paper borrowings. On June 27, 2024, we terminated the $10.0 billion back-up credit facility, and subsequently reduced our commercial paper program from $19.5 billion to $9.5 billion.\nTEXT: In July 2024, we completed the renewal of our 364-day $1.5 billion credit facility, extending the maturity from July 2024 to July 2025.\nTEXT: In December 2024, we reduced our total credit facilities and concurrently reduced our commercial paper program, each by $2.5 billion. This reduction included terminating the three-year $1.0 billion back-up credit facility that was scheduled to expire in May 2027 and reducing the aggregate commitments under the 364-day back-up credit facility that is scheduled to expire in May 2025 from $3.5 billion to $2.0 billion. As of February 2, 2025, our commercial paper program allowed for an aggregate of $7.0 billion in borrowings and is supported by $7.0 billion of back-up credit facilities.\nTEXT: All of our short-term borrowings in fiscal 2024 were under our commercial paper program, and the maximum amount outstanding at any time was $15.3 billion. At February 2, 2025, we had outstanding borrowings under our commercial paper program of $316 million with a weighted-average interest rate of 4.4%, we had no outstanding borrowings under our back-up credit facilities, and we were in compliance with all of the covenants contained in our credit facilities, none of which are expected to impact our liquidity or capital resources.\nTEXT: We also issue senior notes from time to time as part of our capital management strategy. As discussed above, in June 2024, we issued $10.0 billion of senior notes in connection with the funding of the acquisition of SRS. Separately, in February 2024, we repaid $1.1 billion of senior notes at maturity. At February 2, 2025, we had an aggregate principal amount of senior notes outstanding of $51.1 billion, with $4.3 billion payable within 12 months. Future interest payments associated with these senior notes total $27.1 billion, with $2.1 billion payable within 12 months, based on current interest rates, which include the impact of our active interest rate swap agreements.\nTEXT: The indentures governing our senior notes do not generally limit our ability to incur additional indebtedness or require us to maintain financial ratios or specified levels of net worth or liquidity. The indentures governing our notes contain various customary covenants; however, none of the covenants are expected to impact our liquidity or capital resources. We were in compliance with all such covenants at February 2, 2025. See Note 5 to our consolidated financial statements for further discussion of our debt arrangements.\nTITLE: LEASES\nTEXT: We use operating and finance leases largely to obtain a portion of our real estate, including our stores, distribution centers, and store support centers. At February 2, 2025, we had aggregate remaining lease payment obligations of $15.2 billion, with $2.0 billion payable within 12 months. Aggregate lease obligations include approximately $560 million of obligations related to leases not yet commenced. See Note 3 to our consolidated financial statements for further discussion of our operating and finance leases.\nTITLE: PURCHASE OBLIGATIONS AND OTHER\nTEXT: Purchase obligations include all legally binding contracts such as firm commitments for inventory purchases, media and sponsorship spend, software and license commitments, and legally binding service contracts. We issue inventory purchase orders in the ordinary course of business, which are typically cancellable by their terms, therefore we do not consider purchase orders that are cancellable to be firm inventory commitments. At February 2, 2025, we had aggregate purchase obligations of $2.4 billion, with $1.1 billion payable within 12 months.\nTEXT: At February 2, 2025, we had aggregate liabilities for unrecognized tax benefits totaling $627 million, none of which are expected to be paid in the next 12 months. The timing of payment, if any, associated with our long-term unrecognized tax benefit liabilities is unknown. See Note 6 to our consolidated financial statements for further discussion of our unrecognized tax benefits.\nTEXT: We have no material off-balance sheet arrangements.\nTITLE: CASH FLOWS SUMMARY\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, fiscal, acquisition, estimates, assets, used, fair, significant, acquired, values\n\nTITLE: Operating Activities\nTEXT: Cash flow generated from operations provides us with a significant source of liquidity. Our operating cash flows result primarily from cash received from our customers, offset by cash payments we make for products and services, associate compensation, operations, occupancy costs, and income taxes. Cash provided by or used in operating activities is also subject to changes in working capital. Working capital at any point in time is subject to many variables, including seasonality, inventory management and category expansion, the timing of cash receipts and payments, vendor payment terms, and fluctuations in foreign exchange rates.\nTEXT: Net cash provided by operating activities decreased by $1.4 billion in fiscal 2024 compared to fiscal 2023, primarily due to changes in working capital. Changes in working capital were primarily driven by more normalized inventory levels during fiscal 2024 compared to strategic reductions in inventory during fiscal 2023 within our Primary segment, partially offset by the timing of vendor payments and the deferral of our fourth quarter fiscal 2024 estimated federal tax payment to the first quarter of fiscal 2025 under automatic income tax relief provided by the IRS for taxpayers located in certain southeastern states.\nTITLE: Investing Activities\nTEXT: Net cash used in investing activities increased by $16.3 billion in fiscal 2024 compared to fiscal 2023, primarily due to higher cash payments for businesses acquired in fiscal 2024, driven by our acquisition of SRS.\nTITLE: Financing Activities\nTEXT: Net cash used in financing activities in fiscal 2024 primarily reflected $8.9 billion of cash dividends paid, $1.5 billion of repayments of long-term debt, and $649 million of share repurchases prior to pausing share repurchases in March 2024, largely offset by approximately $10.0 billion of net proceeds from long-term debt and $316 million of proceeds from commercial paper borrowings, net of repayments.\nTEXT: Cash used in financing activities in fiscal 2023 primarily reflected $8.4 billion of cash dividends paid, $8.0 billion of share repurchases, and $1.3 billion of repayments of long-term debt, partially offset by $2.0 billion of net proceeds from long-term debt.\nTEXT: The overall decrease in cash flows used in financing activities during fiscal 2024 compared to fiscal 2023 totaled $14.7 billion and was predominantly attributable to the financing of the SRS acquisition and the pause of share repurchases. Specifically, as discussed above, a combination of commercial paper borrowings, the $10.0 billion long-term debt issuance, along with increased cash on hand resulting from the pause of share repurchases, were utilized in connection with the SRS acquisition. The commercial paper borrowings which were used specifically to fund the SRS acquisition were all subsequently repaid during the year.\nTITLE: CRITICAL ACCOUNTING ESTIMATES\nTEXT: The preparation of our consolidated financial statements in accordance with GAAP requires that we make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities, and the reported amounts of revenues and expenses. Actual results could differ from those estimates.\nTEXT: Our significant accounting policies are disclosed in Note 1 to our consolidated financial statements. The following discussion addresses our most critical accounting estimates, which are those that are both important for the representation of our financial condition and results of operations, and that require significant judgment or use of significant assumptions or complex estimates.\nTITLE: BUSINESS COMBINATIONS\nTEXT: We account for business combinations using the acquisition method of accounting, which requires that once control is obtained, all the assets acquired and liabilities assumed are recorded at their respective fair values at the date of acquisition. The determination of the acquisition date fair values of identifiable assets acquired and liabilities assumed requires estimates and the use of valuation techniques when fair value is not readily available and requires a significant amount of management judgment. For the valuation of intangible assets acquired in a business combination, we typically use an income approach. Specifically, for the SRS acquisition, we used the multi-period excess earnings method to determine the estimated acquisition date fair values of the customer relationships intangible assets. The significant assumptions used to estimate the fair values of customer relationships included forecasted revenues, expected customer attrition rates, and the discount rate applied. Although the Company believes its estimates of acquisition date fair values are reasonable, actual financial results could differ from those estimates due to the inherent uncertainty involved in making such estimates. Changes in assumptions concerning future financial results or other underlying assumptions could have a significant impact on the determination of the fair values of the customer relationships intangible assets acquired.\nTEXT: The excess of the purchase price over fair values of identifiable assets acquired and liabilities assumed is recorded as goodwill. During the measurement period, which is up to one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill due to the use of preliminary information in our initial estimates. Upon the conclusion of the measurement period, any subsequent adjustments are recorded to earnings.\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ninventory, retail, cost, method, shrink, value, based, market, losses, results\n\nTITLE: MERCHANDISE INVENTORIES\nTEXT: We value the majority of our inventory under the retail inventory method, with the remainder of our inventories valued under a cost method, primarily the first-in, first-out method. Under the retail inventory method, inventories are stated at cost, which is determined by applying a cost-to-retail ratio to the retail value of inventories.\nTEXT: The retail value of our inventory is adjusted as needed to reflect current market conditions. Because these adjustments are based on current prevailing market conditions, the value of our inventory approximates the lower of cost or market. The valuation under the retail inventory method is based on a number of factors such as markups, markdowns, and inventory losses (or shrink). As such, there exists an inherent uncertainty in the final determination of inventory cost and gross profit. We determine markups and markdowns based on the consideration of a variety of factors such as current and anticipated demand, customer preferences and buying trends, age of the merchandise, and weather conditions.\nTEXT: We calculate shrink based on actual inventory losses identified as a result of physical inventory counts during each fiscal period and estimated inventory losses occurring between physical inventory counts. The estimate for shrink occurring in the interim period between physical inventory counts is calculated on a store-specific basis and is primarily based on recent shrink results. A 10% increase in the shrink rate used to estimate our inventory shrink reserve would have increased cost of sales by approximately $95 million for fiscal 2024. Historically, the difference between estimated shrink and actual inventory losses has not been material to our annual financial results.\nTEXT: We do not believe there is a reasonable likelihood of a material change in the estimates or assumptions we use to value our inventory under the retail inventory method. We believe that the retail inventory method provides an inventory valuation which approximates cost and results in valuing our inventory at the lower of cost or market.\nTITLE: ADDITIONAL INFORMATION\nTEXT: For information on our accounting policies and on accounting pronouncements that have impacted or may materially impact our financial condition, results of operations, or cash flows, see Note 1 to our consolidated financial statements.\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nnote, consolidated, statements, financial, accounting, company, stockholders, february, audits, public\n\nTEXT: Financial Statements and Supplementary Data.\nTITLE: TABLE OF CONTENTS\nTEXT: Report of Independent Registered Public Accounting Firm37Consolidated Balance Sheets39Consolidated Statements of Earnings40Consolidated Statements of Comprehensive Income41Consolidated Statements of Stockholders' Equity42Consolidated Statements of Cash Flows43Notes to Consolidated Financial Statements44Note 1. Summary of Significant Accounting Policies44Note 2. Segment Reporting and Net Sales51Note 3. Property and Leases54Note 4. Goodwill and Intangible Assets56Note 5. Debt and Derivative Instruments57Note 6. Income Taxes61Note 7. Stockholders' Equity64Note 8. Fair Value Measurements64Note 9. Stock-Based Compensation65Note 10. Employee Benefit Plans69Note 11. Weighted Average Common Shares69Note 12. Commitments and Contingencies69Note 13. Acquisitions69\nTABLE: TABLE: Report of Independent Registered Public Accounting Firm 37; Consolidated Balance Sheets 39; Consolidated Statements of Earnings 40; Consolidated Statements of Comprehensive Income 41; Consolidated Statements of Stockholders' Equity 42; Consolidated Statements of Cash Flows 43; Notes to Consolidated Financial Statements 44; Note 1. Summary of Significant Accounting Policies 44; Note 2. Segment Reporting and Net Sales 51; Note 3. Property and Leases 54; Note 4. Goodwill and Intangible Assets 56; Note 5. Debt and Derivative Instruments 57; Note 6. Income Taxes 61; Note 7. Stockholders' Equity 64; Note 8. Fair Value Measurements 64; Note 9. Stock-Based Compensation 65; Note 10. Employee Benefit Plans 69; Note 11. Weighted Average Common Shares 69; Note 12. Commitments and Contingencies 69; Note 13. Acquisitions 69.\nTEXT: Report of Independent Registered Public Accounting Firm\nTEXT: Consolidated Statements of Earnings\nTEXT: Consolidated Statements of Comprehensive Income\nTEXT: Consolidated Statements of Stockholders' Equity\nTEXT: Consolidated Statements of Cash Flows\nTEXT: Notes to Consolidated Financial Statements\nTEXT: Note 1. Summary of Significant Accounting Policies\nTEXT: Note 2. Segment Reporting and Net Sales\nTEXT: Note 4. Goodwill and Intangible Assets\nTEXT: Note 5. Debt and Derivative Instruments\nTEXT: Note 8. Fair Value Measurements\nTEXT: Note 9. Stock-Based Compensation\nTEXT: Note 10. Employee Benefit Plans\nTEXT: Note 11. Weighted Average Common Shares\nTEXT: Note 12. Commitments and Contingencies\nTITLE: REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTEXT: To the Stockholders and the Board of Directors\nTITLE: Opinion on the Consolidated Financial Statements\nTEXT: We have audited the accompanying consolidated balance sheets of The Home Depot, Inc. and its subsidiaries (the Company) as of February 2, 2025 and January 28, 2024, the related consolidated statements of earnings, comprehensive income, stockholders’ equity, and cash flows for each of the fiscal years in the three-year period ended February 2, 2025, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of February 2, 2025 and January 28, 2024, and the results of its operations and its cash flows for each of the fiscal years in the three-year period ended February 2, 2025, in conformity with U.S. generally accepted accounting principles.\nTEXT: We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of February 2, 2025, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated March 20, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nTITLE: Basis for Opinion\nTEXT: These consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ninventory, company, audit, customer, shrink, critical, used, assumptions, fair, values\n\nTITLE: Critical Audit Matters\nTEXT: The critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nTEXT: Fair values of customer relationships intangible assets\nTEXT: As discussed in Note 13 to the consolidated financial statements, on June 18, 2024, the Company acquired SRS Distribution Inc. (SRS) in a business combination. As a result of the transaction, the Company acquired customer relationships intangible assets associated with the generation of future income from existing customers. The acquisition-date fair values of the customer relationships intangible assets recorded by the Company were approximately $5.4 billion. The Company used the multi-period excess earnings method of the income approach to determine the estimated fair values of the customer relationships intangible assets.\nTEXT: We identified the evaluation of the acquisition-date fair values of the customer relationships intangible assets acquired in the SRS business combination as a critical audit matter. A high degree of subjective auditor judgment was required to evaluate certain assumptions used in the valuation models, including the forecasted revenues and long-term forecasted revenue growth rates, expected customer attrition rates, and the discount rate applied. Changes in these assumptions could have had a significant impact on the fair values of the customer relationships intangible assets. Specialized skills and knowledge were required to assess these significant assumptions and evaluate evidence obtained.\nTEXT: The following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s acquisition-date valuation process, including controls related to the development of the above assumptions. We performed sensitivity analyses over the assumptions noted above used to determine the acquisition-date fair values of the customer relationships intangible assets to assess the impact changes in those assumptions would have on the Company’s determination of fair values. We evaluated forecasted revenues used by the Company by comparing to certain publicly available information for comparable companies, industry reports, and historical revenues achieved. We involved valuation professionals with specialized skills and knowledge, who assisted in evaluating the:\nTEXT: •long-term forecasted revenue growth rates used by comparing to certain nationwide economic trend data such as GDP, inflation, and relevant industry data\nTEXT: •expected customer attrition rates applied by testing management’s process to develop the attrition rate using historical revenue data\nTEXT: •discount rate used in the valuations by comparing the inputs to the discount rate to publicly available market data for comparable entities.\nTEXT: As discussed in Note 1 to the consolidated financial statements, the majority of the Company’s U.S. merchandise inventories are stated at the lower of cost or market as determined by the retail inventory method, which is based on a number of factors such as markups, markdowns, and inventory losses (or shrink). Shrink is the difference between the recorded amount of inventory and the physical inventory count. The Company calculates shrink based on actual inventory losses identified as a result of physical inventory counts during each fiscal period and estimated inventory losses occurring between physical inventory counts. The estimate for shrink occurring in the interim period between physical inventory counts is calculated on a store-specific basis and is primarily based on recent shrink results.\nTEXT: We identified the evaluation of the estimation of store shrink occurring in the period between physical inventory counts and fiscal year-end as a critical audit matter. Evaluating the Company’s estimation of shrink at the end of the fiscal year using interim inventory loss experience in U.S. retail stores involved auditor judgment.\nTEXT: The following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the process of developing the estimate of store shrink. We evaluated the appropriateness of the Company using interim physical inventory counts to estimate inventory losses in U.S. retail stores at the end of the fiscal year by:\nTEXT: •Evaluating the method and certain assumptions used;\nTEXT: •Testing the application of the method and certain assumptions used;\nTEXT: •Performing a current year trend analysis; and\nTEXT: •Performing a sensitivity analysis over the shrink reserve estimate.\nTEXT: We have served as the Company’s auditor since 1979.\nTITLE: THE HOME DEPOT, INC.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nshares, other, liabilities, january, assets, total, income, current, operating, february\n\nTITLE: CONSOLIDATED BALANCE SHEETS\nTEXT: in millions, except per share dataFebruary 2,2025January 28,2024AssetsCurrent assets:Cash and cash equivalents$1,659 $3,760 Receivables, net4,903 3,328 Merchandise inventories23,451 20,976 Other current assets1,670 1,711 Total current assets31,683 29,775 Net property and equipment26,702 26,154 Operating lease right-of-use assets8,592 7,884 Goodwill19,475 8,455 Intangible assets, net8,983 3,606 Other assets684 656 Total assets$96,119 $76,530 Liabilities and Stockholders’ EquityCurrent liabilities:Short-term debt$316 $— Accounts payable11,938 10,037 Accrued salaries and related expenses2,315 2,096 Sales taxes payable628 449 Deferred revenue2,610 2,762 Income taxes payable832 28 Current installments of long-term debt4,582 1,368 Current operating lease liabilities1,274 1,050 Other accrued expenses4,166 4,225 Total current liabilities28,661 22,015 Long-term debt, excluding current installments48,485 42,743 Long-term operating lease liabilities7,633 7,082 Deferred income taxes1,962 863 Other long-term liabilities2,738 2,783 Total liabilities89,479 75,486 Commitments and contingencies (Note 12)Common stock, par value $0.05; authorized: 10,000 shares; issued: 1,800 shares at February 2, 2025 and 1,796 shares at January 28, 2024; outstanding: 994 shares at February 2, 2025 and 992 shares at January 28, 202490 90 Paid-in capital14,117 13,147 Retained earnings89,533 83,656 Accumulated other comprehensive loss(1,129)(477)Treasury stock, at cost, 806 shares at February 2, 2025 and 804 shares at January 28, 2024(95,971)(95,372)Total stockholders’ equity6,640 1,044 Total liabilities and stockholders’ equity$96,119 $76,530\nTABLE: TABLE: in millions, except per share data February 2,2025 January 28,2024; Cash and cash equivalents $ 1,659 $ 3,760; Receivables, net 4,903 3,328; Merchandise inventories 23,451 20,976; Other current assets 1,670 1,711; Total current assets 31,683 29,775; Net property and equipment 26,702 26,154; Operating lease right-of-use assets 8,592 7,884; Goodwill 19,475 8,455; Intangible assets, net 8,983 3,606; Other assets 684 656; Total assets $ 96,119 $ 76,530; Short-term debt $ 316 $ —; Accounts payable 11,938 10,037; Accrued salaries and related expenses 2,315 2,096; Sales taxes payable 628 449; Deferred revenue 2,610 2,762; Income taxes payable 832 28; Current installments of long-term debt 4,582 1,368; Current operating lease liabilities 1,274 1,050; Other accrued expenses 4,166 4,225; Total current liabilities 28,661 22,015; Long-term debt, excluding current installments 48,485 42,743; Long-term operating lease liabilities 7,633 7,082; Deferred income taxes 1,962 863; Other long-term liabilities 2,738 2,783; Total liabilities 89,479 75,486; Common stock, par value $0.05; authorized: 10,000 shares; issued: 1,800 shares at February 2, 2025 and 1,796 shares at January 28, 2024; outstanding: 994 shares at February 2, 2025 and 992 shares at January 28, 2024 90 90; Paid-in capital 14,117 13,147; Retained earnings 89,533 83,656; Accumulated other comprehensive loss (1,129) (477); Treasury stock, at cost, 806 shares at February 2, 2025 and 804 shares at January 28, 2024 (95,971) (95,372); Total stockholders’ equity 6,640 1,044; Total liabilities and stockholders’ equity $ 96,119 $ 76,530.\nTITLE: in millions, except per share dataFebruary 2,2025January 28,2024\nTITLE: in millions, except per share data\nTITLE: February 2,2025\nTITLE: January 28,2024\nTITLE: Assets\nTITLE: Liabilities and Stockholders’ Equity\nTEXT: Commitments and contingencies (Note 12)\nTEXT: Common stock, par value $0.05; authorized: 10,000 shares; issued: 1,800 shares at February 2, 2025 and 1,796 shares at January 28, 2024; outstanding: 994 shares at February 2, 2025 and 992 shares at January 28, 2024\nTEXT: Treasury stock, at cost, 806 shares at February 2, 2025 and 804 shares at January 28, 2024\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: CONSOLIDATED STATEMENTS OF EARNINGS\nTEXT: in millions, except per share dataFiscalFiscalFiscal202420232022Net sales$159,514 $152,669 $157,403 Cost of sales106,206 101,709 104,625 Gross profit53,308 50,960 52,778 Operating expenses:Selling, general and administrative28,748 26,598 26,284 Depreciation and amortization3,034 2,673 2,455 Total operating expenses31,782 29,271 28,739 Operating income21,526 21,689 24,039 Interest and other (income) expense:Interest income and other, net(201)(178)(55)Interest expense2,321 1,943 1,617 Interest and other, net2,120 1,765 1,562 Earnings before provision for income taxes19,406 19,924 22,477 Provision for income taxes4,600 4,781 5,372 Net earnings$14,806 $15,143 $17,105 Basic weighted average common shares990 999 1,022 Basic earnings per share$14.96 $15.16 $16.74 Diluted weighted average common shares993 1,002 1,025 Diluted earnings per share$14.91 $15.11 $16.69\nTABLE: TABLE: in millions, except per share data Fiscal Fiscal Fiscal; 2024 2023 2022; Net sales $ 159,514 $ 152,669 $ 157,403; Cost of sales 106,206 101,709 104,625; Gross profit 53,308 50,960 52,778; Selling, general and administrative 28,748 26,598 26,284; Depreciation and amortization 3,034 2,673 2,455; Total operating expenses 31,782 29,271 28,739; Operating income 21,526 21,689 24,039; Interest income and other, net (201) (178) (55); Interest expense 2,321 1,943 1,617; Interest and other, net 2,120 1,765 1,562; Earnings before provision for income taxes 19,406 19,924 22,477; Provision for income taxes 4,600 4,781 5,372; Net earnings $ 14,806 $ 15,143 $ 17,105; Basic weighted average common shares 990 999 1,022; Basic earnings per share $ 14.96 $ 15.16 $ 16.74; Diluted weighted average common shares 993 1,002 1,025; Diluted earnings per share $ 14.91 $ 15.11 $ 16.69.\nTITLE: in millions, except per share dataFiscalFiscalFiscal\nTITLE: in millions, except per share data\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nbalance, fiscal, other, weeks, comprehensive, stock, income, loss, beginning, includes\n\nTITLE: 2022\nTEXT: Fiscal 2024 includes 53 weeks. Fiscal 2023 and fiscal 2022 include 52 weeks.\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nTEXT: FiscalFiscalFiscalin millions202420232022Net earnings$14,806 $15,143 $17,105 Other comprehensive income (loss), net of tax:Foreign currency translation adjustments(605)232 (22)Cash flow hedges(45)8 9 Other(2)1 (1)Total other comprehensive income (loss), net of tax(652)241 (14)Comprehensive income$14,154 $15,384 $17,091\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2024 2023 2022; Net earnings $ 14,806 $ 15,143 $ 17,105; Foreign currency translation adjustments (605) 232 (22); Cash flow hedges (45) 8 9; Other (2) 1 (1); Total other comprehensive income (loss), net of tax (652) 241 (14); Comprehensive income $ 14,154 $ 15,384 $ 17,091.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202420232022\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: Other comprehensive income (loss), net of tax:\nTEXT: Total other comprehensive income (loss), net of tax\nTEXT: Fiscal 2024 includes 53 weeks. Fiscal 2023 and fiscal 2022 include 52 weeks.\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: CONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nTEXT: in millionsFiscalFiscalFiscal202420232022Common Stock:Balance at beginning of year$90 $90 $90 Shares issued under employee stock plans, net— — — Balance at end of year90 90 90 Paid-in Capital:Balance at beginning of year13,147 12,592 12,132 Shares issued under employee stock plans, net530 175 94 Stock-based compensation expense440 380 366 Balance at end of year14,117 13,147 12,592 Retained Earnings:Balance at beginning of year83,656 76,896 67,580 Net earnings14,806 15,143 17,105 Cash dividends(8,929)(8,383)(7,789)Balance at end of year89,533 83,656 76,896 Accumulated Other Comprehensive Loss:Balance at beginning of year(477)(718)(704)Foreign currency translation adjustments, net of tax(605)232 (22)Cash flow hedges, net of tax(45)8 9 Other, net of tax(2)1 (1)Balance at end of year(1,129)(477)(718)Treasury Stock:Balance at beginning of year(95,372)(87,298)(80,794)Repurchases of common stock(599)(8,074)(6,504)Balance at end of year(95,971)(95,372)(87,298)Total stockholders’ equity$6,640 $1,044 $1,562\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Balance at beginning of year $ 90 $ 90 $ 90; Shares issued under employee stock plans, net — — —; Balance at end of year 90 90 90; Balance at beginning of year 13,147 12,592 12,132; Shares issued under employee stock plans, net 530 175 94; Stock-based compensation expense 440 380 366; Balance at end of year 14,117 13,147 12,592; Balance at beginning of year 83,656 76,896 67,580; Net earnings 14,806 15,143 17,105; Cash dividends (8,929) (8,383) (7,789); Balance at end of year 89,533 83,656 76,896; Balance at beginning of year (477) (718) (704); Foreign currency translation adjustments, net of tax (605) 232 (22); Cash flow hedges, net of tax (45) 8 9; Other, net of tax (2) 1 (1); Balance at end of year (1,129) (477) (718); Balance at beginning of year (95,372) (87,298) (80,794); Repurchases of common stock (599) (8,074) (6,504); Balance at end of year (95,971) (95,372) (87,298); Total stockholders’ equity $ 6,640 $ 1,044 $ 1,562.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Common Stock:\nTITLE: Paid-in Capital:\nTITLE: Retained Earnings:\nTITLE: Accumulated Other Comprehensive Loss:\nTITLE: Treasury Stock:\nTEXT: Fiscal 2024 includes 53 weeks. Fiscal 2023 and fiscal 2022 include 52 weeks.\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, activities, changes, home, products, operating, amortization, acquisition, other, financing\n\nTITLE: CONSOLIDATED STATEMENTS OF CASH FLOWS\nTEXT: FiscalFiscalFiscalin millions202420232022Cash Flows from Operating Activities:Net earnings$14,806 $15,143 $17,105 Reconciliation of net earnings to net cash provided by operating activities:Depreciation and amortization, excluding amortization of intangible assets3,336 3,061 2,796 Intangible asset amortization425 186 179 Stock-based compensation expense442 380 366 Changes in receivables, net174 134 111 Changes in merchandise inventories(743)4,137 (2,830)Changes in other current assets86 (184)(311)Changes in accounts payable and accrued expenses518 (1,411)(2,577)Changes in deferred revenue(165)(318)(526)Changes in income taxes payable809 (25)(107)Changes in deferred income taxes15 (245)138 Other operating activities107 314 271 Net cash provided by operating activities19,810 21,172 14,615 Cash Flows from Investing Activities:Capital expenditures(3,485)(3,226)(3,119)Payments for businesses acquired, net (17,644)(1,514)— Other investing activities98 11 (21)Net cash used in investing activities(21,031)(4,729)(3,140)Cash Flows from Financing Activities:Proceeds from (repayments of) short-term debt, net316 — (1,035)Proceeds from long-term debt, net of discounts10,010 1,995 6,942 Repayments of long-term debt(1,536)(1,271)(2,491)Repurchases of common stock(649)(7,951)(6,696)Proceeds from sales of common stock395 323 264 Cash dividends(8,929)(8,383)(7,789)Other financing activities(301)(156)(188)Net cash used in financing activities(694)(15,443)(10,993)Change in cash and cash equivalents(1,915)1,000 482 Effect of exchange rate changes on cash and cash equivalents(186)3 (68)Cash and cash equivalents at beginning of year3,760 2,757 2,343 Cash and cash equivalents at end of year$1,659 $3,760 $2,757 Supplemental Disclosures:Cash paid for income taxes$3,653 $5,023 $5,435 Cash paid for interest, net of interest capitalized2,199 1,809 1,449 Non-cash capital expenditures250 364 351 Non-cash acquisition purchase consideration (Note 13)321 — —\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2024 2023 2022; Net earnings $ 14,806 $ 15,143 $ 17,105; Depreciation and amortization, excluding amortization of intangible assets 3,336 3,061 2,796; Intangible asset amortization 425 186 179; Stock-based compensation expense 442 380 366; Changes in receivables, net 174 134 111; Changes in merchandise inventories (743) 4,137 (2,830); Changes in other current assets 86 (184) (311); Changes in accounts payable and accrued expenses 518 (1,411) (2,577); Changes in deferred revenue (165) (318) (526); Changes in income taxes payable 809 (25) (107); Changes in deferred income taxes 15 (245) 138; Other operating activities 107 314 271; Net cash provided by operating activities 19,810 21,172 14,615; Capital expenditures (3,485) (3,226) (3,119); Payments for businesses acquired, net (17,644) (1,514) —; Other investing activities 98 11 (21); Net cash used in investing activities (21,031) (4,729) (3,140); Proceeds from (repayments of) short-term debt, net 316 — (1,035); Proceeds from long-term debt, net of discounts 10,010 1,995 6,942; Repayments of long-term debt (1,536) (1,271) (2,491); Repurchases of common stock (649) (7,951) (6,696); Proceeds from sales of common stock 395 323 264; Cash dividends (8,929) (8,383) (7,789); Other financing activities (301) (156) (188); Net cash used in financing activities (694) (15,443) (10,993); Change in cash and cash equivalents (1,915) 1,000 482; Effect of exchange rate changes on cash and cash equivalents (186) 3 (68); Cash and cash equivalents at beginning of year 3,760 2,757 2,343; Cash and cash equivalents at end of year $ 1,659 $ 3,760 $ 2,757; Cash paid for income taxes $ 3,653 $ 5,023 $ 5,435; Cash paid for interest, net of interest capitalized 2,199 1,809 1,449; Non-cash capital expenditures 250 364 351; Non-cash acquisition purchase consideration (Note 13) 321 — —.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202420232022\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Cash Flows from Operating Activities:\nTEXT: Reconciliation of net earnings to net cash provided by operating activities:\nTEXT: Depreciation and amortization, excluding amortization of intangible assets\nTITLE: Cash Flows from Investing Activities:\nTITLE: Cash Flows from Financing Activities:\nTEXT: Proceeds from (repayments of) short-term debt, net\nTEXT: Net cash used in financing activities\nTITLE: Supplemental Disclosures:\nTEXT: Non-cash acquisition purchase consideration (Note 13)\nTEXT: Fiscal 2024 includes 53 weeks. Fiscal 2023 and fiscal 2022 include 52 weeks.\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: 1.SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nTITLE: SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nTITLE: Business\nTEXT: The Home Depot, Inc., together with its subsidiaries (the “Company,” “The Home Depot,” “Home Depot,” “we,” “our” or “us”), is a home improvement retailer that sells a wide assortment of building materials, home improvement products, lawn and garden products, décor products, and facilities MRO products in stores and online. We also provide a number of services, including home improvement installation services, and tool and equipment rental.\nTEXT: During the second quarter of fiscal 2024, we completed the acquisition of SRS, a leading residential specialty trade distribution company that sells roofing and complementary building products, landscape, and pool products to professional contractors. Refer to Note 2 and Note 13 for further discussion on the acquisition, including certain impacts of the acquisition on our consolidated financial statements.\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ninventory, receivables, fiscal, cost, method, financial, shrink, statements, assets, physical\n\nTITLE: Consolidation and Presentation\nTEXT: Our consolidated financial statements include our accounts and those of our subsidiaries. Intercompany balances and transactions are eliminated in consolidation. Our fiscal year is a 52- or 53-week period ending on the Sunday nearest to January 31. Fiscal 2024 includes 53 weeks, while fiscal 2023 and fiscal 2022 include 52 weeks.\nTITLE: Reclassifications\nTEXT: Effective July 28, 2024, we began separately presenting intangible assets, net, on the consolidated balance sheets, which were previously included in the other assets line item. In addition, we began separately presenting intangible asset amortization on the statements of cash flows, which was previously included in the depreciation and amortization line item. Prior period amounts have been reclassified to conform to the current year’s financial statement presentation.\nTITLE: Use of Estimates\nTEXT: We have made a number of estimates and assumptions relating to the reporting of assets and liabilities, the disclosure of contingent assets and liabilities, and reported amounts of revenues and expenses in preparing these financial statements in conformity with GAAP. While we believe these estimates and assumptions are reasonable, actual results could differ from these estimates.\nTITLE: Cash and Cash Equivalents\nTEXT: Cash and cash equivalents consist of cash on hand and highly liquid investments purchased with original maturities of three months or less.\nTITLE: Receivables, net\nTEXT: The following table presents components of receivables, net:\nTEXT: in millionsFebruary 2,2025January 28,2024Card receivables$1,019 $988 Rebate receivables1,404 841 Customer receivables1,896 924 Other receivables584 575 Receivables, net$4,903 $3,328\nTABLE: TABLE: in millions February 2,2025 January 28,2024; Card receivables $ 1,019 $ 988; Rebate receivables 1,404 841; Customer receivables 1,896 924; Other receivables 584 575; Receivables, net $ 4,903 $ 3,328.\nTITLE: in millionsFebruary 2,2025January 28,2024\nTITLE: in millions\nTITLE: February 2,2025\nTITLE: January 28,2024\nTEXT: Card receivables consist of payments due from financial institutions for the settlement of credit card and debit card transactions. Rebate receivables represent amounts due from vendors for volume and co-op advertising rebates. Customer receivables relate to credit extended directly to certain customers in the ordinary course of business, which increased compared to the beginning of the year primarily as a result of the SRS acquisition. The valuation allowance related to these receivables was not material to our consolidated financial statements at the end of fiscal 2024 or fiscal 2023.\nTITLE: Merchandise Inventories\nTEXT: Inventory cost includes the amount we pay to acquire inventory, including freight and import costs, as well as operating costs and depreciation associated with our sourcing and distribution network, and is net of certain vendor allowances. The majority of our merchandise inventories are stated at the lower of cost or market, as determined by the retail inventory method, which is based on a number of factors such as markups, markdowns, and inventory losses (or shrink). As the inventory retail value is adjusted regularly to reflect market conditions, inventory valued using the retail method approximates the lower of cost or market. Our remaining merchandise inventories, including those within our retail operations in Canada and Mexico, distribution centers, and SRS, are recorded at the lower of cost or net realizable value, as determined by a cost method, primarily the first-in, first-out method. We evaluate the inventory valued using a cost method at the end of each quarter to ensure that it is carried at the lower of cost or net realizable value, and the adjustments recorded to merchandise inventories valued under a cost method were not material to our consolidated financial statements at the end of fiscal 2024 or fiscal 2023.\nTEXT: Physical inventory counts or cycle counts are taken on a regular basis in our stores, distribution centers and branches to ensure that amounts reflected in merchandise inventories are properly stated. Shrink (or in the case of excess inventory, swell) is the difference between the recorded amount of inventory and the physical inventory count. We calculate shrink based on actual inventory losses identified as a result of physical inventory counts during each fiscal period and estimated inventory losses occurring between physical inventory counts. The estimate for shrink occurring in the interim period between physical inventory counts is calculated on a store-specific basis and is primarily based on recent shrink results. Historically, the difference between estimated shrink and actual inventory losses has not been material to our annual financial results.\nTITLE: Property and Equipment\nTEXT: Buildings and related improvements, furniture, fixtures, and equipment are recorded at cost and depreciated using the straight-line method over their estimated useful lives. Leasehold improvements and assets held under finance leases are amortized using the straight-line method over the original term of the lease or the useful life of the asset, whichever is shorter.\nTEXT: The following table presents the estimated useful lives of our property and equipment:\nTITLE: LifeBuildings and improvements5 – 45 yearsFurniture, fixtures and equipment2 – 20 yearsLeasehold improvements5 – 45 years\nTABLE: TABLE: Buildings and improvements 5 – 45 years; Furniture, fixtures and equipment 2 – 20 years; Leasehold improvements 5 – 45 years.\nTITLE: LifeBuildings and improvements5 – 45 yearsFurniture, fixtures and equipment2 – 20 yearsLeasehold improvements5 – 45 years\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nlease, certain, value, assets, rate, payments, term, which, impairment, asset\n\nTITLE: Life\nTEXT: We capitalize certain costs, including interest, related to construction in progress and the acquisition and development of software. Costs associated with the acquisition and development of software are amortized using the straight-line method over the estimated useful life of the software, which ranges from three to seven years. Certain development costs not meeting the criteria for capitalization are expensed as incurred.\nTEXT: We evaluate our long-lived assets each quarter for indicators of potential impairment. Indicators of impairment include current period losses combined with a history of losses, our decision to relocate or close a store or other location before the end of its previously estimated useful life, or when changes in other circumstances indicate the carrying amount of an asset group may not be recoverable. The evaluation for long-lived assets is performed at the lowest level of identifiable cash flows, which is generally the individual store level. Long-lived assets with indicators of impairment are evaluated for recoverability by comparing their undiscounted future cash flows with their carrying value. If the carrying value is greater than the undiscounted future cash flows, we then measure the asset group’s fair value to determine whether an impairment loss should be recognized. If the resulting fair value is less than the carrying value, an impairment loss is recognized for the difference between the carrying value and the estimated fair value. Impairment losses on property and equipment are generally recorded as a component of SG&A. Impairment charges for long-lived assets were not material to our consolidated financial statements in fiscal 2024, fiscal 2023, or fiscal 2022.\nTITLE: Leases\nTEXT: We enter into contractual arrangements for the utilization of certain non-owned assets which are evaluated as finance or operating leases upon commencement, and are accounted for accordingly. Specifically, a contract is or contains a lease when (1) the contract contains an explicitly or implicitly identified asset and (2) we obtain substantially all of the economic benefits from the use of that underlying asset and direct how and for what purpose the asset is used during the term of the contract in exchange for consideration. We assess whether an arrangement is or contains a lease at inception of the contract.\nTEXT: Our leases include certain retail locations, warehouse and distribution space, office space, equipment, and vehicles. A substantial majority of our leases have remaining lease terms of one to 20 years. Our real estate leases typically provide the option to extend the lease for five-year terms, and some of our leases include early termination options. The lease term used to calculate the right-of-use asset and lease liability at commencement includes the impacts of options to extend or terminate the lease when it is reasonably certain that we will exercise that option. When determining whether it is reasonably certain that we will exercise an option at commencement, we consider various existing economic factors, including market conditions, real estate strategies, the nature, length, and terms of the agreement, as well as the uncertainty of the condition of leased equipment at the end of the lease term. Based on these determinations, we generally conclude that the exercise of renewal options would not be reasonably certain in determining the lease term at commencement.\nTEXT: The discount rate used to calculate the present value of lease payments is the rate implicit in the lease, when readily determinable. As the rate implicit in the lease is rarely readily determinable, we use a secured incremental borrowing rate, which is updated on a quarterly basis, as the discount rate for the present value of lease payments.\nTEXT: Real estate taxes, insurance, maintenance, and operating expenses applicable to the leased asset are generally our obligations under our lease agreements. In instances where these payments are fixed, they are included in the measurement of our lease liabilities, and when variable, they are excluded and recognized in the period in which the obligation for those payments is incurred. Certain of our lease agreements also include rental payments based on an index or rate, and others include rental payments based on a percentage of sales. For variable payments dependent upon an index or rate, we apply the active index or rate as of the lease commencement date. Variable lease payments not based on an index or rate are not included in the measurement of our lease liabilities, as they cannot be reasonably estimated, and are recognized in the period in which the obligation for those payments is incurred.\nTEXT: Leases that have a term of twelve months or less upon commencement are considered short-term in nature. Short-term leases are not included on the consolidated balance sheets and are expensed on a straight-line basis over the lease term. We have also elected to not separate lease and non-lease components for certain classes of assets including real estate and certain equipment.\nTEXT: Our lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nTITLE: Business Combinations\nTEXT: The assets and liabilities of acquired businesses are recorded at their fair values at the date of acquisition. The excess of the purchase price over the fair values of the identifiable assets acquired and liabilities assumed is recorded as goodwill. During the measurement period, which is up to one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill. Upon conclusion of the measurement period, any subsequent adjustments are recorded to earnings.\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nprogram, payment, suppliers, obligations, confirmed, assets, value, supplier, financial, outstanding\n\nTITLE: Goodwill\nTEXT: Goodwill represents the excess of purchase price over the fair value of net assets acquired. We do not amortize goodwill, but assess the recoverability of goodwill in the third quarter of each fiscal year, or more often if indicators warrant, by determining whether the fair value of each reporting unit supports its carrying value. Each fiscal year, we may assess qualitative factors to determine whether it is more likely than not that the fair value of each reporting unit is less than its carrying amount as a basis for determining whether it is necessary to complete quantitative impairment assessments, with a quantitative assessment completed periodically or as facts and circumstances warrant. Additional information regarding our goodwill is included in Note 4.\nTITLE: Intangible Assets, net\nTEXT: We amortize the cost of definite-lived intangible assets on a straight-line basis over their estimated useful lives, which range up to approximately 20 years, as this approximates the pattern of expected economic benefit. We evaluate our definite-lived intangible assets for impairment when evidence exists that certain triggering events or changes in circumstances indicate that the carrying amount of these assets may not be recoverable. Intangible assets with indefinite lives are tested in the third quarter of each fiscal year for impairment, or more often if indicators warrant. Additional information regarding our intangible assets is included in Note 4.\nTITLE: Supplier Finance Program\nTEXT: We have a supplier finance program whereby we have entered into payment processing agreements with select financial institutions. Under these agreements, the financial institutions act as our paying agents with respect to accounts payable due to certain suppliers. Participating suppliers may, at their sole discretion, elect to receive payment for one or more of our payment obligations, prior to their scheduled due dates, at a discounted price from participating financial institutions. We are not a party to the agreements between the participating financial institutions and the suppliers in connection with the program, and our rights and obligations to our suppliers are not impacted. We do not reimburse suppliers for any costs they incur for participation in the program, and we have not pledged any assets as security or provided any guarantees as part of the program. We have no economic interest in our suppliers’ decisions to participate in the program. Our responsibility is limited to making payment to the respective financial institution according to the terms originally negotiated with the supplier, regardless of whether the supplier elects to receive early payment from the financial institution.\nTEXT: The payment terms we negotiate with our suppliers are consistent, irrespective of whether a supplier participates in the program. Our current payment terms with a majority of our participating suppliers generally range from 30 to 60 days, which we deem to be commercially reasonable. Our outstanding payment obligations under our supplier finance program are recorded within accounts payable on the consolidated balance sheets. The associated payments are included in operating activities within the consolidated statements of cash flows.\nTEXT: The following table presents the changes in our outstanding obligations under our supplier finance program:\nTEXT: Fiscalin millions2024Confirmed obligations outstanding at the beginning of the year$514 Invoices confirmed during the year5,140 Confirmed invoices paid during the year(5,056)Confirmed obligations outstanding at the end of the year$598\nTABLE: TABLE: in millions 2024; Confirmed obligations outstanding at the beginning of the year $ 514; Invoices confirmed during the year 5,140; Confirmed invoices paid during the year (5,056); Confirmed obligations outstanding at the end of the year $ 598.\nTITLE: Fiscal\nTITLE: in millions2024\nTITLE: in millions\nTITLE: 2024\nTEXT: Confirmed obligations outstanding at the beginning of the year\nTEXT: Invoices confirmed during the year\nTEXT: Confirmed invoices paid during the year\nTEXT: Confirmed obligations outstanding at the end of the year\nTITLE: Debt\nTEXT: We record any premiums or discounts associated with an issuance of long-term debt as a direct addition or deduction to the carrying value of the related senior notes. We also record debt issuance costs associated with an issuance of long-term debt as a direct deduction to the carrying value of the related senior notes. Premium, discount, and debt issuance costs are amortized over the term of the respective notes using the effective interest rate method.\n"
    },
    {
      "cluster": 9,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nderivative, instruments, fair, cost, item, recognized, balance, cash, hedged, liability\n\nTITLE: Derivative Instruments and Hedging Activities\nTEXT: We use derivative instruments in the management of our interest rate exposure on long-term debt and our exposure to foreign currency fluctuations. We enter into derivative instruments for risk management purposes only; we do not enter into derivative instruments for trading or speculative purposes. All derivative instruments are recognized at their fair values in either assets or liabilities at the balance sheet date and are classified as either current or non-current based on each contract’s respective maturity. While we enter into master netting arrangements, our policy is to present the fair value of derivative instruments on a gross basis in our consolidated balance sheets.\nTEXT: Changes in the fair values for derivative instruments designated as cash flow or net investment hedges are recognized in accumulated other comprehensive income (loss) until the hedged item is recognized in earnings, which for net investment hedges is upon sale or substantial liquidation of the underlying net investment. Changes in fair value of outstanding fair value hedges and the offsetting changes in fair values of the hedged item are recognized in earnings. We record realized gains and losses from derivative instruments in the same financial statement line item as the hedged item.\nTEXT: Cash flows from the settlement of derivative instruments appear in the consolidated statements of cash flows in the same categories as the cash flows of the hedged item.\nTITLE: Self-Insurance Reserves\nTEXT: We are self-insured for certain losses related to general liability (including product liability), workers’ compensation, employee group medical, and automobile claims. We recognize the expected ultimate cost for claims incurred (undiscounted) at the balance sheet date as a liability. The expected ultimate cost for claims incurred is estimated based upon analysis of historical data and actuarial estimates. We also maintain cybersecurity and privacy liability insurance coverage to help limit our exposure to losses such as those that may be caused by a significant compromise or breach of our data security, as well as property loss coverage. Our self-insurance liabilities, which are included in accrued salaries and related expenses, other accrued expenses, and other long-term liabilities in the consolidated balance sheets, were $1.5 billion at February 2, 2025, and $1.4 billion at January 28, 2024.\nTITLE: Treasury Stock\nTEXT: Treasury stock is reflected as a reduction of stockholders’ equity at cost. We use the weighted average purchase cost to determine the cost of treasury stock that is reissued, if any. Excise taxes incurred on share repurchases represent direct costs of the repurchase and are recorded as a part of the cost basis of the shares within treasury stock.\n"
    },
    {
      "cluster": 10,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nrevenue, sales, service, cost, services, certain, costs, allowances, advertising, customer\n\nTITLE: Revenue Recognition\nTEXT: We recognize revenue, net of expected returns and sales tax, at the time the customer takes possession of merchandise or when a service is performed. Our liability for sales returns is estimated based on historical return levels and our expectation of future returns. We also recognize a return asset, and corresponding adjustment to cost of sales, for our right to recover the goods returned by the customer, measured at the former carrying amount of the goods, less any expected recovery cost. At each financial reporting date, we assess our estimates of expected returns, refund liabilities, and return assets.\nTEXT: Services revenue is generated through a variety of installation, home maintenance, and professional service programs. In these programs, the customer selects and purchases material for a project, and we provide or arrange for professional installation. These programs are offered through our stores, online, and in-home sales programs. Under certain programs, when we provide or arrange for the installation of a project and the subcontractor provides material as part of the installation, both the material and labor are included in services revenue. We recognize services revenue when the service for the customer is complete, which is not materially different from recognizing the revenue over the service period as the substantial majority of our services are completed within one week.\nTEXT: For products and services sold in stores or online, payment is typically due at the point of sale. When we receive payment before the customer has taken possession of the merchandise or the service has been performed, the amount received is recorded as deferred revenue until the sale or service is complete. Such performance obligations are part of contracts with expected original durations of typically three months or less. As of February 2, 2025 and January 28, 2024, deferred revenue for products and services was $1.5 billion and $1.7 billion, respectively.\nTEXT: We further record deferred revenue for the sale of gift cards and recognize the associated revenue upon the redemption of those gift cards, which generally occurs within six months of gift card issuance. As of both February 2, 2025 and January 28, 2024, our performance obligations for unredeemed gift cards were $1.1 billion. Gift card breakage income, which is our estimate of the portion of our outstanding gift card balance not expected to be redeemed, is recognized in net sales and was immaterial in fiscal 2024, fiscal 2023, and fiscal 2022.\nTEXT: Certain customers are provided with the ability to purchase products on credit with pre-approved limits where payment is due after delivery to the customer. We also have agreements with third-party service providers who directly extend credit to customers, manage our PLCC program, and own the related receivables. We have evaluated the third-party entities holding the receivables under the program and concluded that they should not be consolidated. The agreement with the primary third-party service provider for our PLCC program expires in 2028, with us having the option, but no obligation, to purchase the existing receivables at the end of the agreement. Deferred interest charges incurred for our deferred financing programs offered to these customers, interchange fees charged to us for their use of the cards, and any profit sharing with the third-party service providers are included in net sales.\nTITLE: Cost of Sales\nTEXT: Cost of sales includes the actual cost of merchandise sold and services performed; the cost of transportation of merchandise from vendors to our distribution network, stores, or customers; shipping and handling costs from our stores or distribution network to customers; and the operating cost and depreciation of our sourcing and distribution network. Vendor allowances that are not reimbursements of specific, incremental, and identifiable costs are also included within cost of sales.\nTITLE: Vendor Allowances\nTEXT: Vendor allowances primarily consist of volume rebates that are earned as a result of attaining certain purchase levels and co-op advertising allowances for the promotion of vendors’ products that are typically based on guaranteed minimum amounts with additional amounts being earned for attaining certain purchase levels. These vendor allowances are accrued as earned, with those allowances received as a result of attaining certain purchase levels accrued over the incentive period, which generally concludes at the end of the calendar year, based on estimates of purchases. Volume rebates and certain co-op advertising allowances reduce the carrying cost of inventory and are recognized in cost of sales when the related inventory is sold.\nTITLE: Selling, General and Administrative\nTEXT: Selling, general and administrative expenses include compensation and benefits for retail and store support center associates, occupancy and operating costs of retail locations and store support centers, insurance-related expenses, advertising costs, credit and debit card processing fees, and other administrative costs.\nTITLE: Advertising Expense\nTEXT: Advertising costs, including digital, television, radio and print, are expensed when the advertisement first appears. Certain co-op advertising allowances that are reimbursements of specific, incremental, and identifiable costs incurred to promote vendors’ products are recorded as an offset against advertising expense. Net advertising expense included in SG&A was $1.2 billion, $1.1 billion, and $1.1 billion for fiscal 2024, 2023, and 2022, respectively.\n"
    },
    {
      "cluster": 11,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, stock, recognized, earnings, deferred, based, period, other, certain, expense\n\nTITLE: Stock-Based Compensation\nTEXT: We are currently authorized to issue incentive and nonqualified stock options, restricted stock, restricted stock units, performance shares, performance units, stock appreciation rights, and deferred shares to certain of our associates and non-employee directors under certain stock incentive plans. We measure and recognize compensation expense for all stock-based payment awards made to associates and non-employee directors based on estimated fair values. The value of the portion of the award that is ultimately expected to vest is recognized as stock-based compensation expense, on a straight-line basis, over the requisite service period or as restrictions lapse. We include estimated forfeitures expected to occur when calculating stock-based compensation expense. Additional information on our stock-based payment awards is included in Note 9.\nTITLE: Income Taxes\nTEXT: Income taxes are accounted for under the asset and liability method. We provide for federal, state, and foreign income taxes currently payable, as well as for those deferred due to timing differences between reporting income and expenses for financial statement purposes versus tax purposes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted income tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect of a change in income tax rates is recognized as income or expense in the period that includes the enactment date. We routinely evaluate the likelihood of realizing the benefit of our deferred tax assets and may record a valuation allowance if, based on all available evidence, we determine that it is more likely than not that some portion of the tax benefit will not be realized.\nTEXT: We recognize the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs.\nTEXT: We recognize interest and penalties related to income tax matters in interest expense and SG&A, respectively, on our consolidated statements of earnings. Accrued interest and penalties related to income tax matters are recognized in other accrued expenses and other long-term liabilities on our consolidated balance sheets.\nTEXT: We file a consolidated U.S. federal income tax return which includes certain eligible subsidiaries. Non-U.S. subsidiaries and certain U.S. subsidiaries, which are consolidated for financial reporting purposes, are not eligible to be included in our consolidated U.S. federal income tax return. Separate provisions for income taxes have been determined for these entities. For unremitted earnings of our non-U.S. subsidiaries, we are required to make an assertion regarding reinvestment or repatriation for tax purposes. For any earnings that we do not make a permanent reinvestment assertion, we recognize a provision for deferred income taxes. For earnings where we have made a permanent reinvestment assertion, no provision is recognized. See Note 6 for further discussion.\nTEXT: We are subject to global intangible low-taxed income tax, an incremental tax on foreign income. We have made an accounting election to record this tax in the period the tax arises.\nTITLE: Comprehensive Income\nTEXT: Comprehensive income includes net earnings adjusted for certain gains and losses that are excluded from net earnings and recognized within accumulated other comprehensive loss as a component of equity, which consists primarily of foreign currency translation adjustments. Accumulated other comprehensive loss also includes net losses on cash flow hedges that were immaterial as of February 2, 2025 and January 28, 2024. Reclassifications from accumulated other comprehensive loss into earnings were immaterial in fiscal 2024, fiscal 2023, and fiscal 2022.\nTITLE: Foreign Currency Translation\nTEXT: Assets and liabilities denominated in a foreign currency are translated into U.S. dollars at the current rate of exchange on the last day of the reporting period. Revenues and expenses are translated using average exchange rates for the period, and equity transactions are translated using the actual rate on the day of the transaction. Cumulative foreign currency translation adjustments recorded in accumulated other comprehensive loss as of February 2, 2025 and January 28, 2024 were losses of $970 million and $365 million, respectively.\n"
    },
    {
      "cluster": 12,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndisclosures, fiscal, december, beginning, after, adoption, financial, income, which, effective\n\nTITLE: Recently Adopted Accounting Pronouncements\nTEXT: ASU No. 2023-07. In November 2023, the FASB issued ASU No. 2023-07, “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures,” which is intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. The disclosure requirements included in ASU No. 2023-07 are required for all public entities, including entities with a single reportable segment. ASU No. 2023-07 is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, and early adoption is permitted. The guidance is required to be applied on a retrospective basis. We adopted ASU No. 2023-07 in the fourth quarter of fiscal 2024. The adoption of this guidance resulted in additional financial statement disclosures and had no impact to our consolidated financial condition, results of operations, or cash flows. See Note 2 which includes the disclosures resulting from our adoption of this guidance.\nTEXT: ASU No. 2022-04. In September 2022, the FASB issued ASU No. 2022-04, “Liabilities—Supplier Finance Programs (Topic 405-50): Disclosure of Supplier Finance Program Obligations,” to enhance the transparency of supplier finance programs used by an entity in connection with the purchase of goods and services. The standard requires entities that use supplier finance programs to disclose the key terms of such programs, along with an annual rollforward of the related obligations, including the amount of obligations confirmed and the amounts paid during the period. ASU No. 2022-04 was effective for fiscal years beginning after December 15, 2022, except for the required rollforward information, which was effective for fiscal years beginning after December 15, 2023. We adopted ASU No. 2022-04 in the first quarter of fiscal 2023, with the exception of the annual rollforward requirement, which was adopted on a prospective basis in the fourth quarter of fiscal 2024. The adoption of this guidance did not have an impact on our consolidated financial condition, results of operations, or cash flows.\nTITLE: Accounting Pronouncements Not Yet Adopted\nTEXT: ASU No. 2023-09. In December 2023, the FASB issued ASU No. 2023-09, “Income Taxes (Topic 740): Improvements to Income Tax Disclosures,” which requires disclosure of disaggregated information about a reporting entity’s effective tax rate reconciliation as well as disclosures on income taxes paid by jurisdiction. ASU No. 2023-09 is effective for annual periods beginning after December 15, 2024. The guidance is required to be applied on a prospective basis, with the option to apply the standard retrospectively. Early adoption is permitted. We are currently evaluating the impact of the standard on our consolidated financial statement disclosures.\nTEXT: ASU No. 2024-03. In November 2024, the FASB issued ASU No. 2024-03, “Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses,” which is intended to improve disclosures about a public business entity’s expenses by requiring disaggregated disclosure, in the notes to the financial statements, of prescribed categories of expenses within relevant income statement captions. ASU No. 2024-03 is effective for fiscal years beginning after December 15, 2026 and interim periods within fiscal years beginning after December 15, 2027. Early adoption is permitted. The new standard may be applied either on a prospective or retrospective basis. We are currently evaluating the impact of the standard on our consolidated financial statement disclosures.\nTEXT: Recent accounting pronouncements adopted or pending adoption not discussed above are either not applicable or are not expected to have a material impact on our consolidated financial condition, results of operations, or cash flows.\nTITLE: 2.SEGMENT REPORTING AND NET SALES\nTITLE: SEGMENT REPORTING AND NET SALES\n"
    },
    {
      "cluster": 13,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsegment, operating, primary, income, products, sales, other, fiscal, equipment, amortization\n\nTITLE: Segment Reporting\nTEXT: The Company defines its segments based on how internally reported financial information is regularly reviewed by the chief operating decision maker (“CODM”), our President and Chief Executive Officer, to analyze financial performance, make decisions, and allocate resources.\nTEXT: Primary Segment. We are engaged in the operation of retail stores and sell a wide assortment of building materials, home improvement products, lawn and garden products, décor products, and facilities MRO products both in stores and online. We also provide a number of services, including home improvement installation services, and tool and equipment rental. We currently conduct these operations in the U.S. (including the Commonwealth of Puerto Rico and the territories of the U.S. Virgin Islands and Guam), Canada, and Mexico, each of which represents an operating segment. For disclosure purposes, we aggregate these three geographic operating segments into one reportable segment (the “Primary segment”) due to the similar nature of their operations and economic characteristics.\nTEXT: Other. As discussed in Note 13, in June 2024, we acquired SRS, a leading residential specialty trade distribution company across several verticals serving the professional roofer, landscaper and pool contractor through its branches located throughout the U.S. SRS is organized as three different lines of business: roofing and complementary building products, landscape, and pool. We have determined that each of these three lines of business represents an operating segment, none of which meets the thresholds prescribed under Topic 280 to be deemed a reportable segment. Therefore, results from our SRS operating segments are presented in “Other” beginning from the acquisition date of June 18, 2024.\nTEXT: Segment Information. For our Primary segment, our CODM uses operating income to allocate resources in the planning and forecasting process and to assess segment performance by monitoring actual results versus prior-period, forecasted results, and the annual plan. Assets are reviewed by our CODM on a total company consolidated basis and not by segment. The accounting policies of our Primary segment are the same as those described in our summary of significant accounting policies.\nTEXT: The following table presents net sales, significant expenses, and operating income for our Primary segment:\nTEXT: in millionsFiscal2024Fiscal2023Fiscal2022Net sales$153,108 $152,669 $157,403 Cost of sales101,194 101,709 104,625 Gross profit51,914 50,960 52,778 Operating expenses:Selling, general and administrative27,822 26,598 26,284 Depreciation and amortization2,779 2,673 2,455 Total operating expenses30,601 29,271 28,739 Primary segment operating income$21,313 $21,689 $24,039\nTABLE: TABLE: in millions Fiscal2024 Fiscal2023 Fiscal2022; Net sales $ 153,108 $ 152,669 $ 157,403; Cost of sales 101,194 101,709 104,625; Gross profit 51,914 50,960 52,778; Selling, general and administrative 27,822 26,598 26,284; Depreciation and amortization 2,779 2,673 2,455; Total operating expenses 30,601 29,271 28,739; Primary segment operating income $ 21,313 $ 21,689 $ 24,039.\nTITLE: in millionsFiscal2024Fiscal2023Fiscal2022\nTITLE: in millions\nTITLE: Fiscal2024\nTITLE: Fiscal\nTITLE: 2024\nTITLE: Fiscal2023\nTITLE: Fiscal\nTITLE: 2023\nTITLE: Fiscal2022\nTITLE: Fiscal\nTITLE: 2022\nTEXT: Selling, general and administrative\nTEXT: Primary segment operating income\nTEXT: The following table presents a reconciliation of certain Primary segment information to our consolidated totals:\nTEXT: Fiscal 2024in millionsPrimary SegmentOtherConsolidatedNet sales$153,108 $6,406 $159,514 Operating income21,313 213 21,526 Interest income and other, net(201)Interest expense2,321 Earnings before provision for income taxes$19,406 Depreciation and amortization (1)$3,350 $358 $3,708\nTABLE: TABLE: in millions Primary Segment Other Consolidated; Net sales $ 153,108 $ 6,406 $ 159,514; Operating income 21,313 213 21,526; Interest income and other, net (201); Interest expense 2,321; Earnings before provision for income taxes $ 19,406; Depreciation and amortization (1) $ 3,350 $ 358 $ 3,708.\nTITLE: Fiscal 2024\nTITLE: in millionsPrimary SegmentOtherConsolidated\nTITLE: in millions\nTITLE: Primary Segment\nTITLE: Other\nTITLE: Consolidated\nTEXT: Earnings before provision for income taxes\nTEXT: Depreciation and amortization (1)\nTEXT: (1)Includes depreciation and finance lease amortization in cost of sales. Also includes intangible asset amortization expense of $207 million in our Primary segment and $218 million in Other.\nTEXT: Net sales presented in Other relate to the sale of products by SRS, with roofing and related products accounting for approximately 68% of sales in Other during fiscal 2024.\nTEXT: Prior to the SRS acquisition, our total Company consolidated results represented our Primary segment. Therefore, a reconciliation to our consolidated totals is not applicable for fiscal 2023 or fiscal 2022.\nTEXT: The following table presents net property and equipment, classified by geography:\nTEXT: in millionsFebruary 2,2025January 28,2024January 29,2023Net property and equipment – in the U.S.$24,193 $23,347 $23,057 Net property and equipment – outside the U.S.2,509 2,807 2,574 Net property and equipment$26,702 $26,154 $25,631\nTABLE: TABLE: in millions February 2,2025 January 28,2024 January 29,2023; Net property and equipment – in the U.S. $ 24,193 $ 23,347 $ 23,057; Net property and equipment – outside the U.S. 2,509 2,807 2,574; Net property and equipment $ 26,702 $ 26,154 $ 25,631.\nTITLE: in millionsFebruary 2,2025January 28,2024January 29,2023\nTITLE: in millions\nTITLE: February 2,2025\nTITLE: January 28,2024\nTITLE: January 29,2023\n"
    },
    {
      "cluster": 14,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsales, primary, segment, garden, following, table, presents, services, other, major\n\nTITLE: Net Sales\nTEXT: The following table presents our Primary segment major product lines and the related merchandising departments (and related services):\nTEXT: Major Product LineMerchandising DepartmentsBuilding MaterialsBuilding Materials, Electrical, Lumber, Millwork, and PlumbingDécorAppliances, Bath, Flooring, Kitchen & Blinds, Lighting, and PaintHardlinesHardware, Indoor Garden, Outdoor Garden, Power, and Storage & Organization\nTABLE: TABLE: Major Product Line Merchandising Departments; Building Materials Building Materials, Electrical, Lumber, Millwork, and Plumbing; Décor Appliances, Bath, Flooring, Kitchen & Blinds, Lighting, and Paint; Hardlines Hardware, Indoor Garden, Outdoor Garden, Power, and Storage & Organization.\nTITLE: Major Product LineMerchandising Departments\nTITLE: Major Product Line\nTITLE: Merchandising Departments\nTEXT: Building Materials, Electrical, Lumber, Millwork, and Plumbing\nTEXT: Appliances, Bath, Flooring, Kitchen & Blinds, Lighting, and Paint\nTEXT: Hardware, Indoor Garden, Outdoor Garden, Power, and Storage & Organization\nTEXT: During the first quarter of fiscal 2024, we made certain changes to our merchandising department structure that realigned certain merchandising departments across our three major product lines within our Primary segment. As a result, prior-year amounts in each of the tables below have been reclassified to conform with the current-year presentation. These changes had no impact on consolidated net sales.\nTEXT: The following table presents net sales by major product line (and related services) within our Primary segment, as well as Other net sales:\nTEXT: FiscalFiscalFiscalin millions202420232022Building Materials$52,756 $52,661 $54,572 Décor51,790 51,945 54,442 Hardlines48,562 48,063 48,389 Primary segment net sales153,108 152,669 157,403 Other net sales6,406 — — Net sales$159,514 $152,669 $157,403\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2024 2023 2022; Building Materials $ 52,756 $ 52,661 $ 54,572; Décor 51,790 51,945 54,442; Hardlines 48,562 48,063 48,389; Primary segment net sales 153,108 152,669 157,403; Other net sales 6,406 — —; Net sales $ 159,514 $ 152,669 $ 157,403.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202420232022\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: The following table presents net sales by merchandising department (and related services) within our Primary segment, as well as Other net sales:\nTEXT: FiscalFiscalFiscal202420232022dollars in millionsNetSales% of Net SalesNetSales% of Net SalesNetSales% of Net SalesAppliances$14,046 8.8 %$13,917 9.1 %$14,521 9.2 %Bath6,485 4.1 6,630 4.3 6,855 4.4 Building Materials12,423 7.8 12,118 7.9 11,410 7.2 Electrical7,877 4.9 8,038 5.3 8,824 5.6 Flooring8,596 5.4 8,762 5.7 9,198 5.8 Hardware8,999 5.6 9,010 5.9 8,953 5.7 Indoor Garden10,519 6.6 10,283 6.7 10,105 6.4 Kitchen & Blinds7,238 4.5 7,154 4.7 7,751 4.9 Lighting4,222 2.6 4,531 3.0 5,036 3.2 Lumber11,762 7.4 11,721 7.7 13,436 8.5 Millwork8,337 5.2 8,301 5.4 8,428 5.4 Outdoor Garden10,308 6.5 10,278 6.7 10,039 6.4 Paint11,203 7.0 10,951 7.2 11,081 7.0 Plumbing12,357 7.7 12,483 8.2 12,474 7.9 Power13,100 8.2 12,864 8.4 13,271 8.4 Storage & Organization5,636 3.5 5,628 3.7 6,021 3.8 Primary segment net sales153,108 96.0 152,669 100.0 157,403 100.0 Other net sales6,406 4.0 — — — — Net sales$159,514 100.0 %$152,669 100.0 %$157,403 100.0 %\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2024 2023 2022; dollars in millions NetSales % of Net Sales NetSales % of Net Sales NetSales % of Net Sales; Appliances $ 14,046 8.8 % $ 13,917 9.1 % $ 14,521 9.2 %; Bath 6,485 4.1 6,630 4.3 6,855 4.4; Building Materials 12,423 7.8 12,118 7.9 11,410 7.2; Electrical 7,877 4.9 8,038 5.3 8,824 5.6; Flooring 8,596 5.4 8,762 5.7 9,198 5.8; Hardware 8,999 5.6 9,010 5.9 8,953 5.7; Indoor Garden 10,519 6.6 10,283 6.7 10,105 6.4; Kitchen & Blinds 7,238 4.5 7,154 4.7 7,751 4.9; Lighting 4,222 2.6 4,531 3.0 5,036 3.2; Lumber 11,762 7.4 11,721 7.7 13,436 8.5; Millwork 8,337 5.2 8,301 5.4 8,428 5.4; Outdoor Garden 10,308 6.5 10,278 6.7 10,039 6.4; Paint 11,203 7.0 10,951 7.2 11,081 7.0; Plumbing 12,357 7.7 12,483 8.2 12,474 7.9; Power 13,100 8.2 12,864 8.4 13,271 8.4; Storage & Organization 5,636 3.5 5,628 3.7 6,021 3.8; Primary segment net sales 153,108 96.0 152,669 100.0 157,403 100.0; Other net sales 6,406 4.0 — — — —; Net sales $ 159,514 100.0 % $ 152,669 100.0 % $ 157,403 100.0 %.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: dollars in millionsNetSales% of Net SalesNetSales% of Net SalesNetSales% of Net Sales\nTITLE: dollars in millions\nTITLE: NetSales\nTITLE: % of Net Sales\nTITLE: NetSales\nTITLE: % of Net Sales\nTITLE: NetSales\nTITLE: % of Net Sales\nTEXT: Note: Certain percentages may not sum to totals due to rounding.\nTEXT: See additional discussion above for information on the components of Other net sales.\nTEXT: The following table presents net sales, classified by geography:\nTEXT: FiscalFiscalFiscalin millions202420232022Net sales – in the U.S.$147,007 $140,083 $144,840 Net sales – outside the U.S.12,507 12,586 12,563 Net sales$159,514 $152,669 $157,403\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2024 2023 2022; Net sales – in the U.S. $ 147,007 $ 140,083 $ 144,840; Net sales – outside the U.S. 12,507 12,586 12,563; Net sales $ 159,514 $ 152,669 $ 157,403.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202420232022\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: The following table presents net sales by products and services:\nTEXT: FiscalFiscalFiscalin millions202420232022Net sales – products $153,674 $146,835 $151,804 Net sales – services 5,840 5,834 5,599 Net sales$159,514 $152,669 $157,403\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2024 2023 2022; Net sales – products $ 153,674 $ 146,835 $ 151,804; Net sales – services 5,840 5,834 5,599; Net sales $ 159,514 $ 152,669 $ 157,403.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\n"
    },
    {
      "cluster": 15,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nlease, finance, operating, amortization, leases, cost, term, following, table, presents\n\nTITLE: in millions202420232022\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: No sales to an individual customer accounted for more than 10% of revenue during any of the last three fiscal years.\nTITLE: 3.PROPERTY AND LEASES\nTITLE: PROPERTY AND LEASES\nTITLE: Net Property and Equipment\nTEXT: The following table presents components of net property and equipment:\nTEXT: in millionsFebruary 2,2025January 28,2024Land$9,060 $9,027 Buildings and improvements20,260 20,030 Furniture, fixtures, and equipment18,474 16,667 Leasehold improvements2,423 2,254 Construction in progress1,521 1,192 Finance leases4,045 4,087 Property and equipment, at cost55,783 53,257 Less: accumulated depreciation and finance lease amortization29,081 27,103 Net property and equipment$26,702 $26,154\nTABLE: TABLE: in millions February 2,2025 January 28,2024; Land $ 9,060 $ 9,027; Buildings and improvements 20,260 20,030; Furniture, fixtures, and equipment 18,474 16,667; Leasehold improvements 2,423 2,254; Construction in progress 1,521 1,192; Finance leases 4,045 4,087; Property and equipment, at cost 55,783 53,257; Less: accumulated depreciation and finance lease amortization 29,081 27,103; Net property and equipment $ 26,702 $ 26,154.\nTITLE: in millionsFebruary 2,2025January 28,2024\nTITLE: in millions\nTITLE: February 2,2025\nTITLE: January 28,2024\nTEXT: Less: accumulated depreciation and finance lease amortization\nTEXT: The following table presents depreciation and finance lease amortization expense, including depreciation and finance lease amortization expense included in cost of sales:\nTITLE: in millionsFiscalFiscalFiscal202420232022Depreciation and finance lease amortization expense$3,283 $3,020 $2,756\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Depreciation and finance lease amortization expense $ 3,283 $ 3,020 $ 2,756.\nTITLE: in millionsFiscalFiscalFiscal202420232022Depreciation and finance lease amortization expense$3,283 $3,020 $2,756\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Leases\nTEXT: The following table presents the consolidated balance sheet classification related to operating and finance leases:\nTEXT: in millionsConsolidated Balance Sheet ClassificationFebruary 2,2025January 28,2024Assets:Operating lease assetsOperating lease right-of-use assets$8,592 $7,884 Finance lease assets (1)Net property and equipment2,638 2,840 Total lease assets$11,230 $10,724 Liabilities:Current: Operating lease liabilitiesCurrent operating lease liabilities$1,274 $1,050 Finance lease liabilitiesCurrent installments of long-term debt272 268 Long-term: Operating lease liabilitiesLong-term operating lease liabilities7,633 7,082 Finance lease liabilitiesLong-term debt, excluding current installments2,749 3,000 Total lease liabilities$11,928 $11,400\nTABLE: TABLE: in millions Consolidated Balance Sheet Classification February 2,2025 January 28,2024; Operating lease assets Operating lease right-of-use assets $ 8,592 $ 7,884; Finance lease assets (1) Net property and equipment 2,638 2,840; Total lease assets $ 11,230 $ 10,724; Operating lease liabilities Current operating lease liabilities $ 1,274 $ 1,050; Finance lease liabilities Current installments of long-term debt 272 268; Operating lease liabilities Long-term operating lease liabilities 7,633 7,082; Finance lease liabilities Long-term debt, excluding current installments 2,749 3,000; Total lease liabilities $ 11,928 $ 11,400.\nTITLE: in millionsConsolidated Balance Sheet ClassificationFebruary 2,2025January 28,2024\nTITLE: in millions\nTITLE: Consolidated Balance Sheet Classification\nTITLE: February 2,2025\nTITLE: January 28,2024\nTITLE: Assets:\nTITLE: Liabilities:\nTEXT: (1) Finance lease assets are recorded net of accumulated amortization of $1.4 billion as of February 2, 2025 and $1.2 billion as of January 28, 2024.\nTEXT: The following table presents components of lease cost, excluding short-term lease cost and sublease income which are immaterial:\nTEXT: Consolidated Statement of Earnings Classification (1)FiscalFiscalFiscalin millions202420232022Operating lease costSelling, general and administrative$1,661 $1,359 $1,169 Finance lease cost:Amortization of leased assetsDepreciation and amortization328 304 282 Interest on lease liabilitiesInterest expense118 126 125 Variable lease costSelling, general and administrative566 486 470\nTABLE: TABLE: Consolidated Statement of Earnings Classification (1) Fiscal Fiscal Fiscal; in millions 2024 2023 2022; Operating lease cost Selling, general and administrative $ 1,661 $ 1,359 $ 1,169; Amortization of leased assets Depreciation and amortization 328 304 282; Interest on lease liabilities Interest expense 118 126 125; Variable lease cost Selling, general and administrative 566 486 470.\nTITLE: Consolidated Statement of Earnings Classification (1)FiscalFiscalFiscal\nTITLE: Consolidated Statement of Earnings Classification (1)\nTITLE: Fiscal\nTITLE: in millions202420232022\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: (1)Costs associated with our sourcing and distribution network are recorded in cost of sales, with the exception of interest on finance lease liabilities.\nTEXT: The following table presents weighted average remaining lease terms and discount rates:\nTEXT: February 2,2025January 28,2024Weighted Average Remaining Lease Term (Years):Operating leases910Finance leases1213Weighted Average Discount Rate:Operating leases4.0 %3.7 %Finance leases3.7 %3.7 %\nTABLE: TABLE: February 2,2025 January 28,2024; Operating leases 9 10; Finance leases 12 13; Operating leases 4.0 % 3.7 %; Finance leases 3.7 % 3.7 %.\nTITLE: February 2,2025January 28,2024\nTITLE: February 2,2025\nTITLE: January 28,2024\nTITLE: Weighted Average Remaining Lease Term (Years):\n"
    },
    {
      "cluster": 16,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, goodwill, lease, reporting, operating, leases, cash, units, value, related\n\nTITLE: Weighted Average Discount Rate:\nTEXT: The following table presents approximate future minimum payments under operating and finance leases at February 2, 2025:\nTEXT: in millionsOperatingLeasesFinanceLeasesFiscal 2025$1,612 $378 Fiscal 20261,583 374 Fiscal 20271,418 347 Fiscal 20281,229 310 Fiscal 20291,022 284 Thereafter4,065 2,009 Total lease payments10,929 3,702 Less: imputed interest2,022 681 Present value of lease liabilities$8,907 $3,021\nTABLE: TABLE: in millions OperatingLeases FinanceLeases; Fiscal 2025 $ 1,612 $ 378; Fiscal 2026 1,583 374; Fiscal 2027 1,418 347; Fiscal 2028 1,229 310; Fiscal 2029 1,022 284; Thereafter 4,065 2,009; Total lease payments 10,929 3,702; Less: imputed interest 2,022 681; Present value of lease liabilities $ 8,907 $ 3,021.\nTITLE: in millionsOperatingLeasesFinanceLeases\nTITLE: in millions\nTITLE: OperatingLeases\nTITLE: FinanceLeases\nTEXT: Note: We have excluded approximately $560 million of lease payments (undiscounted basis) for leases that have been signed but have not yet commenced.\nTEXT: The following table presents supplemental cash flow information related to leases:\nTEXT: FiscalFiscalFiscalin millions202420232022Cash paid for amounts included in the measurement of lease liabilities:Operating cash flows – operating leases$1,601 $1,328 $1,157 Operating cash flows – finance leases118 126 125 Financing cash flows – finance leases380 271 241 Supplemental non-cash information: Lease assets obtained in exchange for new operating lease liabilities1,384 1,827 1,991 Lease assets obtained in exchange for new finance lease liabilities153 336 322\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2024 2023 2022; Operating cash flows – operating leases $ 1,601 $ 1,328 $ 1,157; Operating cash flows – finance leases 118 126 125; Financing cash flows – finance leases 380 271 241; Lease assets obtained in exchange for new operating lease liabilities 1,384 1,827 1,991; Lease assets obtained in exchange for new finance lease liabilities 153 336 322.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202420232022\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: 4.GOODWILL AND INTANGIBLE ASSETS\nTITLE: GOODWILL AND INTANGIBLE ASSETS\nTITLE: Goodwill\nTEXT: The following table presents the changes in the carrying amount of our goodwill:\nTEXT: in millionsPrimary SegmentOtherConsolidatedGoodwill, balance at January 29, 2023$7,444 $— $7,444 Acquisitions (1)998 — 998 Other (2)13 — 13 Goodwill, balance at January 28, 20248,455 — 8,455 Acquisitions (1)23 11,025 11,048 Other (2)(28)— (28)Goodwill, balance at February 2, 2025$8,450 $11,025 $19,475\nTABLE: TABLE: in millions Primary Segment Other Consolidated; Goodwill, balance at January 29, 2023 $ 7,444 $ — $ 7,444; Acquisitions (1) 998 — 998; Other (2) 13 — 13; Goodwill, balance at January 28, 2024 8,455 — 8,455; Acquisitions (1) 23 11,025 11,048; Other (2) (28) — (28); Goodwill, balance at February 2, 2025 $ 8,450 $ 11,025 $ 19,475.\nTITLE: in millionsPrimary SegmentOtherConsolidated\nTITLE: in millions\nTITLE: Primary Segment\nTITLE: Other\nTITLE: Consolidated\nTEXT: Goodwill, balance at January 29, 2023\nTEXT: Goodwill, balance at January 28, 2024\nTEXT: (1) Activity includes the preliminary determination of goodwill related to acquisitions completed during the fiscal year. Amounts presented in the Other column represent goodwill related to the SRS acquisition completed in the second quarter of fiscal 2024, as well as other immaterial acquisitions completed by SRS during the second half of fiscal 2024. See Note 13 for further details.\nTEXT: (2) Primarily reflects the net impact of foreign currency translation as well as immaterial measurement period adjustments related to acquisitions completed in the prior fiscal year.\nTEXT: During the third quarter of fiscal 2024, we completed our annual assessment of the recoverability of goodwill for our U.S., Canada, and Mexico reporting units that reside within our Primary segment. As the results of our most recent quantitative analysis in fiscal 2023 indicated that the fair value of each reporting unit substantially exceeded its respective carrying value, we performed a qualitative assessment to determine if there were any indicators of impairment. Based on this assessment, we concluded that while there have been events and circumstances that have both positively and negatively impacted our reporting units, no single factor or combination of factors is an indicator that it is more likely than not that the fair value of any of these reporting units was less than its carrying amount.\nTEXT: Additionally, following the completion of the SRS acquisition, we now have three new reporting units which align with our SRS operating segments: roofing and complementary building products, landscape, and pool. As a result of the recency of the acquisition to our annual assessment date, these reporting units were also analyzed for impairment during the third quarter of fiscal 2024 using a qualitative approach. Based on this analysis, we concluded that there were no events or circumstances that would indicate that it is more likely than not that the fair value of any of these reporting units was less than its carrying amount.\nTEXT: There were also no impairment charges related to goodwill in fiscal 2023 or fiscal 2022.\n"
    },
    {
      "cluster": 17,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nintangible, assets, fiscal, lived, carrying, indefinite, related, following, table, presents\n\nTITLE: Intangible Assets\nTEXT: The following table presents information regarding our intangible assets:\nTEXT: February 2, 2025 (1)January 28, 2024in millionsGross Carrying AmountAccumulated AmortizationNet Carrying AmountGross Carrying AmountAccumulated AmortizationNet Carrying AmountDefinite-Lived Intangible Assets:Customer relationships$8,845 $(1,035)$7,810 $3,425 $(670)$2,755 Trade names610 (86)524 227 (25)202 Other11 (11)— 12 (12)— Indefinite-Lived Intangible Assets:Trade names649 649 649 649 Total Intangible Assets$10,115 $(1,132)$8,983 $4,313 $(707)$3,606\nTABLE: TABLE: February 2, 2025 (1) January 28, 2024; in millions Gross Carrying Amount Accumulated Amortization Net Carrying Amount Gross Carrying Amount Accumulated Amortization Net Carrying Amount; Customer relationships $ 8,845 $ (1,035) $ 7,810 $ 3,425 $ (670) $ 2,755; Trade names 610 (86) 524 227 (25) 202; Other 11 (11) — 12 (12) —; Trade names 649 649 649 649; Total Intangible Assets $ 10,115 $ (1,132) $ 8,983 $ 4,313 $ (707) $ 3,606.\nTITLE: February 2, 2025 (1)January 28, 2024\nTITLE: February 2, 2025 (1)\nTITLE: January 28, 2024\nTITLE: in millionsGross Carrying AmountAccumulated AmortizationNet Carrying AmountGross Carrying AmountAccumulated AmortizationNet Carrying Amount\nTITLE: in millions\nTITLE: Gross Carrying Amount\nTITLE: Accumulated Amortization\nTITLE: Net Carrying Amount\nTITLE: Gross Carrying Amount\nTITLE: Accumulated Amortization\nTITLE: Net Carrying Amount\nTEXT: (1) Includes the allocation of fair value to intangible assets related to the SRS acquisition, as well as other immaterial acquisitions completed during fiscal 2024. See Note 13 for further details.\nTEXT: Our intangible asset amortization expense was $425 million, $186 million and $179 million for fiscal 2024, fiscal 2023, and fiscal 2022, respectively.\nTEXT: The following table presents the estimated future amortization expense related to definite-lived intangible assets as of February 2, 2025:\nTITLE: in millionsAmortization ExpenseFiscal 2025$553 Fiscal 2026553 Fiscal 2027545 Fiscal 2028528 Fiscal 2029486 Thereafter5,669 Total$8,334\nTABLE: TABLE: in millions Amortization Expense; Fiscal 2025 $ 553; Fiscal 2026 553; Fiscal 2027 545; Fiscal 2028 528; Fiscal 2029 486; Thereafter 5,669; Total $ 8,334.\nTITLE: in millionsAmortization ExpenseFiscal 2025$553 Fiscal 2026553 Fiscal 2027545 Fiscal 2028528 Fiscal 2029486 Thereafter5,669 Total$8,334\nTITLE: in millionsAmortization Expense\nTITLE: in millions\nTITLE: Amortization Expense\nTEXT: During the third quarter of fiscal 2024, we completed our annual assessment of the recoverability of our indefinite-lived intangible assets using a quantitative analysis and concluded no impairment losses should be recognized.\nTEXT: There were no impairment charges related to any of our definite or indefinite-lived intangible assets in fiscal 2024, fiscal 2023, or fiscal 2022.\nTITLE: 5.DEBT AND DERIVATIVE INSTRUMENTS\nTITLE: DEBT AND DERIVATIVE INSTRUMENTS\n"
    },
    {
      "cluster": 18,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncredit, commercial, paper, program, borrowings, facility, back, scheduled, expire, facilities\n\nTITLE: Short-Term Debt\nTEXT: At the beginning of fiscal 2024, we had a commercial paper program that allowed for an aggregate of $5.0 billion in borrowings. In connection with this program, we had back-up credit facilities with a consortium of banks for an aggregate of $5.0 billion in borrowings, which consisted of a five-year $3.5 billion credit facility scheduled to expire in July 2027 and a 364-day $1.5 billion credit facility scheduled to expire in July 2024. At January 28, 2024, there were no outstanding borrowings under our commercial paper program or back-up credit facilities.\nTEXT: In May 2024, we increased our commercial paper program from $5.0 billion to $19.5 billion in connection with the anticipated financing of the acquisition of SRS (see Note 13 for details regarding the SRS acquisition). In May 2024, in connection with the increase in the commercial paper program, we entered into three additional back-up credit facilities that consisted of a 364-day $3.5 billion credit facility scheduled to expire in May 2025, a three-year $1.0 billion credit facility scheduled to expire in May 2027, and a 364-day $10.0 billion credit facility scheduled to expire in May 2025. The $10.0 billion credit facility also provided that the commitments and any borrowings under that facility would be reduced by the amount of net cash proceeds we received from any future debt issuance.\nTEXT: In June 2024, leading up to the acquisition of SRS on June 18, 2024, we raised commercial paper borrowings of over $15.0 billion to fund the transaction. On June 25, 2024, we received the proceeds from the issuance of $10.0 billion of long-term debt, as further discussed below, and immediately used the proceeds to repay approximately $10.0 billion of these commercial paper borrowings. On June 27, 2024, we terminated the $10.0 billion back-up credit facility, and subsequently reduced our commercial paper program from $19.5 billion to $9.5 billion.\nTEXT: In July 2024, we completed the renewal of our 364-day $1.5 billion credit facility, extending the maturity from July 2024 to July 2025.\nTEXT: In December 2024, we reduced our total credit facilities and concurrently reduced our commercial paper program, each by $2.5 billion. This reduction included terminating the three-year $1.0 billion back-up credit facility that was scheduled to expire in May 2027 and reducing the aggregate commitments under the 364-day back-up credit facility that is scheduled to expire in May 2025 from $3.5 billion to $2.0 billion. As of February 2, 2025, our commercial paper program allowed for an aggregate of $7.0 billion in borrowings and is supported by $7.0 billion of back-up credit facilities.\nTEXT: All of our short-term borrowings in fiscal 2024 and fiscal 2023 were under our commercial paper program. At February 2, 2025, we had $316 million of outstanding borrowings under our commercial paper program with a weighted-average interest rate of 4.4% and no outstanding borrowings under back-up credit facilities. The following table presents information on borrowings under our commercial paper program during fiscal 2024 and fiscal 2023:\nTITLE: FiscalFiscalin millions20242023Maximum amount outstanding during the period$15,317 $1,453 Average daily short-term borrowings1,343 72\nTABLE: TABLE: Fiscal Fiscal; in millions 2024 2023; Maximum amount outstanding during the period $ 15,317 $ 1,453; Average daily short-term borrowings 1,343 72.\nTITLE: FiscalFiscalin millions20242023Maximum amount outstanding during the period$15,317 $1,453 Average daily short-term borrowings1,343 72\nTITLE: FiscalFiscal\nTITLE: Fiscal\nTITLE: in millions20242023\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\n"
    },
    {
      "cluster": 19,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsenior, notes, semi, annually, april, september, june, december, long, term\n\nTITLE: Long-Term Debt\nTEXT: The following table presents details of the components of our long-term debt:\nTEXT: Carrying Amount (1)in millionsInterestPayablePrincipalAmountFebruary 2,2025January 28,20243.75% Senior notes due February 2024Semi-annually$— $— $1,100 2.70% Senior notes due April 2025Semi-annually500 500 499 5.125% Senior notes due April 2025Semi-annually500 500 498 3.35% Senior notes due September 2025Semi-annually1,000 999 999 4.00% Senior notes due September 2025Semi-annually750 749 749 Floating rate Senior notes due December 2025Quarterly600 599 — 5.10% Senior notes due December 2025Semi-annually900 898 — 3.00% Senior notes due April 2026Semi-annually1,300 1,297 1,296 5.15% Senior notes due June 2026Semi-annually1,500 1,496 — 2.125% Senior notes due September 2026Semi-annually1,000 997 995 4.95% Senior notes due September 2026Semi-annually750 747 746 2.875% Senior notes due April 2027Semi-annually750 747 745 2.50% Senior notes due April 2027Semi-annually750 747 746 4.875% Senior notes due June 2027Semi-annually1,000 995 — 2.80% Senior notes due September 2027Semi-annually1,000 984 979 0.90% Senior notes due March 2028Semi-annually500 497 497 1.50% Senior notes due September 2028Semi-annually1,000 995 994 3.90% Senior notes due December 2028Semi-annually1,000 972 970 4.90% Senior notes due April 2029Semi-annually750 744 743 2.95% Senior notes due June 2029Semi-annually1,750 1,672 1,665 4.75% Senior notes due June 2029Semi-annually1,250 1,239 — 2.70% Senior notes due April 2030Semi-annually1,500 1,359 1,346 1.375% Senior notes due March 2031Semi-annually1,250 1,173 1,167 4.85% Senior notes due June 2031Semi-annually1,000 989 — 1.875% Senior notes due September 2031Semi-annually1,000 939 936 3.25% Senior notes due April 2032Semi-annually1,250 1,240 1,239 4.50% Senior notes due September 2032Semi-annually1,250 1,244 1,243 4.95% Senior notes due June 2034Semi-annually1,750 1,725 — 5.875% Senior notes due December 2036Semi-annually3,000 2,879 2,872 3.30% Senior notes due April 2040Semi-annually1,250 1,071 1,057 5.40% Senior notes due September 2040Semi-annually500 496 496 5.95% Senior notes due April 2041Semi-annually1,000 991 991 4.20% Senior notes due April 2043Semi-annually1,000 937 927 4.875% Senior notes due February 2044Semi-annually1,000 982 982 4.40% Senior notes due March 2045Semi-annually1,000 981 980 4.25% Senior notes due April 2046Semi-annually1,600 1,587 1,586 3.90% Senior notes due June 2047Semi-annually1,150 1,145 1,145 4.50% Senior notes due December 2048Semi-annually1,500 1,466 1,465 3.125% Senior notes due December 2049Semi-annually1,250 1,176 1,173 3.35% Senior notes due April 2050Semi-annually1,500 1,473 1,472 2.375% Senior notes due March 2051Semi-annually1,250 1,152 1,150 2.75% Senior notes due September 2051Semi-annually1,000 984 983 3.625% Senior notes due April 2052Semi-annually1,500 1,459 1,458 4.95% Senior notes due September 2052Semi-annually1,000 980 980 5.30% Senior notes due June 2054Semi-annually1,500 1,466 — 3.50% Senior notes due September 2056Semi-annually1,000 974 974 5.40% Senior notes due June 2064Semi-annually500 489 — Total senior notes$51,050 $49,731 $40,843 Finance lease obligations; payable in varying installments through January 31, 20553,021 3,268 Other long-term debt315 — Total long-term debt53,067 44,111 Less: current installments of long-term debt4,582 1,368 Long-term debt, excluding current installments$48,485 $42,743\n"
    },
    {
      "cluster": 20,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsenior, notes, april, september, june, december, march, february, debt, less\n\nTABLE: TABLE: in millions InterestPayable PrincipalAmount February 2,2025 January 28,2024; 3.75% Senior notes due February 2024 Semi-annually $ — $ — $ 1,100; 2.70% Senior notes due April 2025 Semi-annually 500 500 499; 5.125% Senior notes due April 2025 Semi-annually 500 500 498; 3.35% Senior notes due September 2025 Semi-annually 1,000 999 999; 4.00% Senior notes due September 2025 Semi-annually 750 749 749; Floating rate Senior notes due December 2025 Quarterly 600 599 —; 5.10% Senior notes due December 2025 Semi-annually 900 898 —; 3.00% Senior notes due April 2026 Semi-annually 1,300 1,297 1,296; 5.15% Senior notes due June 2026 Semi-annually 1,500 1,496 —; 2.125% Senior notes due September 2026 Semi-annually 1,000 997 995; 4.95% Senior notes due September 2026 Semi-annually 750 747 746; 2.875% Senior notes due April 2027 Semi-annually 750 747 745; 2.50% Senior notes due April 2027 Semi-annually 750 747 746; 4.875% Senior notes due June 2027 Semi-annually 1,000 995 —; 2.80% Senior notes due September 2027 Semi-annually 1,000 984 979; 0.90% Senior notes due March 2028 Semi-annually 500 497 497; 1.50% Senior notes due September 2028 Semi-annually 1,000 995 994; 3.90% Senior notes due December 2028 Semi-annually 1,000 972 970; 4.90% Senior notes due April 2029 Semi-annually 750 744 743; 2.95% Senior notes due June 2029 Semi-annually 1,750 1,672 1,665; 4.75% Senior notes due June 2029 Semi-annually 1,250 1,239 —; 2.70% Senior notes due April 2030 Semi-annually 1,500 1,359 1,346; 1.375% Senior notes due March 2031 Semi-annually 1,250 1,173 1,167; 4.85% Senior notes due June 2031 Semi-annually 1,000 989 —; 1.875% Senior notes due September 2031 Semi-annually 1,000 939 936; 3.25% Senior notes due April 2032 Semi-annually 1,250 1,240 1,239; 4.50% Senior notes due September 2032 Semi-annually 1,250 1,244 1,243; 4.95% Senior notes due June 2034 Semi-annually 1,750 1,725 —; 5.875% Senior notes due December 2036 Semi-annually 3,000 2,879 2,872; 3.30% Senior notes due April 2040 Semi-annually 1,250 1,071 1,057; 5.40% Senior notes due September 2040 Semi-annually 500 496 496; 5.95% Senior notes due April 2041 Semi-annually 1,000 991 991; 4.20% Senior notes due April 2043 Semi-annually 1,000 937 927; 4.875% Senior notes due February 2044 Semi-annually 1,000 982 982; 4.40% Senior notes due March 2045 Semi-annually 1,000 981 980; 4.25% Senior notes due April 2046 Semi-annually 1,600 1,587 1,586; 3.90% Senior notes due June 2047 Semi-annually 1,150 1,145 1,145; 4.50% Senior notes due December 2048 Semi-annually 1,500 1,466 1,465; 3.125% Senior notes due December 2049 Semi-annually 1,250 1,176 1,173; 3.35% Senior notes due April 2050 Semi-annually 1,500 1,473 1,472; 2.375% Senior notes due March 2051 Semi-annually 1,250 1,152 1,150; 2.75% Senior notes due September 2051 Semi-annually 1,000 984 983; 3.625% Senior notes due April 2052 Semi-annually 1,500 1,459 1,458; 4.95% Senior notes due September 2052 Semi-annually 1,000 980 980; 5.30% Senior notes due June 2054 Semi-annually 1,500 1,466 —; 3.50% Senior notes due September 2056 Semi-annually 1,000 974 974; 5.40% Senior notes due June 2064 Semi-annually 500 489 —; Total senior notes $ 51,050 $ 49,731 $ 40,843; Finance lease obligations; payable in varying installments through January 31, 2055 3,021 3,268; Other long-term debt 315 —; Total long-term debt 53,067 44,111; Less: current installments of long-term debt 4,582 1,368; Long-term debt, excluding current installments $ 48,485 $ 42,743.\nTITLE: Carrying Amount (1)\nTITLE: in millionsInterestPayablePrincipalAmountFebruary 2,2025January 28,2024\nTITLE: in millions\nTITLE: InterestPayable\nTITLE: PrincipalAmount\nTITLE: February 2,2025\nTITLE: January 28,2024\nTEXT: 3.75% Senior notes due February 2024\nTEXT: 2.70% Senior notes due April 2025\nTEXT: 5.125% Senior notes due April 2025\nTEXT: 3.35% Senior notes due September 2025\nTEXT: 4.00% Senior notes due September 2025\nTEXT: 5.10% Senior notes due December 2025\nTEXT: 3.00% Senior notes due April 2026\nTEXT: 5.15% Senior notes due June 2026\nTEXT: 2.125% Senior notes due September 2026\nTEXT: 4.95% Senior notes due September 2026\nTEXT: 2.875% Senior notes due April 2027\nTEXT: 2.50% Senior notes due April 2027\nTEXT: 4.875% Senior notes due June 2027\nTEXT: 2.80% Senior notes due September 2027\nTEXT: 0.90% Senior notes due March 2028\nTEXT: 1.50% Senior notes due September 2028\nTEXT: 3.90% Senior notes due December 2028\nTEXT: 4.90% Senior notes due April 2029\nTEXT: 2.95% Senior notes due June 2029\nTEXT: 4.75% Senior notes due June 2029\nTEXT: 2.70% Senior notes due April 2030\nTEXT: 1.375% Senior notes due March 2031\nTEXT: 4.85% Senior notes due June 2031\nTEXT: 1.875% Senior notes due September 2031\nTEXT: 3.25% Senior notes due April 2032\nTEXT: 4.50% Senior notes due September 2032\nTEXT: 4.95% Senior notes due June 2034\nTEXT: 5.875% Senior notes due December 2036\nTEXT: 3.30% Senior notes due April 2040\nTEXT: 5.40% Senior notes due September 2040\nTEXT: 5.95% Senior notes due April 2041\nTEXT: 4.20% Senior notes due April 2043\nTEXT: 4.875% Senior notes due February 2044\nTEXT: 4.40% Senior notes due March 2045\nTEXT: 4.25% Senior notes due April 2046\nTEXT: 3.90% Senior notes due June 2047\nTEXT: 4.50% Senior notes due December 2048\nTEXT: 3.125% Senior notes due December 2049\nTEXT: 3.35% Senior notes due April 2050\nTEXT: 2.375% Senior notes due March 2051\nTEXT: 2.75% Senior notes due September 2051\nTEXT: 3.625% Senior notes due April 2052\nTEXT: 4.95% Senior notes due September 2052\nTEXT: 5.30% Senior notes due June 2054\nTEXT: 3.50% Senior notes due September 2056\nTEXT: 5.40% Senior notes due June 2064\nTEXT: Less: current installments of long-term debt\nTEXT: (1) Includes unamortized discounts, premiums, debt issuance costs, and the effects of fair value hedges.\n"
    },
    {
      "cluster": 21,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nnotes, december, june, interest, senior, tranche, consisted, rate, each, beginning\n\nTITLE: June 2024 Issuance. In June 2024, we issued nine tranches of senior notes.\nTEXT: •The first tranche consisted of $600 million of floating rate senior notes due December 24, 2025 (the “floating rate notes”). The floating rate notes bear interest at a variable rate determined quarterly equal to the compounded Secured Overnight Financing Rate (“SOFR”) plus 33 basis points. Interest on the floating rate notes is due quarterly on March 24, June 24, September 24, and December 24 of each year, beginning on September 24, 2024.\nTEXT: •The second tranche consisted of $900 million of 5.10% senior notes due December 24, 2025 (the “2025 notes”) at a discount of $0.8 million. Interest on the 2025 notes is due semi-annually on June 24 and December 24 of each year, beginning on December 24, 2024.\nTEXT: •The third tranche consisted of $1.5 billion of 5.15% senior notes due June 25, 2026 (the “2026 notes”) at a discount of $1.7 million. Interest on the 2026 notes is due semi-annually on June 25 and December 25 of each year, beginning on December 25, 2024.\nTEXT: •The fourth tranche consisted of $1.0 billion of 4.875% senior notes due June 25, 2027 (the “2027 notes”) at a discount of $3.3 million. Interest on the 2027 notes is due semi-annually on June 25 and December 25 of each year, beginning on December 25, 2024.\nTEXT: •The fifth tranche consisted of $1.25 billion of 4.75% senior notes due June 25, 2029 (the “2029 notes”) at a discount of $8.1 million. Interest on the 2029 notes is due semi-annually on June 25 and December 25 of each year, beginning on December 25, 2024.\nTEXT: •The sixth tranche consisted of $1.0 billion of 4.85% senior notes due June 25, 2031 (the “2031 notes”) at a discount of $7.1 million. Interest on the 2031 notes is due semi-annually on June 25 and December 25 of each year, beginning on December 25, 2024.\nTEXT: •The seventh tranche consisted of $1.75 billion of 4.95% senior notes due June 25, 2034 (the “2034 notes”) at a discount of $16.7 million. Interest on the 2034 notes is due semi-annually on June 25 and December 25 of each year, beginning on December 25, 2024.\nTEXT: •The eighth tranche consisted of $1.5 billion of 5.30% senior notes due June 25, 2054 (the “2054 notes”) at a discount of $23.5 million. Interest on the 2054 notes is due semi-annually on June 25 and December 25 of each year, beginning on December 25, 2024.\nTEXT: •The ninth tranche consisted of $500 million of 5.40% senior notes due June 25, 2064 (the “2064 notes”) at a discount of $8.5 million. Interest on the 2064 notes is due semi-annually on June 25 and December 25 of each year, beginning on December 25, 2024.\nTEXT: •Issuance costs for the June 2024 issuance totaled $41 million.\nTEXT: Redemption. Our floating rate notes are not redeemable prior to maturity. All of our fixed rate notes may be redeemed by us at any time, in whole or in part, at the redemption price plus accrued and unpaid interest up to the redemption date. With respect to the 5.125% 2025 notes, 5.10% 2025 notes, 5.15% 2026 notes and 5.875% 2036 notes, the redemption price is equal to the greater of (1) 100% of the principal amount of the notes to be redeemed or (2) the sum of the present values of the remaining scheduled payments of principal and interest on the notes that would be due after the related redemption date. With respect to all other fixed rate notes, prior to the relevant Par Call Date, as defined in the respective notes, the redemption price is equal to the greater of (1) 100% of the principal amount of the notes to be redeemed or (2) the sum of the present values of the remaining scheduled payments of principal and interest to the Par Call Date. On or after the relevant Par Call Date, the redemption price is equal to 100% of the principal amount of such notes. Additionally, if a Change in Control Triggering Event occurs, as defined in the notes, holders of all such notes have the right to require us to offer payment, in cash, for those notes equal to 101% of the aggregate principal amount of such notes plus accrued and unpaid interest up to the date of purchase.\nTEXT: The indentures governing our senior notes do not generally limit our ability to incur additional indebtedness or require us to maintain financial ratios or specified levels of net worth or liquidity. The indentures governing our notes contain various customary covenants; however, none of the covenants are expected to impact our liquidity or capital resources.\nTITLE: Repayments. In February 2024, we repaid our $1.1 billion 3.75% senior notes at maturity.\nTITLE: Maturities of Long-Term Debt. The following table presents our long-term debt maturities, excluding finance leases, as of February 2, 2025:\nTITLE: in millionsPrincipalFiscal 2025$4,315 Fiscal 20264,608 Fiscal 20273,559 Fiscal 20282,554 Fiscal 20293,799 Thereafter32,530 Total$51,365\nTABLE: TABLE: in millions Principal; Fiscal 2025 $ 4,315; Fiscal 2026 4,608; Fiscal 2027 3,559; Fiscal 2028 2,554; Fiscal 2029 3,799; Thereafter 32,530; Total $ 51,365.\nTITLE: in millionsPrincipalFiscal 2025$4,315 Fiscal 20264,608 Fiscal 20273,559 Fiscal 20282,554 Fiscal 20293,799 Thereafter32,530 Total$51,365\nTITLE: in millionsPrincipal\nTITLE: in millions\nTITLE: Principal\n"
    },
    {
      "cluster": 22,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfair, interest, february, cash, january, hedges, foreign, these, value, agreements\n\nTITLE: Derivative Instruments and Hedging Activities\nTEXT: We use derivative instruments as part of our normal business operations in the management of our exposure to fluctuations in foreign currency exchange rates and interest rates on certain debt. Our objective in managing these exposures is to decrease the volatility of cash flows affected by changes in the underlying rates and minimize the risk of changes in the fair value of our senior notes.\nTEXT: Fair Value Hedges. We had outstanding interest rate swap agreements with combined notional amounts of $5.4 billion at both February 2, 2025 and January 28, 2024. These agreements are accounted for as fair value hedges that swap fixed for variable rate interest to hedge changes in the fair values of certain senior notes. At February 2, 2025 and January 28, 2024, the fair values of these agreements totaled $795 million and $858 million, respectively, all of which are recognized in other long-term liabilities on our consolidated balance sheets.\nTEXT: All of our interest rate swap agreements designated as fair value hedges meet the shortcut method requirements under GAAP. Accordingly, the changes in the fair values of these agreements offset the changes in the fair value of the hedged long-term debt.\nTEXT: Cash Flow Hedges. At February 2, 2025 and January 28, 2024, we had outstanding foreign currency forward contracts accounted for as cash flow hedges, which hedge the variability of forecasted cash flows associated with certain payments made in our foreign operations. At February 2, 2025 and January 28, 2024, the notional amounts and the fair values of these contracts were not material. Additionally, the realized and unrealized gains and losses on these instruments were not material during fiscal 2024, fiscal 2023, and fiscal 2022.\nTEXT: From time to time, we also use treasury locks or forward-starting interest rate swap agreements to hedge the variability in future interest payments attributable to changing interest rates on forecasted debt issuances. There were no such instruments outstanding as of February 2, 2025 or January 28, 2024. All previously settled arrangements were designated as cash flow hedges and thus, the corresponding losses were initially recognized in accumulated other comprehensive loss and are being amortized to interest expense over the life of the respective notes. Unamortized losses remaining in accumulated other comprehensive loss were immaterial as of February 2, 2025 and January 28, 2024, as were the losses recognized within interest expense for fiscal 2024, fiscal 2023, and fiscal 2022.\nTEXT: We expect an immaterial amount of losses related to cash flow hedges recorded in accumulated other comprehensive loss as of February 2, 2025 to be reclassified into earnings within the next 12 months.\nTEXT: Collateral. We generally enter into master netting arrangements, which are designed to reduce credit risk by permitting net settlement of transactions with the same counterparty. To further limit our credit risk, we enter into collateral security arrangements that provide for collateral to be received or posted when the net fair value of certain derivative instruments exceeds or falls below contractually established thresholds. The cash collateral posted by the Company related to derivative instruments under our collateral security arrangements was $668 million and $714 million as of February 2, 2025 and January 28, 2024, respectively, which was recorded in other current assets on our consolidated balance sheets. We did not hold any cash collateral as of February 2, 2025 or January 28, 2024.\nTITLE: 6.INCOME TAXES\nTITLE: INCOME TAXES\nTITLE: Provision for Income Taxes\nTEXT: The following table presents our earnings before the provision for income taxes:\nTITLE: in millionsFiscalFiscalFiscal202420232022United States$18,119 $18,681 $20,990 Foreign1,287 1,243 1,487 Total$19,406 $19,924 $22,477\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; United States $ 18,119 $ 18,681 $ 20,990; Foreign 1,287 1,243 1,487; Total $ 19,406 $ 19,924 $ 22,477.\nTITLE: in millionsFiscalFiscalFiscal202420232022United States$18,119 $18,681 $20,990 Foreign1,287 1,243 1,487 Total$19,406 $19,924 $22,477\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: The following table presents our provision for income taxes:\nTEXT: in millionsFiscalFiscalFiscal202420232022Current:Federal$3,417 $3,764 $3,918 State836 882 880 Foreign386 365 436 Total current4,639 5,011 5,234 Deferred:Federal(67)(228)102 State25 12 61 Foreign3 (14)(25)Total deferred(39)(230)138 Provision for income taxes$4,600 $4,781 $5,372\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Federal $ 3,417 $ 3,764 $ 3,918; State 836 882 880; Foreign 386 365 436; Total current 4,639 5,011 5,234; Federal (67) (228) 102; State 25 12 61; Foreign 3 (14) (25); Total deferred (39) (230) 138; Provision for income taxes $ 4,600 $ 4,781 $ 5,372.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Current:\nTITLE: Deferred:\nTEXT: The following table presents our combined federal, state, and foreign effective tax rates:\nTITLE: FiscalFiscalFiscal202420232022Combined federal, state, and foreign effective tax rates23.7 %24.0 %23.9 %\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2024 2023 2022; Combined federal, state, and foreign effective tax rates 23.7 % 24.0 % 23.9 %.\nTITLE: FiscalFiscalFiscal202420232022Combined federal, state, and foreign effective tax rates23.7 %24.0 %23.9 %\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\n"
    },
    {
      "cluster": 23,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndeferred, taxes, assets, liabilities, earnings, income, state, other, total, losses\n\nTITLE: 2022\nTEXT: The following table presents the reconciliation of our provision for income taxes at the federal statutory rate of 21% to the actual tax expense:\nTEXT: in millionsFiscalFiscalFiscal202420232022Income taxes at federal statutory rate$4,075 $4,184 $4,720 State income taxes, net of federal income tax benefit680 706 743 Other, net(155)(109)(91)Total$4,600 $4,781 $5,372\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Income taxes at federal statutory rate $ 4,075 $ 4,184 $ 4,720; State income taxes, net of federal income tax benefit 680 706 743; Other, net (155) (109) (91); Total $ 4,600 $ 4,781 $ 5,372.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Deferred Taxes\nTEXT: The following table presents the tax effects of temporary differences that give rise to significant portions of our deferred tax assets and deferred tax liabilities:\nTEXT: in millionsFebruary 2,2025January 28,2024Assets:Deferred compensation$230 $237 Accrued self-insurance liabilities271 258 State income taxes133 209 Merchandise inventories— 110 Non-deductible reserves475 474 Net operating losses92 99 Lease liabilities2,255 2,034 Deferred revenue259 191 Other77 46 Total deferred tax assets3,792 3,658 Valuation allowance(4)(67)Total deferred tax assets, net of valuation allowance3,788 3,591 Liabilities:Merchandise inventories(12)— Property and equipment(854)(988)Goodwill and other intangibles (1)(2,200)(1,000)Lease right-of-use assets(2,178)(1,956)Tax on unremitted earnings(54)(53)Other(183)(144)Total deferred tax liabilities(5,481)(4,141)Net deferred tax liabilities$(1,693)$(550)\nTABLE: TABLE: in millions February 2,2025 January 28,2024; Deferred compensation $ 230 $ 237; Accrued self-insurance liabilities 271 258; State income taxes 133 209; Merchandise inventories — 110; Non-deductible reserves 475 474; Net operating losses 92 99; Lease liabilities 2,255 2,034; Deferred revenue 259 191; Other 77 46; Total deferred tax assets 3,792 3,658; Valuation allowance (4) (67); Total deferred tax assets, net of valuation allowance 3,788 3,591; Merchandise inventories (12) —; Property and equipment (854) (988); Goodwill and other intangibles (1) (2,200) (1,000); Lease right-of-use assets (2,178) (1,956); Tax on unremitted earnings (54) (53); Other (183) (144); Total deferred tax liabilities (5,481) (4,141); Net deferred tax liabilities $ (1,693) $ (550).\nTITLE: in millionsFebruary 2,2025January 28,2024\nTITLE: in millions\nTITLE: February 2,2025\nTITLE: January 28,2024\nTITLE: Assets:\nTITLE: Liabilities:\nTEXT: Goodwill and other intangibles (1)\nTEXT: (1) Increase year over year primarily results from the difference in book and tax basis related to identifiable intangible assets from the SRS acquisition (See Note 13).\nTEXT: The following table presents our noncurrent deferred tax assets and noncurrent deferred tax liabilities, netted by tax jurisdiction, as presented on the consolidated balance sheets:\nTEXT: in millionsConsolidated Balance Sheet ClassificationFebruary 2,2025January 28,2024Deferred tax assetsOther assets$269 $313 Deferred tax liabilitiesDeferred income taxes(1,962)(863)Net deferred tax liabilities$(1,693)$(550)\nTABLE: TABLE: in millions Consolidated Balance Sheet Classification February 2,2025 January 28,2024; Deferred tax assets Other assets $ 269 $ 313; Deferred tax liabilities Deferred income taxes (1,962) (863); Net deferred tax liabilities $ (1,693) $ (550).\nTITLE: in millionsConsolidated Balance Sheet ClassificationFebruary 2,2025January 28,2024\nTITLE: in millions\nTITLE: Consolidated Balance Sheet Classification\nTITLE: February 2,2025\nTITLE: January 28,2024\nTEXT: As of February 2, 2025, we recorded immaterial amounts for deferred tax assets for net operating losses as well as tax credits, primarily related to state jurisdictions. These losses and credits expire at various dates beginning in 2025 and 2026, respectively. We have concluded that it is more likely than not that tax benefits related to substantially all net operating losses and tax credits will be realized based upon the expectation that we will generate the necessary taxable income in future periods. The overall change in our valuation allowance was not material in fiscal 2024.\nTITLE: Reinvestment of Unremitted Earnings\nTEXT: Substantially all of our current year foreign cash earnings in excess of working capital and cash needed for strategic investments are not intended to be indefinitely reinvested offshore. Therefore, the tax effects of repatriation for applicable state taxes and foreign withholding taxes of such cash earnings have been provided for in the accompanying consolidated statements of earnings. We have the intent and ability to reinvest substantially all of the $5.1 billion of non-cash unremitted earnings of our non-U.S. subsidiaries indefinitely. Accordingly, no provision for state taxes or foreign withholding taxes was recorded on these unremitted earnings in the accompanying consolidated statements of earnings. It is impracticable for us to determine the amount of unrecognized deferred tax liabilities on these indefinitely reinvested earnings due to the complexities associated with the hypothetical calculation.\n"
    },
    {
      "cluster": 24,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, income, shares, stock, cash, unrecognized, benefits, positions, share, federal\n\nTITLE: Tax Return Examination Status\nTEXT: Our income tax returns are routinely examined by U.S. federal, state and local, and foreign tax authorities. The Company remains subject to income tax examination for fiscal years 2015 through 2023. The IRS is currently examining our U.S. federal income tax returns for fiscal years 2016 through 2021. There are also ongoing U.S. state and local audits and other foreign audits covering fiscal years 2013 through 2022. We do not expect the results from any ongoing income tax audit to have a material impact on our consolidated financial condition, results of operations, or cash flows.\nTEXT: Over the next twelve months, it is reasonably possible that the resolution of federal and state tax examinations, as well as the expiration of statutes of limitations, could reduce our unrecognized tax benefits by an immaterial amount. We do not anticipate the resolution of these matters will result in a material change to our consolidated financial condition, results of operations, or cash flows.\nTITLE: Unrecognized Tax Benefits\nTEXT: The following table reconciles the beginning and ending amount of our gross unrecognized tax benefits:\nTEXT: in millionsFiscalFiscalFiscal202420232022Unrecognized tax benefits balance at beginning of fiscal year$689 $643 $570 Additions based on tax positions related to the current year71 74 75 Additions for tax positions of prior years3 13 22 Reductions for tax positions of prior years(42)(14)(7)Reductions due to settlements(51)— (1)Reductions due to lapse of statute of limitations(43)(27)(16)Unrecognized tax benefits balance at end of fiscal year$627 $689 $643\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Unrecognized tax benefits balance at beginning of fiscal year $ 689 $ 643 $ 570; Additions based on tax positions related to the current year 71 74 75; Additions for tax positions of prior years 3 13 22; Reductions for tax positions of prior years (42) (14) (7); Reductions due to settlements (51) — (1); Reductions due to lapse of statute of limitations (43) (27) (16); Unrecognized tax benefits balance at end of fiscal year $ 627 $ 689 $ 643.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: Unrecognized tax benefits that if recognized would affect our annual effective income tax rate on net earnings were $509 million, $568 million, and $537 million at February 2, 2025, January 28, 2024, and January 29, 2023, respectively.\nTITLE: Interest and Penalties\nTEXT: Interest and penalties associated with uncertain tax positions recognized in the consolidated statements of earnings were immaterial in fiscal 2024, fiscal 2023, and fiscal 2022. Our total accrued interest and penalties associated with uncertain tax positions were immaterial as of February 2, 2025 and January 28, 2024.\nTITLE: Other\nTEXT: In fiscal 2024, the IRS provided automatic income tax relief to taxpayers in certain southeastern states, extending the timeline to make certain tax payments. As a result, our fourth quarter fiscal 2024 estimated federal tax payment has been deferred to the first quarter of fiscal 2025, which reduced our cash paid for income taxes during fiscal 2024 and increased income taxes payable at February 2, 2025.\nTITLE: 7.STOCKHOLDERS’ EQUITY\nTITLE: STOCKHOLDERS’ EQUITY\nTITLE: Stock Rollforward\nTEXT: The following table presents a reconciliation of the number of shares of our common stock outstanding and cash dividends per share:\nTEXT: shares in millionsFiscalFiscalFiscal202420232022Common stock:Shares at beginning of year1,796 1,794 1,792 Shares issued under employee stock plans, net4 2 2 Shares at end of year1,800 1,796 1,794 Treasury stock:Shares at beginning of year(804)(778)(757)Repurchases of common stock(2)(26)(21)Shares at end of year(806)(804)(778)Shares outstanding at end of year994 992 1,016 Cash dividends per share$9.00 $8.36 $7.60\nTABLE: TABLE: shares in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Shares at beginning of year 1,796 1,794 1,792; Shares issued under employee stock plans, net 4 2 2; Shares at end of year 1,800 1,796 1,794; Shares at beginning of year (804) (778) (757); Repurchases of common stock (2) (26) (21); Shares at end of year (806) (804) (778); Shares outstanding at end of year 994 992 1,016; Cash dividends per share $ 9.00 $ 8.36 $ 7.60.\nTITLE: shares in millionsFiscalFiscalFiscal\nTITLE: shares in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Common stock:\nTITLE: Treasury stock:\nTITLE: Share Repurchases\nTEXT: In August 2023, our Board approved a $15.0 billion share repurchase authorization that replaced the previous authorization of $15.0 billion, which was approved in August 2022. The August 2023 authorization does not have a prescribed expiration date. As of February 2, 2025, approximately $11.7 billion of the $15.0 billion share repurchase authorization remained available. In March 2024, we paused share repurchases in anticipation of the SRS acquisition (see Note 13 for details regarding the SRS acquisition).\nTEXT: The following table presents information about our repurchases of common stock, all of which were completed through open market purchases:\nTITLE: FiscalFiscalFiscalin millions202420232022Total number of shares repurchased2 26 21 Total cost of shares repurchased$599 $8,074 $6,504\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2024 2023 2022; Total number of shares repurchased 2 26 21; Total cost of shares repurchased $ 599 $ 8,074 $ 6,504.\nTITLE: FiscalFiscalFiscalin millions202420232022Total number of shares repurchased2 26 21 Total cost of shares repurchased$599 $8,074 $6,504\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202420232022\nTITLE: in millions\nTITLE: 2024\nTITLE: 2023\n"
    },
    {
      "cluster": 25,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfair, stock, value, shares, level, assets, plan, liabilities, omnibus, which\n\nTITLE: 2022\nTEXT: Total cost of shares repurchased\nTEXT: The cost of shares repurchased may differ from the repurchases of common stock amounts in the consolidated statements of cash flows due to unsettled share repurchases at the end of a period and net excise taxes incurred on share repurchases.\nTITLE: 8.FAIR VALUE MEASUREMENTS\nTITLE: FAIR VALUE MEASUREMENTS\nTEXT: The fair value of an asset is considered to be the price at which the asset could be sold in an orderly transaction between unrelated knowledgeable and willing parties. A liability’s fair value is defined as the amount that would be paid to transfer the liability to a new obligor, rather than the amount that would be paid to settle the liability with the creditor. Assets and liabilities recorded at fair value are measured using a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value. The levels of the fair value hierarchy are:\nTEXT: •Level 1: observable inputs such as quoted prices in active markets for identical assets or liabilities;\nTEXT: •Level 2: inputs other than quoted prices in active markets in Level 1 that are either directly or indirectly observable; and\nTEXT: •Level 3: unobservable inputs for which little or no market data exists, therefore requiring management judgment to develop the Company’s own models with estimates and assumptions.\nTITLE: Assets and Liabilities Measured at Fair Value on a Recurring Basis\nTEXT: The following table presents the assets and liabilities that are measured at fair value on a recurring basis:\nTEXT: February 2, 2025January 28, 2024in millions Fair Value (Level 2)Fair Value (Level 2)Derivative agreements – assets$— $— Derivative agreements – liabilities(795)(859)Total$(795)$(859)\nTABLE: TABLE: February 2, 2025 January 28, 2024; in millions Fair Value (Level 2) Fair Value (Level 2); Derivative agreements – assets $ — $ —; Derivative agreements – liabilities (795) (859); Total $ (795) $ (859).\nTITLE: February 2, 2025January 28, 2024\nTITLE: February 2, 2025\nTITLE: January 28, 2024\nTITLE: in millions Fair Value (Level 2)Fair Value (Level 2)\nTITLE: in millions\nTITLE: Fair Value (Level 2)\nTEXT: Derivative agreements – liabilities\nTEXT: The fair values of our derivative instruments are determined using an income approach and Level 2 inputs, which primarily include the respective interest rate forward curves and discount rates. Our derivative instruments are discussed further in Note 5.\nTITLE: Assets and Liabilities Measured at Fair Value on a Nonrecurring Basis\nTEXT: Long-lived assets, goodwill, and other intangible assets are subject to nonrecurring fair value measurement for the assessment of impairment. We did not have any material assets or liabilities that were measured and recognized at fair value on a nonrecurring basis during fiscal 2024, fiscal 2023, or fiscal 2022. See Note 13 for discussion on the fair values of assets acquired and liabilities assumed from business combinations.\nTITLE: Other Fair Value Disclosures\nTEXT: The carrying amounts of cash and cash equivalents, receivables, accounts payable, and short-term debt approximate fair value due to their short-term nature.\nTEXT: The following table presents the aggregate fair values and carrying values of our senior notes:\nTEXT: February 2, 2025January 28, 2024in millionsFair Value(Level 1)CarryingValueFair Value(Level 1)CarryingValueSenior notes$45,499 $49,731 $38,495 $40,843\nTABLE: TABLE: February 2, 2025 January 28, 2024; in millions Fair Value(Level 1) CarryingValue Fair Value(Level 1) CarryingValue; Senior notes $ 45,499 $ 49,731 $ 38,495 $ 40,843.\nTITLE: February 2, 2025January 28, 2024\nTITLE: February 2, 2025\nTITLE: January 28, 2024\nTITLE: in millionsFair Value(Level 1)CarryingValueFair Value(Level 1)CarryingValue\nTITLE: in millions\nTITLE: Fair Value(Level 1)\nTITLE: CarryingValue\nTITLE: Fair Value(Level 1)\nTITLE: CarryingValue\nTITLE: 9.STOCK-BASED COMPENSATION\nTITLE: STOCK-BASED COMPENSATION\nTITLE: Omnibus Stock Incentive Plans\nTEXT: The Home Depot, Inc. Omnibus Stock Incentive Plan, as Amended and Restated May 19, 2022 (the “Omnibus Plan”) and The Home Depot, Inc. 1997 Omnibus Stock Incentive Plan (the “1997 Plan” and collectively with the Omnibus Plan, the “Plans”) provide that incentive and nonqualified stock options, restricted stock, restricted stock units, performance shares, performance units, deferred shares, stock appreciation rights, and other stock-based awards may be issued to certain of our associates and non-employee directors. Under the Omnibus Plan, the maximum number of shares of our common stock authorized for issuance is 80 million shares plus a number of shares (not to exceed 10 million) related to underlying awards outstanding as of May 19, 2022, which can be returned to the share pool if those awards are subsequently terminated or expire unexercised, or are cancelled, forfeited or lapse for any reason, with any award other than a stock option or stock appreciation right reducing the number of shares available for issuance by 2.11 shares. At February 2, 2025, there were approximately 70 million shares available for future grants under the Omnibus Plan. No additional equity awards could be issued from the 1997 Plan after May 26, 2005.\nTEXT: The following table presents total stock-based compensation expense, net of estimated forfeitures, including expense related to our ESPPs, and related income tax benefit:\nTEXT: in millionsFiscalFiscalFiscal202420232022Pre-tax stock-based compensation expense$444 $382 $367 Income tax benefit(92)(79)(73)After-tax stock-based compensation expense$352 $303 $294\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Pre-tax stock-based compensation expense $ 444 $ 382 $ 367; Income tax benefit (92) (79) (73); After-tax stock-based compensation expense $ 352 $ 303 $ 294.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\n"
    },
    {
      "cluster": 26,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstock, options, expected, value, fair, date, grant, average, option, based\n\nTITLE: 2022\nTEXT: At February 2, 2025, there was $687 million of unrecognized stock-based compensation expense, which is expected to be recognized over a weighted-average period of three years.\nTEXT: The award types issued under the Plans are as follows:\nTEXT: Stock Options. Under the terms of the Plans, incentive stock options and nonqualified stock options must have an exercise price at or above the fair market value of our stock on the date of the grant. Typically, nonqualified stock options vest at the rate of 25% per year commencing on the second anniversary date of the grant and expire on the tenth anniversary date of the grant. Additionally, a majority of our stock options may become non-forfeitable upon the associate reaching age 60, provided the associate has had five years of continuous service. There are no incentive stock options outstanding under the Plans.\nTEXT: We estimate the fair value of stock option awards on the date of grant using the Black-Scholes option-pricing model. Our determination of fair value of stock option awards is affected by our stock price as well as assumptions regarding a number of variables.\nTEXT: The following table presents the per share weighted average fair value of stock options granted and the assumptions used in determining fair value at the date of grant using the Black-Scholes option-pricing model:\nTEXT: FiscalFiscalFiscal 202420232022Per share weighted average fair value$95.50 $66.01 $70.21 Risk-free interest rate4.2 %3.6 %2.5 %Expected volatility24.6 %26.7 %27.0 %Dividend yield2.4 %2.8 %2.4 %Expected term6 years6 years6 years\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2024 2023 2022; Per share weighted average fair value $ 95.50 $ 66.01 $ 70.21; Risk-free interest rate 4.2 % 3.6 % 2.5 %; Expected volatility 24.6 % 26.7 % 27.0 %; Dividend yield 2.4 % 2.8 % 2.4 %; Expected term 6 years 6 years 6 years.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: The risk-free interest rate is based on the U.S. Treasury (constant maturity) risk-free rate in effect at the date of grant for periods corresponding with the expected term of the options. Expected volatility is based on a combination of historical and implied volatility of our stock. The expected term is based on an analysis of historical and expected future exercise patterns.\nTEXT: The following table presents a summary of stock option activity by number of shares and weighted average exercise price during fiscal 2024:\nTEXT: shares in thousandsNumber ofSharesWeighted AverageExercise PriceOutstanding at beginning of year3,085 $189.97 Granted175 383.15 Exercised(1,036)138.64 Forfeited(23)306.00 Outstanding at end of year2,201 228.23\nTABLE: TABLE: shares in thousands Number ofShares Weighted AverageExercise Price; Outstanding at beginning of year 3,085 $ 189.97; Granted 175 383.15; Exercised (1,036) 138.64; Forfeited (23) 306.00; Outstanding at end of year 2,201 228.23.\nTITLE: shares in thousandsNumber ofSharesWeighted AverageExercise Price\nTITLE: shares in thousands\nTITLE: Number ofShares\nTITLE: Weighted AverageExercise Price\nTEXT: The following table presents the total intrinsic value of stock options exercised:\nTITLE: in millionsFiscalFiscalFiscal202420232022Total intrinsic value of stock options exercised$254 $152 $61\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Total intrinsic value of stock options exercised $ 254 $ 152 $ 61.\nTITLE: in millionsFiscalFiscalFiscal202420232022Total intrinsic value of stock options exercised$254 $152 $61\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: The following table presents details regarding outstanding and exercisable stock options at February 2, 2025:\nTEXT: shares in thousands, dollars in millions, except for per share amountsNumber ofSharesIntrinsicValueWeighted Average Remaining LifeWeighted AverageExercise PriceOutstanding2,201 $404 5.0 years$228.23 Exercisable1,411 320 3.6 years185.43\nTABLE: TABLE: shares in thousands, dollars in millions, except for per share amounts Number ofShares IntrinsicValue Weighted Average Remaining Life Weighted AverageExercise Price; Outstanding 2,201 $ 404 5.0 years $ 228.23; Exercisable 1,411 320 3.6 years 185.43.\nTITLE: shares in thousands, dollars in millions, except for per share amounts\nTITLE: Number ofShares\nTITLE: IntrinsicValue\nTITLE: Weighted Average Remaining Life\n"
    },
    {
      "cluster": 27,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstock, awards, restricted, performance, shares, date, based, share, grant, fair\n\nTITLE: Weighted AverageExercise Price\nTEXT: Shares of common stock issued from stock option exercises may be issued from authorized and unissued common stock or treasury stock.\nTEXT: Restricted Stock Awards. Restrictions on the restricted stock issued under the Plans generally lapse over various periods up to five years. At the grant date of the award, recipients of restricted stock are granted voting rights and generally receive dividends on unvested shares, paid in the form of cash on each dividend payment date. Dividends paid on unvested shares were immaterial for fiscal 2024, fiscal 2023, and fiscal 2022. Additionally, the majority of our restricted stock awards may become non-forfeitable upon the associate’s attainment of age 60, provided the associate has had five years of continuous service. The fair value of restricted stock is based on the closing stock price on the date of grant and is expensed over the period during which the restrictions lapse.\nTEXT: Restricted Stock Units. Each restricted stock unit entitles the associate to one share of common stock to be received upon vesting up to five years after the grant date. Additionally, the majority of these awards may become non-forfeitable upon the associate reaching age 60, provided the associate has had five years of continuous service. Recipients of restricted stock units have no voting rights until the vesting of the award. Recipients receive dividend equivalents that accrue on unvested units and are paid out in the form of additional shares of stock on the vesting date. The fair value of restricted stock units is based on the closing stock price on the date of grant and is expensed over the period during which the units vest.\nTEXT: The following table presents a summary of restricted stock and restricted stock unit activity during fiscal 2024:\nTEXT: shares in thousandsNumber ofSharesWeighted AverageGrant Date Fair ValueNonvested at beginning of year3,033 $277.09 Granted (1)1,330 375.21 Vested(1,113)260.05 Forfeited(200)315.04 Nonvested at end of year3,050 323.61\nTABLE: TABLE: shares in thousands Number ofShares Weighted AverageGrant Date Fair Value; Nonvested at beginning of year 3,033 $ 277.09; Granted (1) 1,330 375.21; Vested (1,113) 260.05; Forfeited (200) 315.04; Nonvested at end of year 3,050 323.61.\nTITLE: shares in thousandsNumber ofSharesWeighted AverageGrant Date Fair Value\nTITLE: shares in thousands\nTITLE: Number ofShares\nTITLE: Weighted AverageGrant Date Fair Value\nTEXT: (1) Includes replacement restricted stock awards with service-based vesting conditions issued in connection with the SRS acquisition (see Note 13).\nTEXT: The following table presents the total fair value of restricted stock and restricted stock units vested:\nTITLE: in millionsFiscalFiscalFiscal202420232022Total fair value vested$429 $312 $387\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Total fair value vested $ 429 $ 312 $ 387.\nTITLE: in millionsFiscalFiscalFiscal202420232022Total fair value vested$429 $312 $387\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: Performance Share Awards. We also grant performance share awards under the Plans. Recipients of performance share awards have no voting rights until the shares are issued following completion of the performance period. Dividend equivalents accrue on performance shares (as reinvested shares) and are paid upon the payout of the award based upon the actual number of shares earned.\nTEXT: Certain of these performance share awards provide for the issuance of shares of our common stock at the end of a three-year performance cycle based upon our performance against target average ROIC and operating profit over that performance cycle. These awards become non-forfeitable upon the associate’s attainment of age 60, provided the associate has had five years of continuous service and minimum performance targets are achieved. The fair value of these performance share awards is based on the closing stock price on the date of grant.\nTEXT: Separately, in relation to the SRS acquisition, we also granted performance share awards to various SRS employees. These awards provide for the issuance of shares of our common stock at the end of a five-year performance period. A portion of these awards are subject to the achievement of SRS EBITDA and sales targets, and a portion of these awards are subject to market conditions based on our stock price performance. The fair value of the portion of the awards subject to the achievement of EBITDA and sales targets were valued based on the closing stock price on the grant date. The portion of the awards subject to market conditions were valued using a Monte Carlo simulation on the date of grant.\nTEXT: The following table presents the per share weighted average fair value and the assumptions used in the Monte Carlo simulation for the market-based awards:\nTEXT: Fiscal 2024Per share weighted average fair value$125.92 Risk-free interest rate4.1 %Expected volatility25.4 %Dividend yield2.5 %Award term5 years\nTABLE: TABLE: Per share weighted average fair value $ 125.92; Risk-free interest rate 4.1 %; Expected volatility 25.4 %; Dividend yield 2.5 %; Award term 5 years.\nTITLE: Fiscal\n"
    },
    {
      "cluster": 28,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nshares, plans, stock, plan, deferred, following, associates, period, fair, purchase\n\nTITLE: 2024\nTEXT: The risk-free interest rate is based on the U.S. Treasury (constant maturity) risk-free rate in effect at the date of grant for periods corresponding with the term of the award. Expected volatility is based on a combination of historical and implied volatility of our stock. The award term is based on the vesting period of the award.\nTEXT: The following table presents a summary of performance share activity during fiscal 2024:\nTEXT: shares in thousandsNumber ofSharesWeighted AverageGrant Date Fair ValueNonvested at beginning of year353 $297.25 Granted (1)1,146 295.30 Vested(223)292.75 Forfeited(68)293.86 Nonvested at end of year1,208 296.42\nTABLE: TABLE: shares in thousands Number ofShares Weighted AverageGrant Date Fair Value; Nonvested at beginning of year 353 $ 297.25; Granted (1) 1,146 295.30; Vested (223) 292.75; Forfeited (68) 293.86; Nonvested at end of year 1,208 296.42.\nTITLE: shares in thousandsNumber ofSharesWeighted AverageGrant Date Fair Value\nTITLE: shares in thousands\nTITLE: Number ofShares\nTITLE: Weighted AverageGrant Date Fair Value\nTEXT: (1) Includes performance share awards issued in relation to the SRS acquisition.\nTEXT: The following table presents the total fair value of performance shares vested:\nTITLE: in millionsFiscalFiscalFiscal202420232022Total fair value vested$83 $100 $92\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Total fair value vested $ 83 $ 100 $ 92.\nTITLE: in millionsFiscalFiscalFiscal202420232022Total fair value vested$83 $100 $92\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: Deferred Shares. We grant awards of deferred shares to non-employee directors under the Plans. Each deferred share entitles the non-employee director to one share of common stock to be received following termination of Board service. Recipients of deferred shares have no voting rights and receive dividend equivalents that accrue and are paid out in the form of additional shares of stock upon payout of the underlying shares following termination of service. The fair value of the deferred shares is based on the closing stock price on the date of grant and is expensed immediately upon grant.\nTEXT: The following table presents deferred shares granted to non-employee directors:\nTITLE: shares in thousandsFiscalFiscalFiscal202420232022Deferred shares granted to non-employee directors15 19 19\nTABLE: TABLE: shares in thousands Fiscal Fiscal Fiscal; 2024 2023 2022; Deferred shares granted to non-employee directors 15 19 19.\nTITLE: shares in thousandsFiscalFiscalFiscal202420232022Deferred shares granted to non-employee directors15 19 19\nTITLE: shares in thousandsFiscalFiscalFiscal\nTITLE: shares in thousands\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Employee Stock Purchase Plans\nTEXT: We maintain two ESPPs: a U.S. and a non-U.S. plan. The plan for U.S. associates is a tax-qualified plan under Section 423 of the Internal Revenue Code. The non-U.S. plan is not a Section 423 plan. At February 2, 2025, there were approximately 14 million shares available under the U.S. plan and approximately 18 million shares available under the non-U.S. plan. The purchase price of shares under the ESPPs is equal to 85% of the stock’s fair market value on the last day of the purchase period, which is a six-month period ending on December 31 and June 30 of each year. During fiscal 2024, there were approximately 1 million shares purchased under the ESPPs at an average price of $309.59. Under the outstanding ESPPs at February 2, 2025, associates have contributed $31 million to purchase shares at 85% of the stock’s fair market value on the last day of the current purchase period, June 30, 2025.\nTITLE: 10.EMPLOYEE BENEFIT PLANS\nTITLE: EMPLOYEE BENEFIT PLANS\nTEXT: We maintain active defined contribution retirement plans for our associates (the “Benefit Plans”). All associates satisfying certain service requirements are eligible to participate in the Benefit Plans. We make cash contributions each payroll period up to specified percentages of associates’ contributions as approved by our Board.\nTEXT: We also maintain the Restoration Plans to provide certain associates deferred compensation that they would have received under the Benefit Plans as a matching contribution if not for the maximum compensation limits under the Internal Revenue Code. We fund the Restoration Plans through contributions made to grantor trusts, which are then used to purchase shares of our common stock in the open market.\nTEXT: The following table presents our contributions to the Benefit Plans and the Restoration Plans:\nTITLE: in millionsFiscalFiscalFiscal202420232022Contributions to the Benefit Plans and the Restoration Plans$347 $293 $280\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Contributions to the Benefit Plans and the Restoration Plans $ 347 $ 293 $ 280.\nTITLE: in millionsFiscalFiscalFiscal202420232022Contributions to the Benefit Plans and the Restoration Plans$347 $293 $280\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: At February 2, 2025, the Benefit Plans and the Restoration Plans held a total of 4.7 million shares of our common stock in trusts for plan participants.\nTITLE: 11.WEIGHTED AVERAGE COMMON SHARES\n"
    },
    {
      "cluster": 29,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nacquisition, company, weighted, average, common, shares, dilutive, diluted, securities, effect\n\nTITLE: WEIGHTED AVERAGE COMMON SHARES\nTEXT: The following table presents the reconciliation of our basic to diluted weighted average common shares as well as the number of anti-dilutive securities excluded from diluted weighted average common shares:\nTEXT: in millionsFiscalFiscalFiscal202420232022Basic weighted average common shares990 999 1,022 Effect of potentially dilutive securities (1)3 3 3 Diluted weighted average common shares993 1,002 1,025\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2024 2023 2022; Basic weighted average common shares 990 999 1,022; Effect of potentially dilutive securities (1) 3 3 3; Diluted weighted average common shares 993 1,002 1,025.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: Effect of potentially dilutive securities (1)\nTEXT: Anti-dilutive securities excluded from diluted weighted average common shares— 1 1\nTEXT: (1) Represents the dilutive impact of stock-based awards.\nTITLE: 12.COMMITMENTS AND CONTINGENCIES\nTITLE: COMMITMENTS AND CONTINGENCIES\nTEXT: At February 2, 2025, we had outstanding letters of credit totaling $651 million, primarily related to certain business transactions, including insurance programs, trade contracts, and construction contracts.\nTEXT: We are involved in litigation arising in the normal course of business. In management’s opinion, any such litigation is not expected to have a material adverse effect on our consolidated financial condition, results of operations, or cash flows.\nTITLE: 13.ACQUISITIONS\nTITLE: ACQUISITIONS\nTITLE: SRS Acquisition\nTEXT: On March 27, 2024, we entered into a definitive agreement to acquire SRS, a leading residential specialty trade distribution company across several verticals serving the professional roofer, landscaper and pool contractor. On June 18, 2024, following the satisfaction or waiver of the applicable closing conditions, including receipt of the requisite regulatory approvals, the acquisition was completed and all merger consideration was transferred. Under the terms of the merger agreement, a subsidiary of The Home Depot, Inc. merged with and into Shingle Acquisition Holdings, Inc., the parent company of SRS, with Shingle Acquisition Holdings, Inc. as the surviving entity and a wholly owned subsidiary of the Company. We believe the acquisition of SRS will accelerate the Company’s growth with the Pro. The acquisition is expected to establish the Company as a leading specialty trade distributor across multiple verticals, complement our existing capabilities, and enable us to better serve complex project purchase occasions with the renovator/remodeler. We primarily used a combination of proceeds from commercial paper borrowings, the issuance of long-term debt, as well as cash on hand to fund the acquisition. See Note 5 for further information on the financing for the transaction, and below for a summary of purchase consideration.\nTEXT: The acquisition was accounted for in accordance with Accounting Standards Codification Topic 805 “Business Combinations,” and SRS’s results of operations have been consolidated in the Company’s financial statements effective June 18, 2024. Acquisition-related costs were expensed as incurred and were not material.\nTITLE: Fair Value of Consideration Transferred. The following table summarizes total purchase consideration:\nTITLE: in millions Total cash consideration$17,707 Fair value of common stock issued (1)321 Total purchase consideration$18,028\nTABLE: TABLE: Total cash consideration $ 17,707; Fair value of common stock issued (1) 321; Total purchase consideration $ 18,028.\nTITLE: in millions Total cash consideration$17,707 Fair value of common stock issued (1)321 Total purchase consideration$18,028\n"
    },
    {
      "cluster": 30,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nassets, fair, intangible, shares, stock, recorded, liabilities, values, current, value\n\nTITLE: in millions\nTEXT: Fair value of common stock issued (1)\nTEXT: (1) In connection with the acquisition, certain members of SRS’s management team concurrently reinvested a portion of their respective after-tax merger consideration proceeds into shares of the Company’s common stock. A portion of such shares of Company common stock are fully vested, and accordingly, the fair value of such shares was recorded as non-cash purchase consideration. A portion of such shares of Company common stock, which replaced legacy SRS stock-based awards, are subject to service-based vesting conditions over a three-year period and become forfeitable if such vesting conditions are not satisfied. Accordingly, a portion of the fair value of these shares was recorded as non-cash purchase consideration, and the remainder will be recorded as post-combination expense over the vesting period. The fair value of these shares, including the amount which will be recorded as post-combination compensation expense, is not material.\nTEXT: Allocation of Consideration Transferred. We recorded a preliminary allocation of the purchase price to assets acquired and liabilities assumed based on their estimated fair values as of June 18, 2024. The following table summarizes our preliminary purchase price allocation, including resulting goodwill:\nTEXT: in millionsPreliminary Fair ValueCash and cash equivalents$161 Receivables1,831 Merchandise inventories1,988 Property and equipment789 Goodwill11,006 Intangible assets5,780 Other current and non-current assets744 Total assets acquired$22,299 Accounts payable$1,791 Other current liabilities584 Deferred tax liabilities (1)1,114 Other long-term liabilities782 Total liabilities assumed$4,271 Net assets acquired$18,028 —————\nTABLE: TABLE: in millions Preliminary Fair Value; Cash and cash equivalents $ 161; Receivables 1,831; Merchandise inventories 1,988; Property and equipment 789; Goodwill 11,006; Intangible assets 5,780; Other current and non-current assets 744; Total assets acquired $ 22,299; Accounts payable $ 1,791; Other current liabilities 584; Deferred tax liabilities (1) 1,114; Other long-term liabilities 782; Total liabilities assumed $ 4,271; Net assets acquired $ 18,028.\nTITLE: in millionsPreliminary Fair Value\nTITLE: in millions\nTITLE: Preliminary Fair Value\nTEXT: Other current and non-current assets\nTEXT: (1) Primarily resulting from the difference in book and tax basis related to identifiable intangible assets.\nTEXT: The acquisition date fair values of identifiable intangible assets were determined by using certain estimates and assumptions that are not observable in the market. The Company used the multi-period excess earnings method to determine the estimated acquisition date fair values of the customer relationships intangible assets. The significant assumptions used to estimate the fair values of customer relationships included forecasted revenues, expected customer attrition rates, and the discount rate applied. Determining the useful life of an intangible asset also requires judgment, as different types of intangible assets will have different useful lives.\nTEXT: The estimated fair values and estimated useful lives of identifiable intangible assets are as follows:\nTEXT: in millionsWeighted Average Useful Life (Years)Fair ValueCustomer relationships20$5,400 Trade names5380 Total identifiable intangible assets$5,780\nTABLE: TABLE: in millions Weighted Average Useful Life (Years) Fair Value; Customer relationships 20 $ 5,400; Trade names 5 380; Total identifiable intangible assets $ 5,780.\nTITLE: in millionsWeighted Average Useful Life (Years)Fair Value\nTITLE: in millions\nTITLE: Weighted Average Useful Life (Years)\n"
    },
    {
      "cluster": 31,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ngoodwill, acquisition, period, fiscal, immaterial, acquisitions, attributable, adjustments, measurement, during\n\nTITLE: Fair Value\nTEXT: Total identifiable intangible assets\nTEXT: The goodwill arising from the acquisition is attributable to anticipated (i) growth acceleration in the Pro market; (ii) expansion in high growth verticals including roofing; (iii) additional addressable market opportunities; (iv) enhanced delivery network capabilities; and (v) growth in sales force. We expect approximately $1.0 billion of goodwill related to the acquisition to be deductible for U.S. federal and state income tax purposes. At this time, all preliminary goodwill has been allocated to our three SRS reporting units and no goodwill currently resides in our Primary segment.\nTEXT: We have completed valuation analyses necessary to assess the fair values of the assets acquired and liabilities assumed and the amount of goodwill to be recognized as of the acquisition date. These fair values were based on management’s estimates and assumptions; however, the amounts indicated above are preliminary in nature and are subject to adjustment as additional information is obtained about the facts and circumstances that existed as of the acquisition date. Accordingly, there may be adjustments to the assigned values of acquired assets and liabilities assumed. Areas that remain preliminary primarily relate to income taxes, as well as any changes to residual goodwill resulting from measurement period adjustments. The final determination of acquisition date fair values and residual goodwill will be completed as soon as practicable, and within the measurement period of up to one year from the acquisition date as permitted under GAAP. Any adjustments to provisional amounts that are identified during the measurement period will be recorded in the reporting period in which the adjustment is determined. Measurement period adjustments recognized during fiscal 2024 were immaterial.\nTEXT: Results of Operations. Net sales attributable to SRS since the completion of the acquisition and included within our results of operations for fiscal 2024 totaled $6.4 billion. Net earnings attributable to SRS since the completion of the acquisition and included within our results of operations for fiscal 2024 were immaterial.\nTEXT: Pro forma results of operations would not be materially different as a result of the acquisition and therefore are not presented.\nTITLE: Other Fiscal 2024 Acquisitions\nTEXT: All other acquisitions completed during fiscal 2024 were immaterial both individually and in the aggregate.\nTITLE: Fiscal 2023 Acquisitions\nTEXT: During fiscal 2023, we completed three individually immaterial acquisitions for total aggregate cash purchase consideration of $1.5 billion. We recognized aggregate definite-lived intangible assets of $469 million with a weighted average amortization period of 17 years, primarily related to customer relationships, and goodwill of $1.0 billion. The goodwill arising from the acquisitions resides in our Primary segment and is primarily attributable to operational synergies and acceleration of growth strategy, as well as the assembled workforce. The portion of goodwill generated through these acquisitions that is expected to be deductible for U.S. federal and state tax purposes is not material. Measurement period adjustments recognized during fiscal 2024 were immaterial and our purchase price allocations are now finalized.\nTEXT: Net sales and net earnings for fiscal 2023 attributable to these acquisitions in the aggregate after their respective acquisition dates were immaterial. Pro forma results of operations would not be materially different as a result of the acquisitions in the aggregate and therefore are not presented.\n"
    }
  ]
}