{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, financial, operations, sales, income, discussion, results, earnings, total, cash\n\nTEXT: Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nTEXT: The following discussion provides an analysis of the Company’s financial condition and results of operations from management's perspective and should be read in conjunction with the consolidated financial statements and related notes included in this report. The discussion in this Form 10-K generally focuses on fiscal 2023 compared to fiscal 2022. A discussion of our results of operations and changes in financial condition for fiscal 2022 compared to fiscal 2021 has been omitted from this report, but can be found in Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our Form 10-K for fiscal 2022.\nTITLE: TABLE OF CONTENTS\nTEXT: Executive Summary28Results of Operations28Liquidity and Capital Resources31Critical Accounting Estimates33\nTABLE: TABLE: Executive Summary 28; Results of Operations 28; Liquidity and Capital Resources 31; Critical Accounting Estimates 33.\nTEXT: Liquidity and Capital Resources\nTITLE: EXECUTIVE SUMMARY\nTEXT: We reported net sales of $152.7 billion in fiscal 2023. Net earnings were $15.1 billion, or $15.11 per diluted share. During fiscal 2023, we opened eight new stores in the U.S. and five new stores in Mexico, resulting in a total store count of 2,335 at January 28, 2024. At the end of fiscal 2023, a total of 320 of our stores, or 13.7% of our total store count, were located in Canada and Mexico. Total sales per retail square foot were $604.55 in fiscal 2023. Our inventory turnover ratio was 4.3 times at the end of fiscal 2023, compared to 4.2 times at the end of fiscal 2022.\nTEXT: We generated $21.2 billion of cash flow from operations and issued $2.0 billion of long-term debt, net of discounts, during fiscal 2023. This cash flow, together with cash on hand, was used to fund cash payments of $8.4 billion for dividends and $8.0 billion for share repurchases. In addition, we invested $3.2 billion in capital expenditures and $1.5 billion in acquisitions, and we repaid $1.3 billion of long-term debt during fiscal 2023. In February 2024, we announced a 7.7% increase in our quarterly cash dividend to $2.25 per share.\nTEXT: Our ROIC was 36.7% for fiscal 2023 and 44.6% for fiscal 2022. The decrease in ROIC was primarily driven by lower operating income along with an increase in average long-term debt over the respective periods. See the Non-GAAP Financial Measures section below for our definition and calculation of ROIC, as well as a reconciliation of NOPAT, a non-GAAP financial measure, to net earnings (the most comparable GAAP financial measure).\nTITLE: RESULTS OF OPERATIONS\nTEXT: The following table presents the percentage relationship between net sales and major categories in our consolidated statements of earnings:\nTEXT: FiscalFiscalFiscal202320222021dollars in millions$% of Net Sales$% of Net Sales$% of Net SalesNet sales$152,669 $157,403 $151,157 Gross profit50,960 33.4 %52,778 33.5 %50,832 33.6 %Operating expenses:Selling, general and administrative26,598 17.4 26,284 16.7 25,406 16.8 Depreciation and amortization2,673 1.8 2,455 1.6 2,386 1.6 Total operating expenses29,271 19.2 28,739 18.3 27,792 18.4 Operating income21,689 14.2 24,039 15.3 23,040 15.2 Interest and other (income) expense:Interest income and other, net(178)(0.1)(55)— (44)— Interest expense1,943 1.3 1,617 1.0 1,347 0.9 Interest and other, net1,765 1.2 1,562 1.0 1,303 0.9 Earnings before provision for income taxes19,924 13.1 22,477 14.3 21,737 14.4 Provision for income taxes4,781 3.1 5,372 3.4 5,304 3.5 Net earnings$15,143 9.9 %$17,105 10.9 %$16,433 10.9 %\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2023 2022 2021; dollars in millions $ % of Net Sales $ % of Net Sales $ % of Net Sales; Net sales $ 152,669 $ 157,403 $ 151,157; Gross profit 50,960 33.4 % 52,778 33.5 % 50,832 33.6 %; Selling, general and administrative 26,598 17.4 26,284 16.7 25,406 16.8; Depreciation and amortization 2,673 1.8 2,455 1.6 2,386 1.6; Total operating expenses 29,271 19.2 28,739 18.3 27,792 18.4; Operating income 21,689 14.2 24,039 15.3 23,040 15.2; Interest income and other, net (178) (0.1) (55) — (44) —; Interest expense 1,943 1.3 1,617 1.0 1,347 0.9; Interest and other, net 1,765 1.2 1,562 1.0 1,303 0.9; Earnings before provision for income taxes 19,924 13.1 22,477 14.3 21,737 14.4; Provision for income taxes 4,781 3.1 5,372 3.4 5,304 3.5; Net earnings $ 15,143 9.9 % $ 17,105 10.9 % $ 16,433 10.9 %.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: dollars in millions$% of Net Sales$% of Net Sales$% of Net Sales\nTITLE: dollars in millions\nTITLE: $\nTITLE: % of Net Sales\nTITLE: $\nTITLE: % of Net Sales\nTITLE: $\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nsales, comparable, fiscal, average, retail, change, customer, transactions, ticket, square\n\nTITLE: % of Net Sales\nTEXT: Earnings before provision for income taxes\nTEXT: Note: Certain percentages may not sum to totals due to rounding.\nTEXT: % Change Selected financial and sales data:FiscalFiscalFiscalFiscalFiscal2023202220212023 vs. 20222022 vs. 2021Comparable sales (% change)(3.2)%3.1 %11.4 %N/AN/AComparable customer transactions (% change) (1)(2.9)%(5.4)%(0.1)%N/AN/AComparable average ticket (% change) (1)(0.3)%8.8 %11.7 %N/AN/ACustomer transactions (in millions) (1)1,621.81,666.41,759.7(2.7)%(5.3)%Average ticket (1) (2)$90.07$90.36$83.04(0.3)%8.8 %Sales per retail square foot (1) (3)$604.55$627.17$604.74(3.6)%3.7 %Diluted earnings per share$15.11$16.69$15.53(9.5)%7.5 %\nTABLE: TABLE: Selected financial and sales data: Fiscal Fiscal Fiscal Fiscal Fiscal; 2023 2022 2021 2023 vs. 2022 2022 vs. 2021; Comparable sales (% change) (3.2) % 3.1 % 11.4 % N/A N/A; Comparable customer transactions (% change) (1) (2.9) % (5.4) % (0.1) % N/A N/A; Comparable average ticket (% change) (1) (0.3) % 8.8 % 11.7 % N/A N/A; Customer transactions (in millions) (1) 1,621.8 1,666.4 1,759.7 (2.7) % (5.3) %; Average ticket (1) (2) $90.07 $90.36 $83.04 (0.3) % 8.8 %; Sales per retail square foot (1) (3) $604.55 $627.17 $604.74 (3.6) % 3.7 %; Diluted earnings per share $15.11 $16.69 $15.53 (9.5) % 7.5 %.\nTITLE: % Change\nTITLE: Selected financial and sales data:FiscalFiscalFiscalFiscalFiscal\nTITLE: Selected financial and sales data:\nTITLE: Fiscal\nTITLE: 2023202220212023 vs. 20222022 vs. 2021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: 2023 vs. 2022\nTITLE: 2022 vs. 2021\nTEXT: Comparable customer transactions (% change) (1)\nTEXT: Comparable average ticket (% change) (1)\nTEXT: Customer transactions (in millions) (1)\nTEXT: Sales per retail square foot (1) (3)\nTEXT: (1)Does not include results for HD Supply.\nTEXT: (2)Average ticket represents the average price paid per transaction and is used by management to monitor the performance of the Company, as it represents a primary driver in measuring sales performance.\nTEXT: (3)Sales per retail square foot represents sales divided by retail store square footage. Sales per retail square foot is a measure of the efficiency of sales based on the total square footage of our stores and is used by management to monitor the performance of the Company’s retail operations as an indicator of the productivity of owned and leased square footage for these retail operations.\nTITLE: FISCAL 2023 COMPARED TO FISCAL 2022\nTITLE: Sales\nTEXT: We assess our sales performance by evaluating both net sales and comparable sales.\nTEXT: Net Sales. Net sales for fiscal 2023 decreased $4.7 billion, or 3.0%, to $152.7 billion. The decrease in net sales for fiscal 2023 primarily reflects the impact of a negative comparable sales environment, primarily driven by a decrease in comparable customer transactions as well as the impact from lumber price deflation.\nTEXT: Online sales, which consist of sales generated online through our websites and mobile applications for products picked up at our stores or delivered to customer locations, represented 14.8% of net sales and increased by 1.1% during fiscal 2023 compared to fiscal 2022.\nTEXT: A weaker U.S. dollar positively impacted net sales by $276 million in fiscal 2023.\nTEXT: Comparable Sales. Comparable sales is a measure that highlights the performance of our existing locations and websites by measuring the change in net sales for a period over the comparable prior period of equivalent length. Comparable sales includes sales at all locations, physical and online, open greater than 52 weeks (including remodels and relocations) and excludes closed stores. Retail stores become comparable on the Monday following their 52nd week of operation. Acquisitions are typically included in comparable sales after they have been owned for more than 52 weeks. Comparable sales is intended only as supplemental information and is not a substitute for net sales presented in accordance with GAAP.\nTEXT: Total comparable sales decreased 3.2% in fiscal 2023, reflecting a 2.9% decrease in comparable customer transactions and a 0.3% decrease in comparable average ticket compared to fiscal 2022. The decrease in comparable customer transactions reflects the impact of macroeconomic factors, including the continued shift in consumer consumption trends away from goods and towards services and the impact of a higher interest rate environment, pressuring home improvement demand. The decrease in comparable average ticket reflects U.S. commodity price deflation, which negatively impacted average ticket by approximately 145 basis points, driven primarily by lumber. This was partially offset by inflation across several product categories, which slowed relative to prior years, along with demand for new and innovative products.\nTEXT: For fiscal 2023, four of our 14 merchandising departments—Building Materials, Outdoor Garden, Hardware, and Plumbing—posted positive comparable sales compared to fiscal 2022. All of our other merchandising departments posted negative comparable sales during fiscal 2023 compared to fiscal 2022, with our Lumber department posting a double-digit comparable sales decline primarily resulting from lumber price deflation, partially offset by higher unit sales.\nTITLE: Gross Profit\nTEXT: Gross profit decreased $1.8 billion, or 3.4%, to $51.0 billion in fiscal 2023. Gross profit as a percent of net sales, or gross profit margin, was 33.4% in fiscal 2023 compared to 33.5% in fiscal 2022. The decrease in gross profit margin primarily reflects price stabilization as well as reduction and optimization of our inventory position, partially offset by lower supply chain costs.\nTEXT: While we continue to experience shrink above historical averages, year-over-year pressure to gross profit margin from shrink decreased as we moved through fiscal 2023. As a result, shrink did not have a significant impact on our gross profit margin in fiscal 2023 compared to fiscal 2022.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, income, sales, interest, debt, depreciation, increased, rate, average, earnings\n\nTITLE: Operating Expenses\nTEXT: Our operating expenses are composed of SG&A and depreciation and amortization.\nTEXT: Selling, General & Administrative. SG&A increased $314 million, or 1.2%, to $26.6 billion in fiscal 2023. As a percent of net sales, SG&A was 17.4% in fiscal 2023 compared to 16.7% in fiscal 2022, primarily reflecting deleverage from a negative comparable sales environment along with previously executed wage investments for hourly associates, partially offset by the one-time benefit from the favorable settlement of litigation with a vendor as well as lower incentive compensation.\nTEXT: Depreciation and Amortization. Depreciation and amortization increased $218 million, or 8.9%, to $2.7 billion in fiscal 2023. As a percent of net sales, depreciation and amortization was 1.8% in fiscal 2023 compared to 1.6% in fiscal 2022, primarily reflecting increased depreciation expense from ongoing investments in the business and deleverage from a negative comparable sales environment.\nTITLE: Interest and Other, net\nTEXT: Interest and other, net increased $203 million, or 13.0%, to $1.8 billion in fiscal 2023. As a percent of net sales, interest and other, net, was 1.2% in fiscal 2023 compared to 1.0% in fiscal 2022, primarily due to increased variable rate interest on floating-rate debt resulting from interest rate swaps, higher average debt balances, and deleverage from a negative comparable sales environment, partially offset by higher interest income.\nTITLE: Provision for Income Taxes\nTEXT: Our combined effective income tax rate was 24.0% in fiscal 2023 compared to 23.9% in fiscal 2022.\nTITLE: Diluted Earnings per Share\nTEXT: Diluted earnings per share were $15.11 in fiscal 2023 compared to $16.69 in fiscal 2022. The decrease in diluted earnings per share for fiscal 2023 was primarily driven by lower net earnings during fiscal 2023, partially offset by lower diluted shares due to share repurchases.\nTITLE: NON-GAAP FINANCIAL MEASURES\nTEXT: To provide clarity on our operating performance, we supplement our reporting with certain non-GAAP financial measures. However, this supplemental information should not be considered in isolation or as a substitute for the related GAAP measures. Non-GAAP financial measures presented herein may differ from similar measures used by other companies.\nTITLE: Return on Invested Capital\nTEXT: We believe ROIC is meaningful for investors and management because it measures how effectively we deploy our capital base. We define ROIC as NOPAT, a non-GAAP financial measure, for the most recent twelve-month period, divided by average debt and equity. We define average debt and equity as the average of beginning and ending long-term debt (including current installments) and equity for the most recent twelve-month period.\nTEXT: The following table presents the calculation of ROIC, together with a reconciliation of NOPAT to net earnings (the most comparable GAAP measure):\nTEXT: FiscalFiscalFiscaldollars in millions202320222021Net earnings$15,143 $17,105 $16,433 Interest and other, net1,765 1,562 1,303 Provision for income taxes4,781 5,372 5,304 Operating income21,689 24,039 23,040 Income tax adjustment (1)(5,205)(5,745)(5,622)NOPAT$16,484 $18,294 $17,418 Average debt and equity$44,955 $41,055 $38,946 ROIC36.7 %44.6 %44.7 %\nTABLE: TABLE: Fiscal Fiscal Fiscal; dollars in millions 2023 2022 2021; Net earnings $ 15,143 $ 17,105 $ 16,433; Interest and other, net 1,765 1,562 1,303; Provision for income taxes 4,781 5,372 5,304; Operating income 21,689 24,039 23,040; Income tax adjustment (1) (5,205) (5,745) (5,622); NOPAT $ 16,484 $ 18,294 $ 17,418; Average debt and equity $ 44,955 $ 41,055 $ 38,946; ROIC 36.7 % 44.6 % 44.7 %.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: dollars in millions202320222021\nTITLE: dollars in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: (1)Income tax adjustment is defined as operating income multiplied by our effective tax rate for the trailing twelve months.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, capital, obligations, notes, fiscal, senior, business, approximately, january, which\n\nTITLE: LIQUIDITY AND CAPITAL RESOURCES\nTEXT: At January 28, 2024, we had $3.8 billion in cash and cash equivalents, of which $1.0 billion was held by our foreign subsidiaries. We believe that our current cash position, cash flow generated from operations, funds available from our commercial paper program, and access to the long-term debt capital markets should be sufficient not only for our operating requirements, any required debt payments, and satisfaction of other contractual obligations, but also to enable us to invest in the business, fund dividend payments, and fund any share repurchases through the next several fiscal years. In addition, we believe we have the ability to obtain alternative sources of financing, if necessary.\nTEXT: Our material cash requirements include contractual and other obligations arising in the normal course of business. These obligations primarily include long-term debt and related interest payments, operating and finance lease obligations, and purchase obligations. In addition to our cash requirements, we follow a disciplined approach to capital allocation. This approach first prioritizes investing in the business, followed by paying dividends, with the intent of then returning excess cash to shareholders in the form of share repurchases. During fiscal 2023, we invested approximately $3.2 billion back into our business in the form of capital expenditures. Additionally, we invested approximately $1.5 billion on three acquisitions during fiscal 2023, accelerating our strategic initiatives and providing us with better capabilities to serve our customers.\nTEXT: For fiscal 2024, in line with our expectation of approximately two percent of net sales on an annual basis, we plan to invest approximately $3.0 billion to $3.5 billion back into our business in the form of capital expenditures, with investments focused on new stores and improving the customer experience, including through technology and development of other differentiated capabilities. However, we may adjust our capital expenditures to support the operations of the business, to enhance long-term strategic positioning, or in response to the economic environment, as necessary or appropriate.\nTEXT: During fiscal 2023, we paid cash dividends of $8.4 billion to shareholders. In February 2024, we announced a 7.7% increase in our quarterly cash dividend from $2.09 to $2.25 per share. We intend to pay a dividend in the future; however, any future dividend is subject to declaration by the Board of Directors based on our earnings, capital requirements, financial condition, and other factors considered relevant by our Board of Directors.\nTEXT: In August 2023, our Board of Directors approved a $15.0 billion share repurchase authorization that replaced the previous authorization of $15.0 billion, which was approved in August 2022. The August 2023 authorization does not have a prescribed expiration date. As of January 28, 2024, approximately $12.3 billion of the $15.0 billion share repurchase authorization remained available. During fiscal 2023, we had cash payments of $8.0 billion for repurchases of our common stock through open market purchases.\nTITLE: DEBT\nTEXT: We have a commercial paper program that allows for borrowings up to $5.0 billion. In connection with our program, we have back-up credit facilities with a consortium of banks for borrowings up to $5.0 billion, which consist of a five-year $3.5 billion credit facility scheduled to expire in July 2027 and a 364-day $1.5 billion credit facility scheduled to expire in July 2024. In July 2023, we completed the renewal of our 364-day $1.5 billion credit facility, extending the maturity from July 2023 to July 2024. All of our short-term borrowings during fiscal 2023 were under our commercial paper program, and the maximum amount outstanding at any time was $1.5 billion. At January 28, 2024, we had no outstanding borrowings under this program, and we were in compliance with all of the covenants contained in our credit facilities, none of which are expected to impact our liquidity or capital resources.\nTEXT: We also issue senior notes from time to time as part of our capital management strategy. In November 2023, we issued $2.0 billion of senior notes. The net proceeds were used for general corporate purposes, including the repayment of our 3.75% senior notes due February 15, 2024 and repurchases of shares of our common stock. In April 2023, we repaid $1.0 billion of senior notes at maturity. At January 28, 2024, we had an aggregate principal amount of senior notes outstanding of $42.2 billion, with $1.1 billion payable within 12 months. Future interest payments associated with these senior notes total $23.7 billion, with $1.7 billion payable within 12 months, based on current interest rates, which include the impact of our active interest rate swap agreements.\nTEXT: The indentures governing our senior notes do not generally limit our ability to incur additional indebtedness or require us to maintain financial ratios or specified levels of net worth or liquidity. The indentures governing the notes contain various customary covenants; however, none are expected to impact our liquidity or capital resources. See Note 5 to our consolidated financial statements for further discussion of our debt arrangements.\nTITLE: LEASES\nTEXT: We use operating and finance leases largely to obtain a portion of our real estate, including our stores, distribution centers, and store support centers. At January 28, 2024, we had aggregate remaining lease payment obligations of $14.6 billion, with $1.7 billion payable within 12 months. Aggregate lease obligations include approximately $450 million of obligations related to leases not yet commenced. See Note 3 to our consolidated financial statements for further discussion of our operating and finance leases.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, fiscal, inventory, primarily, term, long, financial, activities, capital, debt\n\nTITLE: PURCHASE OBLIGATIONS AND OTHER\nTEXT: Purchase obligations include all legally binding contracts such as firm commitments for inventory purchases, media and sponsorship spend, software and license commitments, and legally binding service contracts. We issue inventory purchase orders in the ordinary course of business, which are typically cancellable by their terms, therefore we do not consider purchase orders that are cancellable to be firm inventory commitments. At January 28, 2024, we had aggregate purchase obligations of $2.5 billion, with $1.0 billion payable within 12 months.\nTEXT: At January 28, 2024, we had aggregate liabilities for unrecognized tax benefits totaling $689 million, of which approximately $25 million are expected to be paid in the next 12 months. The timing of payment, if any, associated with our long-term unrecognized tax benefit liabilities is unknown. See Note 6 to our consolidated financial statements for further discussion of our unrecognized tax benefits.\nTEXT: We have no material off-balance sheet arrangements.\nTITLE: CASH FLOWS SUMMARY\nTITLE: Operating Activities\nTEXT: Cash flow generated from operations provides us with a significant source of liquidity. Our operating cash flows result primarily from cash received from our customers, offset by cash payments we make for products and services, associate compensation, operations, occupancy costs, and income taxes. Cash provided by or used in operating activities is also subject to changes in working capital. Working capital at any point in time is subject to many variables, including seasonality, inventory management and category expansion, the timing of cash receipts and payments, vendor payment terms, and fluctuations in foreign exchange rates.\nTEXT: Net cash provided by operating activities increased by $6.6 billion in fiscal 2023 compared to fiscal 2022, primarily driven by changes in working capital, partially offset by a decrease in net earnings. Changes in working capital were primarily driven by lower inventory purchases in fiscal 2023 relative to fiscal 2022, as well as timing of vendor payments. Inventory levels normalized in fiscal 2023 as we adjusted purchasing activity to align with demand and continued to sell through existing inventory.\nTITLE: Investing Activities\nTEXT: Net cash used in investing activities increased by $1.6 billion in fiscal 2023 compared to fiscal 2022, primarily resulting from cash paid for acquired businesses as well as increased capital expenditures primarily due to investments in new store growth. See Note 13 to our consolidated financial statements for further discussion of acquisitions.\nTITLE: Financing Activities\nTEXT: Net cash used in financing activities in fiscal 2023 primarily reflected $8.4 billion of cash dividends paid, $8.0 billion of share repurchases, and $1.3 billion of repayments of long-term debt, partially offset by $2.0 billion of net proceeds from long-term debt.\nTEXT: Cash used in financing activities in fiscal 2022 primarily reflected $7.8 billion of cash dividends paid, $6.7 billion of share repurchases, $2.5 billion of repayments of long-term debt, and $1.0 billion of net repayments of short-term debt, partially offset by $6.9 billion of net proceeds from long-term debt.\nTITLE: CRITICAL ACCOUNTING ESTIMATES\nTEXT: The preparation of our consolidated financial statements in accordance with GAAP requires that we make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities, and the reported amounts of revenues and expenses. Actual results could differ from those estimates.\nTEXT: Our significant accounting policies are disclosed in Note 1 to our consolidated financial statements. The following discussion addresses our most critical accounting estimates, which are those that are both important to the representation of our financial condition and results of operations, and that require significant judgment or use of significant assumptions or complex estimates.\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ninventory, retail, cost, method, shrink, value, based, market, losses, results\n\nTITLE: MERCHANDISE INVENTORIES\nTEXT: We value the majority of our inventory under the retail inventory method, with the remainder of our inventories valued under a cost method, primarily the first-in, first-out method. Under the retail inventory method, inventories are stated at cost, which is determined by applying a cost-to-retail ratio to the retail value of inventories.\nTEXT: The retail value of our inventory is adjusted as needed to reflect current market conditions. Because these adjustments are based on current prevailing market conditions, the value of our inventory approximates the lower of cost or market. The valuation under the retail inventory method is based on a number of factors such as markups, markdowns, and inventory losses (or shrink). As such, there exists an inherent uncertainty in the final determination of inventory cost and gross profit. We determine markups and markdowns based on the consideration of a variety of factors such as current and anticipated demand, customer preferences and buying trends, age of the merchandise, and weather conditions.\nTEXT: We calculate shrink based on actual inventory losses identified as a result of physical inventory counts during each fiscal period and estimated inventory losses between physical inventory counts. The estimate for shrink occurring in the interim period between physical inventory counts is calculated on a store-specific basis and is primarily based on recent shrink results. A 10% increase in the shrink rate used to estimate our inventory shrink reserve would have increased cost of sales by approximately $104 million for fiscal 2023. Historically, the difference between estimated shrink and actual inventory losses has not been material to our annual financial results.\nTEXT: We do not believe there is a reasonable likelihood of a material change in the estimates or assumptions we use to value our inventory under the retail inventory method. We believe that the retail inventory method provides an inventory valuation which approximates cost and results in valuing our inventory at the lower of cost or market.\nTITLE: ADDITIONAL INFORMATION\nTEXT: For information on our accounting policies and on accounting pronouncements that have impacted or are expected to materially impact our financial condition, results of operations, or cash flows, see Note 1 to our consolidated financial statements.\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nnote, consolidated, statements, financial, accounting, company, january, stockholders, audits, public\n\nTEXT: Financial Statements and Supplementary Data.\nTITLE: TABLE OF CONTENTS\nTEXT: Report of Independent Registered Public Accounting Firm36Consolidated Balance Sheets38Consolidated Statements of Earnings39Consolidated Statements of Comprehensive Income40Consolidated Statements of Stockholders' Equity41Consolidated Statements of Cash Flows42Notes to Consolidated Financial Statements43Note 1. Summary of Significant Accounting Policies43Note 2. Segment Reporting and Net Sales50Note 3. Property and Leases51Note 4. Goodwill and Intangible Assets53Note 5. Debt and Derivative Instruments54Note 6. Income Taxes57Note 7. Stockholders' Equity61Note 8. Fair Value Measurements61Note 9. Stock-Based Compensation62Note 10. Employee Benefit Plans65Note 11. Weighted Average Common Shares65Note 12. Commitments and Contingencies65Note 13. Acquisitions65\nTABLE: TABLE: Report of Independent Registered Public Accounting Firm 36; Consolidated Balance Sheets 38; Consolidated Statements of Earnings 39; Consolidated Statements of Comprehensive Income 40; Consolidated Statements of Stockholders' Equity 41; Consolidated Statements of Cash Flows 42; Notes to Consolidated Financial Statements 43; Note 1. Summary of Significant Accounting Policies 43; Note 2. Segment Reporting and Net Sales 50; Note 3. Property and Leases 51; Note 4. Goodwill and Intangible Assets 53; Note 5. Debt and Derivative Instruments 54; Note 6. Income Taxes 57; Note 7. Stockholders' Equity 61; Note 8. Fair Value Measurements 61; Note 9. Stock-Based Compensation 62; Note 10. Employee Benefit Plans 65; Note 11. Weighted Average Common Shares 65; Note 12. Commitments and Contingencies 65; Note 13. Acquisitions 65.\nTEXT: Report of Independent Registered Public Accounting Firm\nTEXT: Consolidated Statements of Earnings\nTEXT: Consolidated Statements of Comprehensive Income\nTEXT: Consolidated Statements of Stockholders' Equity\nTEXT: Consolidated Statements of Cash Flows\nTEXT: Notes to Consolidated Financial Statements\nTEXT: Note 1. Summary of Significant Accounting Policies\nTEXT: Note 2. Segment Reporting and Net Sales\nTEXT: Note 4. Goodwill and Intangible Assets\nTEXT: Note 5. Debt and Derivative Instruments\nTEXT: Note 8. Fair Value Measurements\nTEXT: Note 9. Stock-Based Compensation\nTEXT: Note 10. Employee Benefit Plans\nTEXT: Note 11. Weighted Average Common Shares\nTEXT: Note 12. Commitments and Contingencies\nTITLE: REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTEXT: To the Stockholders and the Board of Directors\nTITLE: Opinion on the Consolidated Financial Statements\nTEXT: We have audited the accompanying consolidated balance sheets of The Home Depot, Inc. and its subsidiaries (the Company) as of January 28, 2024 and January 29, 2023, the related consolidated statements of earnings, comprehensive income, stockholders’ equity, and cash flows for each of the fiscal years in the three-year period ended January 28, 2024, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of January 28, 2024 and January 29, 2023, and the results of its operations and its cash flows for each of the fiscal years in the three-year period ended January 28, 2024, in conformity with U.S. generally accepted accounting principles.\nTEXT: We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of January 28, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated March 13, 2024 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nTITLE: Basis for Opinion\nTEXT: These consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ninventory, shrink, audit, current, liabilities, matter, january, shares, critical, physical\n\nTITLE: Critical Audit Matter\nTEXT: The critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nTEXT: As discussed in Note 1 to the consolidated financial statements, the majority of the Company’s U.S. merchandise inventories are stated at the lower of cost or market as determined by the retail inventory method, which is based on a number of factors such as markups, markdowns, and inventory losses (or shrink). Shrink is the difference between the recorded amount of inventory and the physical inventory count. The Company calculates shrink based on actual inventory losses identified as a result of physical inventory counts during each fiscal period and estimated inventory losses between physical inventory counts. The estimate for shrink occurring in the interim period between physical inventory counts is calculated on a store-specific basis and is primarily based on recent shrink results.\nTEXT: We identified the evaluation of the estimation of store shrink occurring in the period between physical inventory counts and fiscal year-end as a critical audit matter. Evaluating the Company’s estimation of shrink at the end of the fiscal year using interim inventory loss experience in U.S. retail stores involved auditor judgment.\nTEXT: The following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the process of developing the estimate of store shrink. We evaluated the appropriateness of the Company using interim physical inventory counts to estimate inventory losses in U.S. retail stores at the end of the fiscal year by:\nTEXT: •Evaluating the method and certain assumptions used;\nTEXT: •Testing the application of the method and certain assumptions used;\nTEXT: •Performing a current year trend analysis; and\nTEXT: •Performing a sensitivity analysis over the shrink reserve estimate.\nTEXT: We have served as the Company’s auditor since 1979.\nTITLE: THE HOME DEPOT, INC.\nTITLE: CONSOLIDATED BALANCE SHEETS\nTEXT: in millions, except per share dataJanuary 28,2024January 29,2023AssetsCurrent assets:Cash and cash equivalents$3,760 $2,757 Receivables, net3,328 3,317 Merchandise inventories20,976 24,886 Other current assets1,711 1,511 Total current assets29,775 32,471 Net property and equipment26,154 25,631 Operating lease right-of-use assets7,884 6,941 Goodwill8,455 7,444 Other assets4,262 3,958 Total assets$76,530 $76,445 Liabilities and Stockholders’ EquityCurrent liabilities:Accounts payable$10,037 $11,443 Accrued salaries and related expenses2,096 1,991 Sales taxes payable449 528 Deferred revenue2,762 3,064 Income taxes payable28 50 Current installments of long-term debt1,368 1,231 Current operating lease liabilities1,050 945 Other accrued expenses4,225 3,858 Total current liabilities22,015 23,110 Long-term debt, excluding current installments42,743 41,962 Long-term operating lease liabilities7,082 6,226 Deferred income taxes863 1,019 Other long-term liabilities2,783 2,566 Total liabilities75,486 74,883 Commitments and contingencies (Note 12)Common stock, par value $0.05; authorized: 10,000 shares; issued: 1,796 shares at January 28, 2024 and 1,794 shares at January 29, 2023; outstanding: 992 shares at January 28, 2024 and 1,016 shares at January 29, 202390 90 Paid-in capital13,147 12,592 Retained earnings83,656 76,896 Accumulated other comprehensive loss(477)(718)Treasury stock, at cost, 804 shares at January 28, 2024 and 778 shares at January 29, 2023(95,372)(87,298)Total stockholders’ equity1,044 1,562 Total liabilities and stockholders’ equity$76,530 $76,445\nTABLE: TABLE: in millions, except per share data January 28,2024 January 29,2023; Cash and cash equivalents $ 3,760 $ 2,757; Receivables, net 3,328 3,317; Merchandise inventories 20,976 24,886; Other current assets 1,711 1,511; Total current assets 29,775 32,471; Net property and equipment 26,154 25,631; Operating lease right-of-use assets 7,884 6,941; Goodwill 8,455 7,444; Other assets 4,262 3,958; Total assets $ 76,530 $ 76,445; Accounts payable $ 10,037 $ 11,443; Accrued salaries and related expenses 2,096 1,991; Sales taxes payable 449 528; Deferred revenue 2,762 3,064; Income taxes payable 28 50; Current installments of long-term debt 1,368 1,231; Current operating lease liabilities 1,050 945; Other accrued expenses 4,225 3,858; Total current liabilities 22,015 23,110; Long-term debt, excluding current installments 42,743 41,962; Long-term operating lease liabilities 7,082 6,226; Deferred income taxes 863 1,019; Other long-term liabilities 2,783 2,566; Total liabilities 75,486 74,883; Common stock, par value $0.05; authorized: 10,000 shares; issued: 1,796 shares at January 28, 2024 and 1,794 shares at January 29, 2023; outstanding: 992 shares at January 28, 2024 and 1,016 shares at January 29, 2023 90 90; Paid-in capital 13,147 12,592; Retained earnings 83,656 76,896; Accumulated other comprehensive loss (477) (718); Treasury stock, at cost, 804 shares at January 28, 2024 and 778 shares at January 29, 2023 (95,372) (87,298); Total stockholders’ equity 1,044 1,562; Total liabilities and stockholders’ equity $ 76,530 $ 76,445.\nTITLE: in millions, except per share dataJanuary 28,2024January 29,2023\nTITLE: in millions, except per share data\nTITLE: January 28,2024\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nshares, other, income, balance, stock, earnings, january, comprehensive, common, loss\n\nTITLE: January 29,2023\nTITLE: Assets\nTITLE: Liabilities and Stockholders’ Equity\nTEXT: Commitments and contingencies (Note 12)\nTEXT: Common stock, par value $0.05; authorized: 10,000 shares; issued: 1,796 shares at January 28, 2024 and 1,794 shares at January 29, 2023; outstanding: 992 shares at January 28, 2024 and 1,016 shares at January 29, 2023\nTEXT: Treasury stock, at cost, 804 shares at January 28, 2024 and 778 shares at January 29, 2023\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: CONSOLIDATED STATEMENTS OF EARNINGS\nTEXT: in millions, except per share dataFiscalFiscalFiscal202320222021Net sales$152,669 $157,403 $151,157 Cost of sales101,709 104,625 100,325 Gross profit50,960 52,778 50,832 Operating expenses:Selling, general and administrative26,598 26,284 25,406 Depreciation and amortization2,673 2,455 2,386 Total operating expenses29,271 28,739 27,792 Operating income21,689 24,039 23,040 Interest and other (income) expense:Interest income and other, net(178)(55)(44)Interest expense1,943 1,617 1,347 Interest and other, net1,765 1,562 1,303 Earnings before provision for income taxes19,924 22,477 21,737 Provision for income taxes4,781 5,372 5,304 Net earnings$15,143 $17,105 $16,433 Basic weighted average common shares999 1,022 1,054 Basic earnings per share$15.16 $16.74 $15.59 Diluted weighted average common shares1,002 1,025 1,058 Diluted earnings per share$15.11 $16.69 $15.53\nTABLE: TABLE: in millions, except per share data Fiscal Fiscal Fiscal; 2023 2022 2021; Net sales $ 152,669 $ 157,403 $ 151,157; Cost of sales 101,709 104,625 100,325; Gross profit 50,960 52,778 50,832; Selling, general and administrative 26,598 26,284 25,406; Depreciation and amortization 2,673 2,455 2,386; Total operating expenses 29,271 28,739 27,792; Operating income 21,689 24,039 23,040; Interest income and other, net (178) (55) (44); Interest expense 1,943 1,617 1,347; Interest and other, net 1,765 1,562 1,303; Earnings before provision for income taxes 19,924 22,477 21,737; Provision for income taxes 4,781 5,372 5,304; Net earnings $ 15,143 $ 17,105 $ 16,433; Basic weighted average common shares 999 1,022 1,054; Basic earnings per share $ 15.16 $ 16.74 $ 15.59; Diluted weighted average common shares 1,002 1,025 1,058; Diluted earnings per share $ 15.11 $ 16.69 $ 15.53.\nTITLE: in millions, except per share dataFiscalFiscalFiscal\nTITLE: in millions, except per share data\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nTEXT: FiscalFiscalFiscalin millions202320222021Net earnings$15,143 $17,105 $16,433 Other comprehensive income (loss), net of tax:Foreign currency translation adjustments232 (22)(77)Cash flow hedges8 9 9 Other1 (1)35 Total other comprehensive income (loss), net of tax241 (14)(33)Comprehensive income$15,384 $17,091 $16,400\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2023 2022 2021; Net earnings $ 15,143 $ 17,105 $ 16,433; Foreign currency translation adjustments 232 (22) (77); Cash flow hedges 8 9 9; Other 1 (1) 35; Total other comprehensive income (loss), net of tax 241 (14) (33); Comprehensive income $ 15,384 $ 17,091 $ 16,400.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202320222021\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: Other comprehensive income (loss), net of tax:\nTEXT: Total other comprehensive income (loss), net of tax\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: CONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nTEXT: in millionsFiscalFiscalFiscal202320222021Common Stock:Balance at beginning of year$90 $90 $89 Shares issued under employee stock plans, net— — 1 Balance at end of year90 90 90 Paid-in Capital:Balance at beginning of year12,592 12,132 11,540 Shares issued under employee stock plans, net175 94 194 Stock-based compensation expense380 366 398 Balance at end of year13,147 12,592 12,132 Retained Earnings:Balance at beginning of year76,896 67,580 58,134 Net earnings15,143 17,105 16,433 Cash dividends(8,383)(7,789)(6,985)Other— — (2)Balance at end of year83,656 76,896 67,580 Accumulated Other Comprehensive Loss:Balance at beginning of year(718)(704)(671)Foreign currency translation adjustments, net of tax232 (22)(77)Cash flow hedges, net of tax8 9 9 Other, net of tax1 (1)35 Balance at end of year(477)(718)(704)Treasury Stock:Balance at beginning of year(87,298)(80,794)(65,793)Repurchases of common stock(8,074)(6,504)(15,001)Balance at end of year(95,372)(87,298)(80,794)Total stockholders’ equity (deficit) $1,044 $1,562 $(1,696)\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Balance at beginning of year $ 90 $ 90 $ 89; Shares issued under employee stock plans, net — — 1; Balance at end of year 90 90 90; Balance at beginning of year 12,592 12,132 11,540; Shares issued under employee stock plans, net 175 94 194; Stock-based compensation expense 380 366 398; Balance at end of year 13,147 12,592 12,132; Balance at beginning of year 76,896 67,580 58,134; Net earnings 15,143 17,105 16,433; Cash dividends (8,383) (7,789) (6,985); Other — — (2); Balance at end of year 83,656 76,896 67,580; Balance at beginning of year (718) (704) (671); Foreign currency translation adjustments, net of tax 232 (22) (77); Cash flow hedges, net of tax 8 9 9; Other, net of tax 1 (1) 35; Balance at end of year (477) (718) (704); Balance at beginning of year (87,298) (80,794) (65,793); Repurchases of common stock (8,074) (6,504) (15,001); Balance at end of year (95,372) (87,298) (80,794); Total stockholders’ equity (deficit) $ 1,044 $ 1,562 $ (1,696).\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: Common Stock:\nTITLE: Paid-in Capital:\nTITLE: Retained Earnings:\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, activities, changes, operating, equivalents, home, financial, statements, other, products\n\nTITLE: Accumulated Other Comprehensive Loss:\nTITLE: Treasury Stock:\nTEXT: Total stockholders’ equity (deficit)\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: CONSOLIDATED STATEMENTS OF CASH FLOWS\nTEXT: FiscalFiscalFiscalin millions202320222021Cash Flows from Operating Activities:Net earnings$15,143 $17,105 $16,433 Reconciliation of net earnings to net cash provided by operating activities:Depreciation and amortization3,247 2,975 2,862 Stock-based compensation expense380 366 399 Changes in receivables, net134 111 (435)Changes in merchandise inventories4,137 (2,830)(5,403)Changes in other current assets(184)(311)(330)Changes in accounts payable and accrued expenses(1,411)(2,577)2,401 Changes in deferred revenue(318)(526)775 Changes in income taxes payable(25)(107)(51)Changes in deferred income taxes(245)138 (276)Other operating activities314 271 196 Net cash provided by operating activities21,172 14,615 16,571 Cash Flows from Investing Activities:Capital expenditures(3,226)(3,119)(2,566)Payments for businesses acquired, net (1,514)— (421)Other investing activities11 (21)18 Net cash used in investing activities(4,729)(3,140)(2,969)Cash Flows from Financing Activities:(Repayments of) proceeds from short-term debt, net— (1,035)1,035 Proceeds from long-term debt, net of discounts1,995 6,942 2,979 Repayments of long-term debt(1,271)(2,491)(1,532)Repurchases of common stock(7,951)(6,696)(14,809)Proceeds from sales of common stock323 264 337 Cash dividends(8,383)(7,789)(6,985)Other financing activities(156)(188)(145)Net cash used in financing activities(15,443)(10,993)(19,120)Change in cash and cash equivalents1,000 482 (5,518)Effect of exchange rate changes on cash and cash equivalents3 (68)(34)Cash and cash equivalents at beginning of year2,757 2,343 7,895 Cash and cash equivalents at end of year$3,760 $2,757 $2,343 Supplemental Disclosures:Cash paid for income taxes$5,023 $5,435 $5,504 Cash paid for interest, net of interest capitalized1,809 1,449 1,269 Non-cash capital expenditures364 351 421\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2023 2022 2021; Net earnings $ 15,143 $ 17,105 $ 16,433; Depreciation and amortization 3,247 2,975 2,862; Stock-based compensation expense 380 366 399; Changes in receivables, net 134 111 (435); Changes in merchandise inventories 4,137 (2,830) (5,403); Changes in other current assets (184) (311) (330); Changes in accounts payable and accrued expenses (1,411) (2,577) 2,401; Changes in deferred revenue (318) (526) 775; Changes in income taxes payable (25) (107) (51); Changes in deferred income taxes (245) 138 (276); Other operating activities 314 271 196; Net cash provided by operating activities 21,172 14,615 16,571; Capital expenditures (3,226) (3,119) (2,566); Payments for businesses acquired, net (1,514) — (421); Other investing activities 11 (21) 18; Net cash used in investing activities (4,729) (3,140) (2,969); (Repayments of) proceeds from short-term debt, net — (1,035) 1,035; Proceeds from long-term debt, net of discounts 1,995 6,942 2,979; Repayments of long-term debt (1,271) (2,491) (1,532); Repurchases of common stock (7,951) (6,696) (14,809); Proceeds from sales of common stock 323 264 337; Cash dividends (8,383) (7,789) (6,985); Other financing activities (156) (188) (145); Net cash used in financing activities (15,443) (10,993) (19,120); Change in cash and cash equivalents 1,000 482 (5,518); Effect of exchange rate changes on cash and cash equivalents 3 (68) (34); Cash and cash equivalents at beginning of year 2,757 2,343 7,895; Cash and cash equivalents at end of year $ 3,760 $ 2,757 $ 2,343; Cash paid for income taxes $ 5,023 $ 5,435 $ 5,504; Cash paid for interest, net of interest capitalized 1,809 1,449 1,269; Non-cash capital expenditures 364 351 421.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202320222021\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: Cash Flows from Operating Activities:\nTEXT: Reconciliation of net earnings to net cash provided by operating activities:\nTITLE: Cash Flows from Investing Activities:\nTITLE: Cash Flows from Financing Activities:\nTITLE: Supplemental Disclosures:\nTEXT: See accompanying notes to consolidated financial statements.\nTITLE: THE HOME DEPOT, INC.\nTITLE: SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nTITLE: Business\nTEXT: The Home Depot, Inc., together with its subsidiaries (the “Company,” “Home Depot,” “we,” “our” or “us”), is a home improvement retailer that sells a wide assortment of building materials, home improvement products, lawn and garden products, décor products, and facilities maintenance, repair and operations products, in stores and online. We also provide a number of services, including home improvement installation services and tool and equipment rental. We operate in the U.S. (including the Commonwealth of Puerto Rico and the territories of the U.S. Virgin Islands and Guam), Canada, and Mexico.\nTITLE: Consolidation and Presentation\nTEXT: Our consolidated financial statements include our accounts and those of our wholly-owned subsidiaries. Intercompany balances and transactions are eliminated in consolidation. Our fiscal year is a 52- or 53-week period ending on the Sunday nearest to January 31st. All periods presented include 52 weeks.\nTITLE: Use of Estimates\nTEXT: We have made a number of estimates and assumptions relating to the reporting of assets and liabilities, the disclosure of contingent assets and liabilities, and reported amounts of revenues and expenses in preparing these financial statements in conformity with GAAP. While we believe these estimates and assumptions are reasonable, actual results could differ from these estimates.\nTITLE: Cash and Cash Equivalents\nTEXT: Cash and cash equivalents consist of cash on hand and highly liquid investments purchased with original maturities of three months or less.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ninventory, receivables, value, cost, method, fiscal, losses, estimated, impairment, merchandise\n\nTITLE: Receivables, net\nTEXT: The following table presents components of receivables, net:\nTEXT: in millionsJanuary 28,2024January 29,2023Card receivables$988 $1,003 Rebate receivables841 948 Customer receivables924 871 Other receivables575 495 Receivables, net$3,328 $3,317\nTABLE: TABLE: in millions January 28,2024 January 29,2023; Card receivables $ 988 $ 1,003; Rebate receivables 841 948; Customer receivables 924 871; Other receivables 575 495; Receivables, net $ 3,328 $ 3,317.\nTITLE: in millionsJanuary 28,2024January 29,2023\nTITLE: in millions\nTITLE: January 28,2024\nTITLE: January 29,2023\nTEXT: Card receivables consist of payments due from financial institutions for the settlement of credit card and debit card transactions. Rebate receivables represent amounts due from vendors for volume and co-op advertising rebates. Customer receivables relate to credit extended directly to certain customers in the ordinary course of business. The valuation allowance related to these receivables was not material to our consolidated financial statements at the end of fiscal 2023 or fiscal 2022.\nTITLE: Merchandise Inventories\nTEXT: Inventory cost includes the amount we pay to acquire inventory, including freight and import costs, as well as operating costs and depreciation associated with our sourcing and distribution network, and is net of certain vendor allowances. The majority of our merchandise inventories are stated at the lower of cost or market, as determined by the retail inventory method, which is based on a number of factors such as markups, markdowns, and inventory losses (or shrink). As the inventory retail value is adjusted regularly to reflect market conditions, inventory valued using the retail method approximates the lower of cost or market. Certain subsidiaries, including retail operations in Canada and Mexico, and distribution centers, record merchandise inventories at the lower of cost or net realizable value, as determined by a cost method, primarily the first-in, first-out method. These merchandise inventories represent approximately 38% of the total merchandise inventories balance. We evaluate the inventory valued using a cost method at the end of each quarter to ensure that it is carried at the lower of cost or net realizable value, and the adjustments recorded to merchandise inventories valued under a cost method were not material to our consolidated financial statements at the end of fiscal 2023 or fiscal 2022.\nTEXT: Physical inventory counts or cycle counts are taken on a regular basis in each store and distribution center to ensure that amounts reflected in merchandise inventories are properly stated. Shrink (or in the case of excess inventory, swell) is the difference between the recorded amount of inventory and the physical inventory count. We calculate shrink based on actual inventory losses identified as a result of physical inventory counts during each fiscal period and estimated inventory losses between physical inventory counts. The estimate for shrink occurring in the interim period between physical inventory counts is calculated on a store-specific basis and is primarily based on recent shrink results. Historically, the difference between estimated shrink and actual inventory losses has not been material to our annual financial results.\nTITLE: Property and Equipment\nTEXT: Buildings and related improvements, furniture, fixtures, and equipment are recorded at cost and depreciated using the straight-line method over their estimated useful lives. Leasehold improvements and assets held under finance leases are amortized using the straight-line method over the original term of the lease or the useful life of the asset, whichever is shorter.\nTEXT: The following table presents the estimated useful lives of our property and equipment:\nTITLE: LifeBuildings and improvements5 – 45 yearsFurniture, fixtures and equipment2 – 20 yearsLeasehold improvements5 – 45 years\nTABLE: TABLE: Buildings and improvements 5 – 45 years; Furniture, fixtures and equipment 2 – 20 years; Leasehold improvements 5 – 45 years.\nTITLE: LifeBuildings and improvements5 – 45 yearsFurniture, fixtures and equipment2 – 20 yearsLeasehold improvements5 – 45 years\nTITLE: Life\nTEXT: We capitalize certain costs, including interest, related to construction in progress and the acquisition and development of software. Costs associated with the acquisition and development of software are amortized using the straight-line method over the estimated useful life of the software, which ranges from three to seven years. Certain development costs not meeting the criteria for capitalization are expensed as incurred.\nTEXT: We evaluate our long-lived assets each quarter for indicators of potential impairment. Indicators of impairment include current period losses combined with a history of losses, our decision to relocate or close a store or other location before the end of its previously estimated useful life, or when changes in other circumstances indicate the carrying amount of an asset group may not be recoverable. The evaluation for long-lived assets is performed at the lowest level of identifiable cash flows, which is generally the individual store level. Long-lived assets with indicators of impairment are evaluated for recoverability by comparing their undiscounted future cash flows with their carrying value. If the carrying value is greater than the undiscounted future cash flows, we then measure the asset group’s fair value to determine whether an impairment loss should be recognized. If the resulting fair value is less than the carrying value, an impairment loss is recognized for the difference between the carrying value and the estimated fair value. Impairment losses on property and equipment are recorded as a component of SG&A. Impairment charges for long-lived assets were not material to our consolidated financial statements in fiscal 2023, fiscal 2022, or fiscal 2021.\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nlease, value, goodwill, rate, payments, certain, term, leases, fair, assets\n\nTITLE: Leases\nTEXT: We enter into contractual arrangements for the utilization of certain non-owned assets which are evaluated as finance or operating leases upon commencement, and are accounted for accordingly. Specifically, a contract is or contains a lease when (1) the contract contains an explicitly or implicitly identified asset and (2) we obtain substantially all of the economic benefits from the use of that underlying asset and direct how and for what purpose the asset is used during the term of the contract in exchange for consideration. We assess whether an arrangement is or contains a lease at inception of the contract.\nTEXT: Our leases include certain retail locations, warehouse and distribution space, office space, equipment, and vehicles. A substantial majority of our leases have remaining lease terms of one to 20 years. Our real estate leases typically provide the option to extend the lease for five-year terms, and some of our leases include early termination options. The lease term used to calculate the right-of-use asset and lease liability at commencement includes the impacts of options to extend or terminate the lease when it is reasonably certain that we will exercise that option. When determining whether it is reasonably certain that we will exercise an option at commencement, we consider various existing economic factors, including market conditions, real estate strategies, the nature, length, and terms of the agreement, as well as the uncertainty of the condition of leased equipment at the end of the lease term. Based on these determinations, we generally conclude that the exercise of renewal options would not be reasonably certain in determining the lease term at commencement.\nTEXT: The discount rate used to calculate the present value of lease payments is the rate implicit in the lease, when readily determinable. As the rate implicit in the lease is rarely readily determinable, we use a secured incremental borrowing rate, which is updated on a quarterly basis, as the discount rate for the present value of lease payments.\nTEXT: Real estate taxes, insurance, maintenance, and operating expenses applicable to the leased asset are generally our obligations under our lease agreements. In instances where these payments are fixed, they are included in the measurement of our lease liabilities, and when variable, they are excluded and recognized in the period in which the obligation for those payments is incurred. Certain of our lease agreements also include rental payments based on an index or rate, and others include rental payments based on a percentage of sales. For variable payments dependent upon an index or rate, we apply the active index or rate as of the lease commencement date. Variable lease payments not based on an index or rate are not included in the measurement of our lease liabilities, as they cannot be reasonably estimated, and are recognized in the period in which the obligation for those payments is incurred.\nTEXT: Leases that have a term of twelve months or less upon commencement are considered short-term in nature. Short-term leases are not included on the consolidated balance sheets and are expensed on a straight-line basis over the lease term. We have also elected to not separate lease and non-lease components for certain classes of assets including real estate and certain equipment.\nTEXT: Our lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nTITLE: Business Combinations\nTEXT: The assets and liabilities of acquired businesses are recorded at their fair values at the date of acquisition. The excess of the purchase price over the fair values of the identifiable assets acquired and liabilities assumed is recorded as goodwill. During the measurement period, which is up to one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill. Upon conclusion of the measurement period, any subsequent adjustments are recorded to earnings.\nTITLE: Goodwill\nTEXT: Goodwill represents the excess of purchase price over the fair value of net assets acquired. We do not amortize goodwill, but assess the recoverability of goodwill in the third quarter of each fiscal year, or more often if indicators warrant, by determining whether the fair value of each reporting unit supports its carrying value. Each fiscal year, we may assess qualitative factors to determine whether it is more likely than not that the fair value of each reporting unit is less than its carrying amount as a basis for determining whether it is necessary to complete quantitative impairment assessments, with a quantitative assessment completed periodically or as facts and circumstances warrant.\nTEXT: During the third quarter of fiscal 2023, we completed our annual assessment of the recoverability of goodwill for our U.S., Canada, and Mexico reporting units, using a quantitative approach. The quantitative test for goodwill impairment was performed by determining the fair value of the reporting units using a combination of discounted cash flow and market-based approaches. The results of our quantitative analysis indicated that the fair value of each of the reporting units substantially exceeded its respective carrying value, including goodwill. There were no impairment charges related to goodwill for fiscal 2023, fiscal 2022, or fiscal 2021. Additional information regarding our goodwill is included in Note 4.\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nassets, payment, suppliers, derivative, instruments, intangible, program, financial, consolidated, balance\n\nTITLE: Other Intangible Assets\nTEXT: Intangible assets other than goodwill are included in other assets on the consolidated balance sheets. We amortize the cost of definite-lived intangible assets on a straight-line basis over their estimated useful lives, which range up to approximately 20 years, as this approximates the pattern of expected economic benefit. We evaluate our definite-lived intangible assets for impairment when evidence exists that certain triggering events or changes in circumstances indicate that the carrying amount of these assets may not be recoverable. Intangible assets with indefinite lives are tested in the third quarter of each fiscal year for impairment, or more often if indicators warrant.\nTEXT: During the third quarter of fiscal 2023, we completed our annual assessment of the recoverability of our indefinite-lived intangible assets based on quantitative factors and concluded no impairment losses should be recognized. There were no impairment losses related to intangible assets for fiscal 2023, fiscal 2022, or fiscal 2021. Additional information regarding our intangible assets is included in Note 4.\nTITLE: Supplier Finance Programs\nTEXT: We have a supplier finance program whereby we have entered into payment processing agreements with several financial institutions. Under these agreements, the financial institutions act as our paying agents with respect to accounts payable due to certain suppliers. Participating suppliers may, at their sole discretion, elect to receive payment for one or more of our payment obligations, prior to their scheduled due dates, at a discounted price from participating financial institutions. We are not a party to the agreements between the participating financial institutions and the suppliers in connection with the program, and our rights and obligations to our suppliers are not impacted. We do not reimburse suppliers for any costs they incur for participation in the program. We have not pledged any assets as security or provided any guarantees as part of the program. We have no economic interest in our suppliers’ decisions to participate in the program. Our responsibility is limited to making payment to the respective financial institution according to the terms originally negotiated with the supplier, regardless of whether the supplier elects to receive early payment from the financial institution.\nTEXT: The payment terms we negotiate with our suppliers are consistent, irrespective of whether a supplier participates in the program. Our current payment terms with a majority of our suppliers generally range from 30 to 60 days, which we deem to be commercially reasonable. Our outstanding payment obligations under our supplier finance program were $514 million at January 28, 2024, and $480 million at January 29, 2023 and are recorded within accounts payable on the consolidated balance sheets. The associated payments are included in operating activities within the consolidated statements of cash flows.\nTITLE: Debt\nTEXT: We record any premiums or discounts associated with an issuance of long-term debt as a direct addition or deduction to the carrying value of the related senior notes. We also record debt issuance costs associated with an issuance of long-term debt as a direct deduction to the carrying value of the related senior notes. Premium, discount, and debt issuance costs are amortized over the term of the respective notes using the effective interest rate method.\nTITLE: Derivative Instruments and Hedging Activities\nTEXT: We use derivative instruments in the management of our interest rate exposure on long-term debt and our exposure to foreign currency fluctuations. We enter into derivative instruments for risk management purposes only; we do not enter into derivative instruments for trading or speculative purposes. All derivative instruments are recognized at their fair values in either assets or liabilities at the balance sheet date and are classified as either current or non-current based on each contract’s respective maturity. While we enter into master netting arrangements, our policy is to present the fair value of derivative instruments on a gross basis in our consolidated balance sheets.\nTEXT: Changes in the fair values for derivative instruments designated as cash flow or net investment hedges are recognized in accumulated other comprehensive income (loss) until the hedged item is recognized in earnings, which for net investment hedges is upon sale or substantial liquidation of the underlying net investment. Changes in fair value of outstanding fair value hedges and the offsetting changes in fair values of the hedged item are recognized in earnings. We record realized gains and losses from derivative instruments in the same financial statement line item as the hedged item.\nTEXT: Cash flows from the settlement of derivative instruments appear in the consolidated statements of cash flows in the same categories as the cash flows of the hedged item.\nTITLE: Self-Insurance Reserves\nTEXT: We are self-insured for certain losses related to general liability (including product liability), workers’ compensation, employee group medical, and automobile claims. We recognize the expected ultimate cost for claims incurred (undiscounted) at the balance sheet date as a liability. The expected ultimate cost for claims incurred is estimated based upon analysis of historical data and actuarial estimates. We also maintain cybersecurity and privacy liability insurance coverage to help limit our exposure to losses such as those that may be caused by a significant compromise or breach of our data security, as well as property loss coverage. Our self-insurance liabilities, which are included in accrued salaries and related expenses, other accrued expenses, and other long-term liabilities in the consolidated balance sheets, were $1.4 billion at January 28, 2024, and $1.3 billion at January 29, 2023.\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncost, revenue, sales, service, costs, services, allowances, advertising, when, programs\n\nTITLE: Treasury Stock\nTEXT: Treasury stock is reflected as a reduction of stockholders’ equity at cost. We use the weighted average purchase cost to determine the cost of treasury stock that is reissued, if any. Excise taxes incurred on share repurchases represent direct costs of the repurchase and are recorded as a part of the cost basis of the shares within treasury stock.\nTITLE: Revenue Recognition\nTEXT: We recognize revenue, net of expected returns and sales tax, at the time the customer takes possession of merchandise or when a service is performed. Our liability for sales returns is estimated based on historical return levels and our expectation of future returns. We also recognize a return asset, and corresponding adjustment to cost of sales, for our right to recover the goods returned by the customer, measured at the former carrying amount of the goods, less any expected recovery cost. At each financial reporting date, we assess our estimates of expected returns, refund liabilities, and return assets.\nTEXT: Services revenue is generated through a variety of installation, home maintenance, and professional service programs. In these programs, the customer selects and purchases material for a project, and we provide or arrange for professional installation. These programs are offered through our stores, online, and in-home sales programs. Under certain programs, when we provide or arrange for the installation of a project and the subcontractor provides material as part of the installation, both the material and labor are included in services revenue. We recognize services revenue when the service for the customer is complete, which is not materially different from recognizing the revenue over the service period as the substantial majority of our services are completed within one week.\nTEXT: For products and services sold in stores or online, payment is typically due at the point of sale. When we receive payment before the customer has taken possession of the merchandise or the service has been performed, the amount received is recorded as deferred revenue until the sale or service is complete. Such performance obligations are part of contracts with expected original durations of typically three months or less. As of January 28, 2024 and January 29, 2023, deferred revenue for products and services was $1.7 billion and $2.0 billion, respectively.\nTEXT: We further record deferred revenue for the sale of gift cards and recognize the associated revenue upon the redemption of those gift cards, which generally occurs within six months of gift card issuance. As of both January 28, 2024 and January 29, 2023, our performance obligations for unredeemed gift cards were $1.1 billion. Gift card breakage income, which is our estimate of the portion of our outstanding gift card balance not expected to be redeemed, is recognized in net sales and was immaterial in fiscal 2023, fiscal 2022, and fiscal 2021.\nTEXT: We also have agreements with third-party service providers who directly extend credit to customers, manage our PLCC program, and own the related receivables. We have evaluated the third-party entities holding the receivables under the program and concluded that they should not be consolidated. The agreement with the primary third-party service provider for our PLCC program expires in 2028, with us having the option, but no obligation, to purchase the existing receivables at the end of the agreement. Deferred interest charges incurred for our deferred financing programs offered to these customers, interchange fees charged to us for their use of the cards, and any profit sharing with the third-party service providers are included in net sales.\nTITLE: Cost of Sales\nTEXT: Cost of sales includes the actual cost of merchandise sold and services performed; the cost of transportation of merchandise from vendors to our distribution network, stores, or customers; shipping and handling costs from our stores or distribution network to customers; and the operating cost and depreciation of our sourcing and distribution network. Vendor allowances that are not reimbursements of specific, incremental, and identifiable costs are also included within cost of sales.\nTITLE: Vendor Allowances\nTEXT: Vendor allowances primarily consist of volume rebates that are earned as a result of attaining certain purchase levels and co-op advertising allowances for the promotion of vendors’ products that are typically based on guaranteed minimum amounts with additional amounts being earned for attaining certain purchase levels. These vendor allowances are accrued as earned, with those allowances received as a result of attaining certain purchase levels accrued over the incentive period, which generally concludes at the end of the calendar year, based on estimates of purchases. Volume rebates and certain co-op advertising allowances reduce the carrying cost of inventory and are recognized in cost of sales when the related inventory is sold.\nTITLE: Selling, General and Administrative\nTEXT: Selling, general and administrative expenses include compensation and benefits for retail and store support center associates, occupancy and operating costs of retail locations and store support centers, insurance-related expenses, advertising costs, credit and debit card processing fees, and other administrative costs.\nTITLE: Advertising Expense\nTEXT: Advertising costs, including digital, television, radio and print, are expensed when the advertisement first appears. Certain co-op advertising allowances that are reimbursements of specific, incremental, and identifiable costs incurred to promote vendors’ products are recorded as an offset against advertising expense. Net advertising expense included in SG&A was $1.1 billion, $1.1 billion, and $1.0 billion for fiscal 2023, 2022, and 2021, respectively.\n"
    },
    {
      "cluster": 9,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, stock, recognized, earnings, deferred, based, period, other, certain, expense\n\nTITLE: Stock-Based Compensation\nTEXT: We are currently authorized to issue incentive and nonqualified stock options, stock appreciation rights, restricted stock, restricted stock units, performance shares, performance units, and deferred shares to certain of our associates and non-employee directors under certain stock incentive plans. We measure and recognize compensation expense for all stock-based payment awards made to associates and non-employee directors based on estimated fair values. The value of the portion of the award that is ultimately expected to vest is recognized as stock-based compensation expense, on a straight-line basis, over the requisite service period or as restrictions lapse. We include estimated forfeitures expected to occur when calculating stock-based compensation expense. Additional information on our stock-based payment awards is included in Note 9.\nTITLE: Income Taxes\nTEXT: Income taxes are accounted for under the asset and liability method. We provide for federal, state, and foreign income taxes currently payable, as well as for those deferred due to timing differences between reporting income and expenses for financial statement purposes versus tax purposes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted income tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect of a change in income tax rates is recognized as income or expense in the period that includes the enactment date. We routinely evaluate the likelihood of realizing the benefit of our deferred tax assets and may record a valuation allowance if, based on all available evidence, we determine that it is more likely than not that some portion of the tax benefit will not be realized.\nTEXT: We recognize the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs.\nTEXT: We recognize interest and penalties related to income tax matters in interest expense and SG&A, respectively, on our consolidated statements of earnings. Accrued interest and penalties related to income tax matters are recognized in other accrued expenses and other long-term liabilities on our consolidated balance sheets.\nTEXT: We file a consolidated U.S. federal income tax return which includes certain eligible subsidiaries. Non-U.S. subsidiaries and certain U.S. subsidiaries, which are consolidated for financial reporting purposes, are not eligible to be included in our consolidated U.S. federal income tax return. Separate provisions for income taxes have been determined for these entities. For unremitted earnings of our non-U.S. subsidiaries, we are required to make an assertion regarding reinvestment or repatriation for tax purposes. For any earnings that we do not make a permanent reinvestment assertion, we recognize a provision for deferred income taxes. For earnings where we have made a permanent reinvestment assertion, no provision is recognized. See Note 6 for further discussion.\nTEXT: We are subject to global intangible low-taxed income tax, an incremental tax on foreign income. We have made an accounting election to record this tax in the period the tax arises.\nTITLE: Comprehensive Income\nTEXT: Comprehensive income includes net earnings adjusted for certain gains and losses that are excluded from net earnings and recognized within accumulated other comprehensive loss as a component of equity, which consist primarily of foreign currency translation adjustments. Accumulated other comprehensive loss also includes net losses on cash flow hedges that were immaterial as of January 28, 2024 and January 29, 2023. Reclassifications from accumulated other comprehensive loss into earnings were immaterial in fiscal 2023, fiscal 2022, and fiscal 2021.\nTITLE: Foreign Currency Translation\nTEXT: Assets and liabilities denominated in a foreign currency are translated into U.S. dollars at the current rate of exchange on the last day of the reporting period. Revenues and expenses are translated using average exchange rates for the period, and equity transactions are translated using the actual rate on the day of the transaction. Cumulative foreign currency translation adjustments recorded in accumulated other comprehensive loss as of January 28, 2024 and January 29, 2023 were losses of $365 million and $597 million, respectively.\n"
    },
    {
      "cluster": 10,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ntopic, december, rate, financial, effective, which, reference, fiscal, beginning, disclosures\n\nTITLE: Recently Adopted Accounting Pronouncements\nTEXT: ASU No. 2022-04. In September 2022, the FASB issued ASU No. 2022-04, “Liabilities—Supplier Finance Programs (Topic 405-50): Disclosure of Supplier Finance Program Obligations,” to enhance the transparency of supplier finance programs used by an entity in connection with the purchase of goods and services. The standard requires entities that use supplier finance programs to disclose the key terms, including a description of payment terms, the confirmed amount outstanding under the program at the end of each reporting period, a description of where those obligations are presented on the balance sheet, and an annual rollforward, including the amount of obligations confirmed and the amount paid during the period. The guidance does not affect the recognition, measurement, or financial statement presentation of obligations covered by supplier finance programs. ASU No. 2022-04 was effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, except for the required rollforward information, which is effective for fiscal years beginning after December 15, 2023. On January 30, 2023, we adopted ASU No. 2022-04 with no impact to our consolidated financial condition, results of operations, or cash flows.\nTEXT: ASU No. 2020-04. In March 2020, the FASB issued ASU No. 2020-04, “Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting,” which provides practical expedients and exceptions for applying GAAP to contracts, hedging relationships, and other transactions affected by reference rate reform if certain criteria are met. The expedients and exceptions provided by the amendments in this update apply only to contracts, hedging relationships, and other transactions that reference LIBOR or another reference rate discontinued as a result of reference rate reform. ASU No. 2020-04 was effective as of March 12, 2020 and may be applied to contract modifications and hedging relationships from the beginning of an interim period that includes or is subsequent to March 12, 2020. This guidance was subsequently amended by ASU No. 2022-06, “Reference Rate Reform (Topic 848): Deferral of the Sunset Date of Topic 848,” which was effective upon issuance in December 2022 and extended the temporary relief provided by Topic 848 through December 31, 2024.\nTEXT: During the second quarter of fiscal 2023, we amended our existing fixed-to-variable interest rate swap agreements, which were designated as fair value hedges, to transition the variable component of such agreements from LIBOR to SOFR. Concurrent with these amendments, we elected certain of the optional expedients provided in Topic 848, which allow us to maintain our designation of fair value hedge accounting and application of the shortcut method for these agreements. The adoption of this guidance did not have a material impact on our consolidated financial condition, results of operations, or cash flows.\nTITLE: Recently Issued Accounting Pronouncements\nTEXT: ASU No. 2023-07. In November 2023, the FASB issued ASU No. 2023-07, “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures,” which is intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. The disclosure requirements included in ASU No. 2023-07 are required for all public entities, including entities with a single reportable segment. ASU No. 2023-07 is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, and early adoption is permitted. The guidance is required to be applied on a retrospective basis. We are currently evaluating the impact of the standard on our consolidated financial statement disclosures.\nTEXT: ASU No. 2023-09. In December 2023, the FASB issued ASU No. 2023-09, “Income Taxes (Topic 740): Improvements to Income Tax Disclosures,” which requires disclosure of disaggregated information about a reporting entity’s effective tax rate reconciliation as well as disclosures on income taxes paid by jurisdiction. ASU No. 2023-09 is effective for annual periods beginning after December 15, 2024. The guidance is required to be applied on a prospective basis, with the option to apply the standard retrospectively. Early adoption is permitted. We are currently evaluating the impact of the standard on our consolidated financial statement disclosures.\nTEXT: Recent accounting pronouncements adopted or pending adoption not discussed above are either not applicable or are not expected to have a material impact on our consolidated financial condition, results of operations, or cash flows.\nTITLE: 2.SEGMENT REPORTING AND NET SALES\n"
    },
    {
      "cluster": 11,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsales, following, table, presents, services, operating, property, equipment, related, garden\n\nTITLE: SEGMENT REPORTING AND NET SALES\nTEXT: We currently conduct our retail operations in the U.S., Canada, and Mexico, each of which represents one of our three operating segments. Our operating segments reflect the way in which internally-reported financial information is regularly reviewed by the chief operating decision maker, who is our President and Chief Executive Officer, to analyze performance, make decisions and allocate resources. For disclosure purposes, we aggregate these three operating segments into one reportable segment due to the similar nature of their operations and economic characteristics.\nTEXT: The following table presents net property and equipment, classified by geography:\nTEXT: in millionsJanuary 28,2024January 29,2023January 30,2022Net property and equipment – in the U.S.$23,347 $23,057 $22,696 Net property and equipment – outside the U.S.2,807 2,574 2,503 Net property and equipment$26,154 $25,631 $25,199\nTABLE: TABLE: in millions January 28,2024 January 29,2023 January 30,2022; Net property and equipment – in the U.S. $ 23,347 $ 23,057 $ 22,696; Net property and equipment – outside the U.S. 2,807 2,574 2,503; Net property and equipment $ 26,154 $ 25,631 $ 25,199.\nTITLE: in millionsJanuary 28,2024January 29,2023January 30,2022\nTITLE: in millions\nTITLE: January 28,2024\nTITLE: January 29,2023\nTITLE: January 30,2022\nTEXT: No sales to an individual customer accounted for more than 10% of revenue during any of the last three fiscal years.\nTEXT: The following table presents net sales, classified by geography:\nTEXT: FiscalFiscalFiscalin millions202320222021Net sales – in the U.S.$140,083 $144,840 $138,920 Net sales – outside the U.S.12,586 12,563 12,237 Net sales$152,669 $157,403 $151,157\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2023 2022 2021; Net sales – in the U.S. $ 140,083 $ 144,840 $ 138,920; Net sales – outside the U.S. 12,586 12,563 12,237; Net sales $ 152,669 $ 157,403 $ 151,157.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202320222021\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: The following table presents net sales by products and services:\nTEXT: FiscalFiscalFiscalin millions202320222021Net sales – products $146,835 $151,804 $145,745 Net sales – services 5,834 5,599 5,412 Net sales$152,669 $157,403 $151,157\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2023 2022 2021; Net sales – products $ 146,835 $ 151,804 $ 145,745; Net sales – services 5,834 5,599 5,412; Net sales $ 152,669 $ 157,403 $ 151,157.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202320222021\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: The following table presents major product lines and the related merchandising departments (and related services):\nTEXT: Major Product LineMerchandising DepartmentsBuilding MaterialsBuilding Materials, Electrical/Lighting, Lumber, Millwork, and PlumbingDécorAppliances, Décor/Storage, Flooring, Kitchen and Bath, and PaintHardlinesHardware, Indoor Garden, Outdoor Garden, and Tools\nTABLE: TABLE: Major Product Line Merchandising Departments; Building Materials Building Materials, Electrical/Lighting, Lumber, Millwork, and Plumbing; Décor Appliances, Décor/Storage, Flooring, Kitchen and Bath, and Paint; Hardlines Hardware, Indoor Garden, Outdoor Garden, and Tools.\nTITLE: Major Product LineMerchandising Departments\nTITLE: Major Product Line\nTITLE: Merchandising Departments\nTEXT: The following table presents net sales by major product line (and related services):\nTEXT: FiscalFiscalFiscalin millions202320222021Building Materials$57,039 $59,533 $54,990 Décor50,295 52,322 50,437 Hardlines45,335 45,548 45,730 Net sales$152,669 $157,403 $151,157\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2023 2022 2021; Building Materials $ 57,039 $ 59,533 $ 54,990; Décor 50,295 52,322 50,437; Hardlines 45,335 45,548 45,730; Net sales $ 152,669 $ 157,403 $ 151,157.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202320222021\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: The following table presents net sales by merchandising department (and related services):\nTEXT: FiscalFiscalFiscal202320222021dollars in millionsNetSales% of Net SalesNetSales% of Net SalesNetSales% of Net SalesAppliances$13,863 9.1 %$14,461 9.2 %$14,232 9.4 %Building Materials11,975 7.8 11,298 7.2 9,823 6.5 Décor/Storage6,012 3.9 6,357 4.0 6,095 4.0 Electrical/Lighting12,521 8.2 13,746 8.7 13,473 8.9 Flooring8,754 5.7 9,222 5.9 9,225 6.1 Hardware8,147 5.3 8,104 5.1 7,873 5.2 Indoor Garden14,743 9.7 14,990 9.5 15,546 10.3 Kitchen and Bath10,593 6.9 11,102 7.1 10,432 6.9 Lumber11,731 7.7 13,460 8.6 13,344 8.8 Millwork8,301 5.4 8,423 5.4 7,412 4.9 Outdoor Garden10,278 6.7 10,078 6.4 10,317 6.8 Paint11,073 7.3 11,180 7.1 10,453 6.9 Plumbing12,511 8.2 12,606 8.0 10,938 7.2 Tools12,167 8.0 12,376 7.9 11,994 7.9 Total$152,669 100.0 %$157,403 100.0 %$151,157 100.0 %\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2023 2022 2021; dollars in millions NetSales % of Net Sales NetSales % of Net Sales NetSales % of Net Sales; Appliances $ 13,863 9.1 % $ 14,461 9.2 % $ 14,232 9.4 %; Building Materials 11,975 7.8 11,298 7.2 9,823 6.5; Décor/Storage 6,012 3.9 6,357 4.0 6,095 4.0; Electrical/Lighting 12,521 8.2 13,746 8.7 13,473 8.9; Flooring 8,754 5.7 9,222 5.9 9,225 6.1; Hardware 8,147 5.3 8,104 5.1 7,873 5.2; Indoor Garden 14,743 9.7 14,990 9.5 15,546 10.3; Kitchen and Bath 10,593 6.9 11,102 7.1 10,432 6.9; Lumber 11,731 7.7 13,460 8.6 13,344 8.8; Millwork 8,301 5.4 8,423 5.4 7,412 4.9; Outdoor Garden 10,278 6.7 10,078 6.4 10,317 6.8; Paint 11,073 7.3 11,180 7.1 10,453 6.9; Plumbing 12,511 8.2 12,606 8.0 10,938 7.2; Tools 12,167 8.0 12,376 7.9 11,994 7.9; Total $ 152,669 100.0 % $ 157,403 100.0 % $ 151,157 100.0 %.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: dollars in millionsNetSales% of Net SalesNetSales% of Net SalesNetSales% of Net Sales\nTITLE: dollars in millions\nTITLE: NetSales\n"
    },
    {
      "cluster": 12,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nlease, finance, operating, january, leases, cost, amortization, term, following, table\n\nTITLE: % of Net Sales\nTITLE: NetSales\nTITLE: % of Net Sales\nTITLE: NetSales\nTITLE: % of Net Sales\nTEXT: Note: Certain percentages may not sum to totals due to rounding.\nTITLE: 3.PROPERTY AND LEASES\nTITLE: PROPERTY AND LEASES\nTITLE: Net Property and Equipment\nTEXT: The following table presents components of net property and equipment:\nTEXT: in millionsJanuary 28,2024January 29,2023Land$9,027 $8,719 Buildings and improvements20,030 19,430 Furniture, fixtures, and equipment16,667 16,564 Leasehold improvements2,254 2,130 Construction in progress1,192 1,297 Finance leases4,087 4,135 Property and equipment, at cost53,257 52,275 Less accumulated depreciation and finance lease amortization27,103 26,644 Net property and equipment$26,154 $25,631\nTABLE: TABLE: in millions January 28,2024 January 29,2023; Land $ 9,027 $ 8,719; Buildings and improvements 20,030 19,430; Furniture, fixtures, and equipment 16,667 16,564; Leasehold improvements 2,254 2,130; Construction in progress 1,192 1,297; Finance leases 4,087 4,135; Property and equipment, at cost 53,257 52,275; Less accumulated depreciation and finance lease amortization 27,103 26,644; Net property and equipment $ 26,154 $ 25,631.\nTITLE: in millionsJanuary 28,2024January 29,2023\nTITLE: in millions\nTITLE: January 28,2024\nTITLE: January 29,2023\nTEXT: The following table presents depreciation and finance lease amortization expense, including depreciation and finance lease amortization expense included in cost of sales:\nTITLE: in millionsFiscalFiscalFiscal202320222021Depreciation and finance lease amortization expense$3,020 $2,756 $2,650\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Depreciation and finance lease amortization expense $ 3,020 $ 2,756 $ 2,650.\nTITLE: in millionsFiscalFiscalFiscal202320222021Depreciation and finance lease amortization expense$3,020 $2,756 $2,650\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: Leases\nTEXT: The following table presents the consolidated balance sheet classification related to operating and finance leases:\nTEXT: in millionsConsolidated Balance Sheet ClassificationJanuary 28,2024January 29,2023Assets:Operating lease assetsOperating lease right-of-use assets$7,884 $6,941 Finance lease assets (1)Net property and equipment2,840 2,899 Total lease assets$10,724 $9,840 Liabilities:Current: Operating lease liabilitiesCurrent operating lease liabilities$1,050 $945 Finance lease liabilitiesCurrent installments of long-term debt268 231 Long-term: Operating lease liabilitiesLong-term operating lease liabilities7,082 6,226 Finance lease liabilitiesLong-term debt, excluding current installments3,000 3,054 Total lease liabilities$11,400 $10,456\nTABLE: TABLE: in millions Consolidated Balance Sheet Classification January 28,2024 January 29,2023; Operating lease assets Operating lease right-of-use assets $ 7,884 $ 6,941; Finance lease assets (1) Net property and equipment 2,840 2,899; Total lease assets $ 10,724 $ 9,840; Operating lease liabilities Current operating lease liabilities $ 1,050 $ 945; Finance lease liabilities Current installments of long-term debt 268 231; Operating lease liabilities Long-term operating lease liabilities 7,082 6,226; Finance lease liabilities Long-term debt, excluding current installments 3,000 3,054; Total lease liabilities $ 11,400 $ 10,456.\nTITLE: in millionsConsolidated Balance Sheet ClassificationJanuary 28,2024January 29,2023\nTITLE: in millions\nTITLE: Consolidated Balance Sheet Classification\nTITLE: January 28,2024\nTITLE: January 29,2023\nTITLE: Assets:\nTITLE: Liabilities:\nTEXT: (1) Finance lease assets are recorded net of accumulated amortization of $1.2 billion as of both January 28, 2024 and January 29, 2023.\nTEXT: The following table presents components of lease cost, excluding short-term lease cost and sublease income which are immaterial:\nTEXT: Consolidated Statement of Earnings Classification (1)FiscalFiscalFiscalin millions202320222021Operating lease costSelling, general and administrative$1,359 $1,169 $1,084 Finance lease cost:Amortization of leased assetsDepreciation and amortization304 282 250 Interest on lease liabilitiesInterest expense126 125 127 Variable lease costSelling, general and administrative486 470 425\nTABLE: TABLE: Consolidated Statement of Earnings Classification (1) Fiscal Fiscal Fiscal; in millions 2023 2022 2021; Operating lease cost Selling, general and administrative $ 1,359 $ 1,169 $ 1,084; Amortization of leased assets Depreciation and amortization 304 282 250; Interest on lease liabilities Interest expense 126 125 127; Variable lease cost Selling, general and administrative 486 470 425.\nTITLE: Consolidated Statement of Earnings Classification (1)FiscalFiscalFiscal\nTITLE: Consolidated Statement of Earnings Classification (1)\nTITLE: Fiscal\nTITLE: in millions202320222021\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: (1)Costs associated with our sourcing and distribution network are recorded in cost of sales, with the exception of interest on finance lease liabilities.\nTEXT: The following table presents weighted average remaining lease terms and discount rates:\nTEXT: January 28,2024January 29,2023Weighted Average Remaining Lease Term (Years):Operating leases109Finance leases1314Weighted Average Discount Rate:Operating leases3.7 %3.2 %Finance leases3.7 %4.3 %\nTABLE: TABLE: January 28,2024 January 29,2023; Operating leases 10 9; Finance leases 13 14; Operating leases 3.7 % 3.2 %; Finance leases 3.7 % 4.3 %.\nTITLE: January 28,2024January 29,2023\nTITLE: January 28,2024\nTITLE: January 29,2023\nTITLE: Weighted Average Remaining Lease Term (Years):\n"
    },
    {
      "cluster": 13,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, assets, lease, intangible, leases, cash, following, table, presents, operating\n\nTITLE: Weighted Average Discount Rate:\nTEXT: The following table presents approximate future minimum payments under operating and finance leases at January 28, 2024:\nTEXT: in millionsOperatingLeasesFinanceLeasesFiscal 2024$1,325 $381 Fiscal 20251,342 456 Fiscal 20261,191 347 Fiscal 20271,041 323 Fiscal 2028884 287 Thereafter4,288 2,251 Total lease payments10,071 4,045 Less: imputed interest1,939 777 Present value of lease liabilities$8,132 $3,268\nTABLE: TABLE: in millions OperatingLeases FinanceLeases; Fiscal 2024 $ 1,325 $ 381; Fiscal 2025 1,342 456; Fiscal 2026 1,191 347; Fiscal 2027 1,041 323; Fiscal 2028 884 287; Thereafter 4,288 2,251; Total lease payments 10,071 4,045; Less: imputed interest 1,939 777; Present value of lease liabilities $ 8,132 $ 3,268.\nTITLE: in millionsOperatingLeasesFinanceLeases\nTITLE: in millions\nTITLE: OperatingLeases\nTITLE: FinanceLeases\nTEXT: Note: We have excluded approximately $450 million of lease payments (undiscounted basis) for leases that have been signed but have not yet commenced.\nTEXT: The following table presents supplemental cash flow information related to leases:\nTEXT: FiscalFiscalFiscalin millions202320222021Cash paid for amounts included in the measurement of lease liabilities:Operating cash flows – operating leases$1,328 $1,157 $1,090 Operating cash flows – finance leases126 125 127 Financing cash flows – finance leases271 241 182 Supplemental non-cash information: Lease assets obtained in exchange for new operating lease liabilities1,827 1,991 964 Lease assets obtained in exchange for new finance lease liabilities336 322 672\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2023 2022 2021; Operating cash flows – operating leases $ 1,328 $ 1,157 $ 1,090; Operating cash flows – finance leases 126 125 127; Financing cash flows – finance leases 271 241 182; Lease assets obtained in exchange for new operating lease liabilities 1,827 1,991 964; Lease assets obtained in exchange for new finance lease liabilities 336 322 672.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202320222021\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: 4.GOODWILL AND INTANGIBLE ASSETS\nTITLE: GOODWILL AND INTANGIBLE ASSETS\nTITLE: Goodwill\nTEXT: The following table presents the changes in the carrying amount of our goodwill:\nTEXT: FiscalFiscalin millions20232022Goodwill, balance at beginning of year$7,444 $7,449 Acquisitions (1)998 — Other (2)13 (5)Goodwill, balance at end of year$8,455 $7,444\nTABLE: TABLE: Fiscal Fiscal; in millions 2023 2022; Goodwill, balance at beginning of year $ 7,444 $ 7,449; Acquisitions (1) 998 —; Other (2) 13 (5); Goodwill, balance at end of year $ 8,455 $ 7,444.\nTITLE: FiscalFiscal\nTITLE: Fiscal\nTITLE: in millions20232022\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTEXT: (1) Fiscal 2023 includes the preliminary determination of goodwill related to acquisitions completed within the year. See Note 13 for further details.\nTEXT: (2) Reflects the net impact of foreign currency translation.\nTITLE: Intangible Assets\nTEXT: The following table presents information regarding our intangible assets, which are included in other assets on the consolidated balance sheets:\nTEXT: January 28, 2024 (1)January 29, 2023in millionsGross Carrying AmountAccumulated AmortizationNet Carrying AmountGross Carrying AmountAccumulated AmortizationNet Carrying AmountDefinite-Lived Intangible Assets:Customer relationships$3,425 $(670)$2,755 $3,034 $(495)$2,539 Trade names227 (25)202 151 (16)135 Other12 (12)— 12 (12)— Indefinite-Lived Intangible Assets:Trade names649 649 649 649 Total Intangible Assets$4,313 $(707)$3,606 $3,846 $(523)$3,323\nTABLE: TABLE: January 28, 2024 (1) January 29, 2023; in millions Gross Carrying Amount Accumulated Amortization Net Carrying Amount Gross Carrying Amount Accumulated Amortization Net Carrying Amount; Customer relationships $ 3,425 $ (670) $ 2,755 $ 3,034 $ (495) $ 2,539; Trade names 227 (25) 202 151 (16) 135; Other 12 (12) — 12 (12) —; Trade names 649 649 649 649; Total Intangible Assets $ 4,313 $ (707) $ 3,606 $ 3,846 $ (523) $ 3,323.\nTITLE: January 28, 2024 (1)January 29, 2023\nTITLE: January 28, 2024 (1)\nTITLE: January 29, 2023\nTITLE: in millionsGross Carrying AmountAccumulated AmortizationNet Carrying AmountGross Carrying AmountAccumulated AmortizationNet Carrying Amount\nTITLE: in millions\nTITLE: Gross Carrying Amount\nTITLE: Accumulated Amortization\nTITLE: Net Carrying Amount\nTITLE: Gross Carrying Amount\nTITLE: Accumulated Amortization\nTITLE: Net Carrying Amount\nTEXT: (1) Includes the preliminary allocation of fair value to intangible assets related to acquisitions completed within fiscal 2023. See Note 13 for further details.\nTEXT: Our intangible asset amortization expense was immaterial for fiscal 2023, fiscal 2022, and fiscal 2021.\nTEXT: The following table presents the estimated future amortization expense related to definite-lived intangible assets as of January 28, 2024:\nTITLE: in millionsAmortization ExpenseFiscal 2024$207 Fiscal 2025207 Fiscal 2026207 Fiscal 2027198 Fiscal 2028181 Thereafter1,957 Total$2,957\nTABLE: TABLE: in millions Amortization Expense; Fiscal 2024 $ 207; Fiscal 2025 207; Fiscal 2026 207; Fiscal 2027 198; Fiscal 2028 181; Thereafter 1,957; Total $ 2,957.\nTITLE: in millionsAmortization ExpenseFiscal 2024$207 Fiscal 2025207 Fiscal 2026207 Fiscal 2027198 Fiscal 2028181 Thereafter1,957 Total$2,957\nTITLE: in millionsAmortization Expense\nTITLE: in millions\nTITLE: Amortization Expense\nTITLE: 5.DEBT AND DERIVATIVE INSTRUMENTS\nTITLE: DEBT AND DERIVATIVE INSTRUMENTS\n"
    },
    {
      "cluster": 14,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nprogram, borrowings, july, credit, fiscal, commercial, paper, facility, scheduled, expire\n\nTITLE: Short-Term Debt\nTEXT: We have a commercial paper program that allows for borrowings up to $5.0 billion. In connection with our program, we have back-up credit facilities with a consortium of banks for borrowings up to $5.0 billion, which consist of a five-year $3.5 billion credit facility scheduled to expire in July 2027 and a 364-day $1.5 billion credit facility scheduled to expire in July 2024. In July 2023, we completed the renewal of our 364-day $1.5 billion credit facility, extending the maturity from July 2023 to July 2024. All of our short-term borrowings in fiscal 2023 and fiscal 2022 were under our commercial paper program. At January 28, 2024 and January 29, 2023, there were no outstanding borrowings under this program.\nTEXT: The following table presents additional information on borrowings under our commercial paper program during fiscal 2023 and fiscal 2022:\nTITLE: FiscalFiscalin millions20232022Maximum amount outstanding during the period$1,453 $2,745 Average daily short-term borrowings72 269\nTABLE: TABLE: Fiscal Fiscal; in millions 2023 2022; Maximum amount outstanding during the period $ 1,453 $ 2,745; Average daily short-term borrowings 72 269.\nTITLE: FiscalFiscalin millions20232022Maximum amount outstanding during the period$1,453 $2,745 Average daily short-term borrowings72 269\nTITLE: FiscalFiscal\nTITLE: Fiscal\nTITLE: in millions20232022\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\n"
    },
    {
      "cluster": 15,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsenior, notes, semi, annually, april, september, long, term, debt, march\n\nTITLE: Long-Term Debt\nTEXT: The following table presents details of the components of our long-term debt:\nTEXT: Carrying Amount (1)in millionsInterestPayablePrincipalAmountJanuary 28,2024January 29,20232.70% Senior notes due April 2023Semi-annually$— $— $1,000 3.75% Senior notes due February 2024Semi-annually1,100 1,100 1,099 2.70% Senior notes due April 2025Semi-annually500 499 498 5.125% Senior notes due April 2025Semi-annually500 498 — 3.35% Senior notes due September 2025Semi-annually1,000 999 998 4.00% Senior notes due September 2025Semi-annually750 749 748 3.00% Senior notes due April 2026Semi-annually1,300 1,296 1,295 2.125% Senior notes due September 2026Semi-annually1,000 995 994 4.95% Senior notes due September 2026Semi-annually750 746 — 2.875% Senior notes due April 2027Semi-annually750 745 744 2.50% Senior notes due April 2027Semi-annually750 746 745 2.80% Senior notes due September 2027Semi-annually1,000 979 979 0.90% Senior notes due March 2028Semi-annually500 497 496 1.50% Senior notes due September 2028Semi-annually1,000 994 993 3.90% Senior notes due December 2028Semi-annually1,000 970 977 4.90% Senior notes due April 2029Semi-annually750 743 — 2.95% Senior notes due June 2029Semi-annually1,750 1,665 1,675 2.70% Senior notes due April 2030Semi-annually1,500 1,346 1,347 1.375% Senior notes due March 2031Semi-annually1,250 1,167 1,170 1.875% Senior notes due September 2031Semi-annually1,000 936 942 3.25% Senior notes due April 2032Semi-annually1,250 1,239 1,237 4.50% Senior notes due September 2032Semi-annually1,250 1,243 1,242 5.875% Senior notes due December 2036Semi-annually3,000 2,872 2,874 3.30% Senior notes due April 2040Semi-annually1,250 1,057 1,075 5.40% Senior notes due September 2040Semi-annually500 496 496 5.95% Senior notes due April 2041Semi-annually1,000 991 990 4.20% Senior notes due April 2043Semi-annually1,000 927 939 4.875% Senior notes due February 2044Semi-annually1,000 982 981 4.40% Senior notes due March 2045Semi-annually1,000 980 980 4.25% Senior notes due April 2046Semi-annually1,600 1,586 1,586 3.90% Senior notes due June 2047Semi-annually1,150 1,145 1,144 4.50% Senior notes due December 2048Semi-annually1,500 1,465 1,464 3.125% Senior notes due December 2049Semi-annually1,250 1,173 1,178 3.35% Senior notes due April 2050Semi-annually1,500 1,472 1,472 2.375% Senior notes due March 2051Semi-annually1,250 1,150 1,156 2.75% Senior notes due September 2051Semi-annually1,000 983 983 3.625% Senior notes due April 2052Semi-annually1,500 1,458 1,458 4.95% Senior notes due September 2052Semi-annually1,000 980 980 3.50% Senior notes due September 2056Semi-annually1,000 974 973 Total senior notes$42,150 $40,843 $39,908 Finance lease obligations; payable in varying installments through April 30, 2076$3,268 $3,285 Total long-term debt44,111 43,193 Less current installments of long-term debt1,368 1,231 Long-term debt, excluding current installments$42,743 $41,962\nTABLE: TABLE: in millions InterestPayable PrincipalAmount January 28,2024 January 29,2023; 2.70% Senior notes due April 2023 Semi-annually $ — $ — $ 1,000; 3.75% Senior notes due February 2024 Semi-annually 1,100 1,100 1,099; 2.70% Senior notes due April 2025 Semi-annually 500 499 498; 5.125% Senior notes due April 2025 Semi-annually 500 498 —; 3.35% Senior notes due September 2025 Semi-annually 1,000 999 998; 4.00% Senior notes due September 2025 Semi-annually 750 749 748; 3.00% Senior notes due April 2026 Semi-annually 1,300 1,296 1,295; 2.125% Senior notes due September 2026 Semi-annually 1,000 995 994; 4.95% Senior notes due September 2026 Semi-annually 750 746 —; 2.875% Senior notes due April 2027 Semi-annually 750 745 744; 2.50% Senior notes due April 2027 Semi-annually 750 746 745; 2.80% Senior notes due September 2027 Semi-annually 1,000 979 979; 0.90% Senior notes due March 2028 Semi-annually 500 497 496; 1.50% Senior notes due September 2028 Semi-annually 1,000 994 993; 3.90% Senior notes due December 2028 Semi-annually 1,000 970 977; 4.90% Senior notes due April 2029 Semi-annually 750 743 —; 2.95% Senior notes due June 2029 Semi-annually 1,750 1,665 1,675; 2.70% Senior notes due April 2030 Semi-annually 1,500 1,346 1,347; 1.375% Senior notes due March 2031 Semi-annually 1,250 1,167 1,170; 1.875% Senior notes due September 2031 Semi-annually 1,000 936 942; 3.25% Senior notes due April 2032 Semi-annually 1,250 1,239 1,237; 4.50% Senior notes due September 2032 Semi-annually 1,250 1,243 1,242; 5.875% Senior notes due December 2036 Semi-annually 3,000 2,872 2,874; 3.30% Senior notes due April 2040 Semi-annually 1,250 1,057 1,075; 5.40% Senior notes due September 2040 Semi-annually 500 496 496; 5.95% Senior notes due April 2041 Semi-annually 1,000 991 990; 4.20% Senior notes due April 2043 Semi-annually 1,000 927 939; 4.875% Senior notes due February 2044 Semi-annually 1,000 982 981; 4.40% Senior notes due March 2045 Semi-annually 1,000 980 980; 4.25% Senior notes due April 2046 Semi-annually 1,600 1,586 1,586; 3.90% Senior notes due June 2047 Semi-annually 1,150 1,145 1,144; 4.50% Senior notes due December 2048 Semi-annually 1,500 1,465 1,464; 3.125% Senior notes due December 2049 Semi-annually 1,250 1,173 1,178; 3.35% Senior notes due April 2050 Semi-annually 1,500 1,472 1,472; 2.375% Senior notes due March 2051 Semi-annually 1,250 1,150 1,156; 2.75% Senior notes due September 2051 Semi-annually 1,000 983 983; 3.625% Senior notes due April 2052 Semi-annually 1,500 1,458 1,458; 4.95% Senior notes due September 2052 Semi-annually 1,000 980 980; 3.50% Senior notes due September 2056 Semi-annually 1,000 974 973; Total senior notes $ 42,150 $ 40,843 $ 39,908; Finance lease obligations; payable in varying installments through April 30, 2076 $ 3,268 $ 3,285; Total long-term debt 44,111 43,193; Less current installments of long-term debt 1,368 1,231; Long-term debt, excluding current installments $ 42,743 $ 41,962.\nTITLE: Carrying Amount (1)\n"
    },
    {
      "cluster": 16,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nnotes, senior, april, september, redemption, interest, march, date, principal, december\n\nTITLE: in millionsInterestPayablePrincipalAmountJanuary 28,2024January 29,2023\nTITLE: in millions\nTITLE: InterestPayable\nTITLE: PrincipalAmount\nTITLE: January 28,2024\nTITLE: January 29,2023\nTEXT: 2.70% Senior notes due April 2023\nTEXT: 3.75% Senior notes due February 2024\nTEXT: 2.70% Senior notes due April 2025\nTEXT: 5.125% Senior notes due April 2025\nTEXT: 3.35% Senior notes due September 2025\nTEXT: 4.00% Senior notes due September 2025\nTEXT: 3.00% Senior notes due April 2026\nTEXT: 2.125% Senior notes due September 2026\nTEXT: 4.95% Senior notes due September 2026\nTEXT: 2.875% Senior notes due April 2027\nTEXT: 2.50% Senior notes due April 2027\nTEXT: 2.80% Senior notes due September 2027\nTEXT: 0.90% Senior notes due March 2028\nTEXT: 1.50% Senior notes due September 2028\nTEXT: 3.90% Senior notes due December 2028\nTEXT: 4.90% Senior notes due April 2029\nTEXT: 2.95% Senior notes due June 2029\nTEXT: 2.70% Senior notes due April 2030\nTEXT: 1.375% Senior notes due March 2031\nTEXT: 1.875% Senior notes due September 2031\nTEXT: 3.25% Senior notes due April 2032\nTEXT: 4.50% Senior notes due September 2032\nTEXT: 5.875% Senior notes due December 2036\nTEXT: 3.30% Senior notes due April 2040\nTEXT: 5.40% Senior notes due September 2040\nTEXT: 5.95% Senior notes due April 2041\nTEXT: 4.20% Senior notes due April 2043\nTEXT: 4.875% Senior notes due February 2044\nTEXT: 4.40% Senior notes due March 2045\nTEXT: 4.25% Senior notes due April 2046\nTEXT: 3.90% Senior notes due June 2047\nTEXT: 4.50% Senior notes due December 2048\nTEXT: 3.125% Senior notes due December 2049\nTEXT: 3.35% Senior notes due April 2050\nTEXT: 2.375% Senior notes due March 2051\nTEXT: 2.75% Senior notes due September 2051\nTEXT: 3.625% Senior notes due April 2052\nTEXT: 4.95% Senior notes due September 2052\nTEXT: 3.50% Senior notes due September 2056\nTEXT: (1) Includes unamortized discounts, premiums, debt issuance costs, and the effects of fair value hedges.\nTITLE: November 2023 Issuance. In November 2023, we issued three tranches of senior notes.\nTEXT: •The first tranche consisted of $500 million of 5.125% senior notes due April 30, 2025 at a discount of $0.3 million. Interest on these notes is due semi-annually on April 30 and October 30 of each year, beginning April 30, 2024.\nTEXT: •The second tranche consisted of $750 million of 4.95% senior notes due September 30, 2026 at a discount of $1.6 million. Interest on these notes is due semi-annually on March 30 and September 30 of each year, beginning March 30, 2024.\nTEXT: •The third tranche consisted of $750 million of 4.90% senior notes due April 15, 2029 at a discount of $3.4 million. Interest on these notes is due semi-annually on April 15 and October 15 of each year, beginning April 15, 2024.\nTEXT: •Issuance costs totaled $7 million.\nTITLE: Repayments. In April 2023, we repaid our $1.0 billion 2.70% senior notes at maturity.\nTEXT: Redemption. All of our senior notes may be redeemed by us at any time, in whole or in part, at the redemption price plus accrued interest up to the redemption date. With respect to the 5.875% 2036 notes and the 5.125% 2025 notes, the redemption price is equal to the greater of (1) 100% of the principal amount of the notes to be redeemed, or (2) the sum of the present values of the remaining scheduled payments of principal and interest on the notes to be redeemed that would be due after the related redemption date. With respect to all other notes, prior to the Par Call Date, as defined in the respective notes, the redemption price is equal to the greater of (1) 100% of the principal amount of the notes to be redeemed or (2) the sum of the present values of the remaining scheduled payments of principal and interest to the Par Call Date. On or after the Par Call Date, the redemption price is equal to 100% of the principal amount of the notes. Additionally, if a Change in Control Triggering Event occurs, as defined in the notes, holders of all such notes have the right to require us to redeem those notes at 101% of the aggregate principal amount of the notes plus accrued interest up to the redemption date.\nTEXT: The indentures governing the notes do not generally limit our ability to incur additional indebtedness or require us to maintain financial ratios or specified levels of net worth or liquidity. The indentures governing the notes contain various customary covenants; however, none are expected to impact our liquidity or capital resources.\nTITLE: Maturities of Long-Term Debt. The following table presents our long-term debt maturities, excluding finance leases, as of January 28, 2024:\nTITLE: in millionsPrincipalFiscal 2024$1,100 Fiscal 20252,750 Fiscal 20263,050 Fiscal 20272,500 Fiscal 20282,500 Thereafter30,250 Total$42,150\nTABLE: TABLE: in millions Principal; Fiscal 2024 $ 1,100; Fiscal 2025 2,750; Fiscal 2026 3,050; Fiscal 2027 2,500; Fiscal 2028 2,500; Thereafter 30,250; Total $ 42,150.\nTITLE: in millionsPrincipalFiscal 2024$1,100 Fiscal 20252,750 Fiscal 20263,050 Fiscal 20272,500 Fiscal 20282,500 Thereafter30,250 Total$42,150\nTITLE: in millionsPrincipal\nTITLE: in millions\nTITLE: Principal\n"
    },
    {
      "cluster": 17,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\njanuary, interest, fair, these, cash, agreements, fiscal, foreign, value, hedges\n\nTITLE: Derivative Instruments and Hedging Activities\nTEXT: We use derivative instruments as part of our normal business operations in the management of our exposure to fluctuations in foreign currency exchange rates and interest rates on certain debt. Our objective in managing these exposures is to decrease the volatility of cash flows affected by changes in the underlying rates and minimize the risk of changes in the fair value of our senior notes.\nTEXT: Fair Value Hedges. We had outstanding interest rate swap agreements with combined notional amounts of $5.4 billion at both January 28, 2024 and January 29, 2023. These agreements are accounted for as fair value hedges that swap fixed for variable rate interest to hedge changes in the fair values of certain senior notes. At January 28, 2024 and January 29, 2023, the fair values of these agreements totaled $858 million and $778 million, respectively, all of which are recognized in other long-term liabilities on the consolidated balance sheets.\nTEXT: All of our interest rate swap agreements designated as fair value hedges meet the shortcut method requirements under GAAP. Accordingly, the changes in the fair values of these agreements offset the changes in the fair value of the hedged long-term debt.\nTEXT: During the second quarter of fiscal 2023, we amended all of our interest rate swap agreements to replace LIBOR with SOFR and concurrently adopted certain expedients provided in Topic 848. These amendments did not result in any change to our application of hedge accounting or have a material impact to our consolidated financial statements. See Note 1 for further discussion.\nTEXT: Cash Flow Hedges. At January 28, 2024 and January 29, 2023, we had outstanding foreign currency forward contracts accounted for as cash flow hedges, which hedge the variability of forecasted cash flows associated with certain payments made in our foreign operations. At January 28, 2024 and January 29, 2023, the notional amounts and the fair values of these contracts were not material. Additionally, the realized and unrealized gains and losses on these instruments were not material during fiscal 2023, fiscal 2022, and fiscal 2021.\nTEXT: We also settled forward-starting interest rate swap agreements in prior years, which were used to hedge the variability in future interest payments attributable to changing interest rates on forecasted debt issuances. Unamortized losses on these forward-starting swaps, which were designated as cash flow hedges, are being amortized to interest expense over the life of the respective notes. Unamortized losses recognized on these swaps remaining in accumulated other comprehensive loss were immaterial as of January 28, 2024 and January 29, 2023, as were the losses recognized within interest expense for fiscal 2023, fiscal 2022, and fiscal 2021.\nTEXT: We expect an immaterial amount recorded in accumulated other comprehensive loss as of January 28, 2024 to be reclassified into earnings within the next 12 months.\nTEXT: Collateral. We generally enter into master netting arrangements, which are designed to reduce credit risk by permitting net settlement of transactions with the same counterparty. To further limit our credit risk, we enter into collateral security arrangements that provide for collateral to be received or posted when the net fair value of certain derivative instruments exceeds or falls below contractually established thresholds. The cash collateral posted by the Company related to derivative instruments under our collateral security arrangements was $714 million and $634 million as of January 28, 2024 and January 29, 2023, which was recorded in other current assets on the consolidated balance sheets. We did not hold any cash collateral as of January 28, 2024 or January 29, 2023.\nTITLE: 6.INCOME TAXES\nTITLE: INCOME TAXES\nTITLE: Provision for Income Taxes\nTEXT: The following table presents our earnings before the provision for income taxes:\nTITLE: in millionsFiscalFiscalFiscal202320222021United States$18,681 $20,990 $20,320 Foreign1,243 1,487 1,417 Total$19,924 $22,477 $21,737\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; United States $ 18,681 $ 20,990 $ 20,320; Foreign 1,243 1,487 1,417; Total $ 19,924 $ 22,477 $ 21,737.\nTITLE: in millionsFiscalFiscalFiscal202320222021United States$18,681 $20,990 $20,320 Foreign1,243 1,487 1,417 Total$19,924 $22,477 $21,737\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: The following table presents our provision for income taxes:\nTEXT: in millionsFiscalFiscalFiscal202320222021Current:Federal$3,764 $3,918 $4,066 State882 880 981 Foreign365 436 511 Total current5,011 5,234 5,558 Deferred:Federal(228)102 (155)State12 61 (11)Foreign(14)(25)(88)Total deferred(230)138 (254)Provision for income taxes$4,781 $5,372 $5,304\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Federal $ 3,764 $ 3,918 $ 4,066; State 882 880 981; Foreign 365 436 511; Total current 5,011 5,234 5,558; Federal (228) 102 (155); State 12 61 (11); Foreign (14) (25) (88); Total deferred (230) 138 (254); Provision for income taxes $ 4,781 $ 5,372 $ 5,304.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: Current:\nTITLE: Deferred:\nTEXT: The following table presents our combined federal, state, and foreign effective tax rates:\nTITLE: FiscalFiscalFiscal202320222021Combined federal, state, and foreign effective tax rates24.0 %23.9 %24.4 %\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2023 2022 2021; Combined federal, state, and foreign effective tax rates 24.0 % 23.9 % 24.4 %.\nTITLE: FiscalFiscalFiscal202320222021Combined federal, state, and foreign effective tax rates24.0 %23.9 %24.4 %\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\n"
    },
    {
      "cluster": 18,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndeferred, income, assets, liabilities, taxes, minimum, rules, these, rate, other\n\nTITLE: 2021\nTEXT: The following table presents the reconciliation of our provision for income taxes at the federal statutory rate of 21% to the actual tax expense:\nTEXT: in millionsFiscalFiscalFiscal202320222021Income taxes at federal statutory rate$4,184 $4,720 $4,565 State income taxes, net of federal income tax benefit706 743 766 Other, net(109)(91)(27)Total$4,781 $5,372 $5,304\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Income taxes at federal statutory rate $ 4,184 $ 4,720 $ 4,565; State income taxes, net of federal income tax benefit 706 743 766; Other, net (109) (91) (27); Total $ 4,781 $ 5,372 $ 5,304.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: On August 16, 2022, the Inflation Reduction Act of 2022 (“2022 Tax Act”) was enacted into law. The key tax provisions include a 15% minimum tax on adjusted financial statement income. There was no impact on the Company’s effective tax rate as a result of the 15% minimum tax under the 2022 Tax Act.\nTEXT: Additionally, as of the end of fiscal 2023, the Organization for Economic Cooperation and Development (“OECD”) has published rules for a new global minimum tax framework through its base erosion and profit shifting pillar two project (“BEPS Pillar Two”), and various governments around the world have enacted or are in the process of enacting legislation on these rules. Many member states have committed to adopting BEPS Pillar Two, which calls for a global minimum tax of 15% to be effective for tax years beginning in 2024. The OECD guidance published to date includes transition and safe harbor rules around the implementation of the BEPS Pillar Two global minimum tax. We are monitoring developments and evaluating the impacts these new rules will have on our effective tax rate, including eligibility to qualify for these safe harbor rules, and at this time do not expect the impact to be material.\nTITLE: Deferred Taxes\nTEXT: The following table presents the tax effects of temporary differences that give rise to significant portions of our deferred tax assets and deferred tax liabilities:\nTEXT: in millionsJanuary 28,2024January 29,2023Assets:Deferred compensation$237 $236 Accrued self-insurance liabilities258 276 State income taxes209 149 Merchandise inventories110 30 Non-deductible reserves474 318 Net operating losses99 115 Lease liabilities2,034 1,879 Deferred revenue191 148 Other46 56 Total deferred tax assets3,658 3,207 Valuation allowance(67)(5)Total deferred tax assets, net of valuation allowance3,591 3,202 Liabilities:Property and equipment(988)(992)Goodwill and other intangibles(1,000)(953)Lease right-of-use assets(1,956)(1,799)Tax on unremitted earnings(53)(63)Other(144)(95)Total deferred tax liabilities(4,141)(3,902)Net deferred tax liabilities$(550)$(700)\nTABLE: TABLE: in millions January 28,2024 January 29,2023; Deferred compensation $ 237 $ 236; Accrued self-insurance liabilities 258 276; State income taxes 209 149; Merchandise inventories 110 30; Non-deductible reserves 474 318; Net operating losses 99 115; Lease liabilities 2,034 1,879; Deferred revenue 191 148; Other 46 56; Total deferred tax assets 3,658 3,207; Valuation allowance (67) (5); Total deferred tax assets, net of valuation allowance 3,591 3,202; Property and equipment (988) (992); Goodwill and other intangibles (1,000) (953); Lease right-of-use assets (1,956) (1,799); Tax on unremitted earnings (53) (63); Other (144) (95); Total deferred tax liabilities (4,141) (3,902); Net deferred tax liabilities $ (550) $ (700).\nTITLE: in millionsJanuary 28,2024January 29,2023\nTITLE: in millions\nTITLE: January 28,2024\nTITLE: January 29,2023\nTITLE: Assets:\nTITLE: Liabilities:\nTEXT: The following table presents our noncurrent deferred tax assets and noncurrent deferred tax liabilities, netted by tax jurisdiction, as presented on the consolidated balance sheets:\nTEXT: in millionsConsolidated Balance Sheet ClassificationJanuary 28,2024January 29,2023Deferred tax assetsOther assets$313 $319 Deferred tax liabilitiesDeferred income taxes(863)(1,019)Net deferred tax liabilities$(550)$(700)\nTABLE: TABLE: in millions Consolidated Balance Sheet Classification January 28,2024 January 29,2023; Deferred tax assets Other assets $ 313 $ 319; Deferred tax liabilities Deferred income taxes (863) (1,019); Net deferred tax liabilities $ (550) $ (700).\nTITLE: in millionsConsolidated Balance Sheet ClassificationJanuary 28,2024January 29,2023\nTITLE: in millions\nTITLE: Consolidated Balance Sheet Classification\nTITLE: January 28,2024\nTITLE: January 29,2023\nTEXT: As of January 28, 2024, we recorded deferred tax assets of $99 million for net operating losses and $69 million for tax credits, primarily related to state jurisdictions. These losses and credits expire at various dates beginning in 2024 and 2025, respectively. We have concluded that it is more likely than not that tax benefits related to substantially all net operating losses will be realized based upon the expectation that we will generate the necessary taxable income in future periods. We have concluded that it is not more likely than not that tax benefits related to substantially all tax credits will be realized prior to expiration, and a valuation allowance has been recorded against these tax credits. The overall change in our valuation allowance was not material in fiscal 2023.\n"
    },
    {
      "cluster": 19,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, cash, earnings, shares, unrecognized, january, stock, foreign, state, consolidated\n\nTITLE: Reinvestment of Unremitted Earnings\nTEXT: Substantially all of our current year foreign cash earnings in excess of working capital and cash needed for strategic investments are not intended to be indefinitely reinvested offshore. Therefore, the tax effects of repatriation for applicable state taxes and foreign withholding taxes of such cash earnings have been provided for in the accompanying consolidated statements of earnings. We have the intent and ability to reinvest substantially all of the $4.8 billion of non-cash unremitted earnings of our non-U.S. subsidiaries indefinitely. Accordingly, no provision for state taxes or foreign withholding taxes was recorded on these unremitted earnings in the accompanying consolidated statements of earnings. It is impracticable for us to determine the amount of unrecognized deferred tax liabilities on these indefinitely reinvested earnings due to the complexities associated with the hypothetical calculation.\nTITLE: Tax Return Examination Status\nTEXT: Our income tax returns are routinely examined by U.S. federal, state and local, and foreign tax authorities. Our U.S. federal tax returns for fiscal years 2010 through 2021, with the exception of 2015, are currently under examination by the IRS. With respect to fiscal years 2010 to 2014, the IRS had issued a proposed adjustment relating to transfer pricing between our entities in the U.S. and China, which was resolved during fiscal year 2023 with no material impact to our consolidated financial condition, results of operations, or cash flows. There are also ongoing U.S. state and local audits and other foreign audits covering fiscal years 2013 through 2021. We do not expect the results from any ongoing income tax audit to have a material impact on our consolidated financial condition, results of operations, or cash flows.\nTEXT: Over the next twelve months, it is reasonably possible that the resolution of federal and state tax examinations, as well as the expiration of statutes of limitations, could reduce our unrecognized tax benefits by an immaterial amount. We do not anticipate the resolution of these matters will result in a material change to our consolidated financial condition or results of operations.\nTITLE: Unrecognized Tax Benefits\nTEXT: The following table reconciles the beginning and ending amount of our gross unrecognized tax benefits:\nTEXT: in millionsFiscalFiscalFiscal202320222021Unrecognized tax benefits balance at beginning of fiscal year$643 $570 $540 Additions based on tax positions related to the current year74 75 80 Additions for tax positions of prior years13 22 24 Reductions for tax positions of prior years(14)(7)(40)Reductions due to settlements— (1)(29)Reductions due to lapse of statute of limitations(27)(16)(5)Unrecognized tax benefits balance at end of fiscal year$689 $643 $570\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Unrecognized tax benefits balance at beginning of fiscal year $ 643 $ 570 $ 540; Additions based on tax positions related to the current year 74 75 80; Additions for tax positions of prior years 13 22 24; Reductions for tax positions of prior years (14) (7) (40); Reductions due to settlements — (1) (29); Reductions due to lapse of statute of limitations (27) (16) (5); Unrecognized tax benefits balance at end of fiscal year $ 689 $ 643 $ 570.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: Unrecognized tax benefits that if recognized would affect our annual effective income tax rate on net earnings were $568 million, $537 million, and $479 million at January 28, 2024, January 29, 2023, and January 30, 2022, respectively.\nTITLE: Interest and Penalties\nTEXT: Net adjustments to accruals for interest and penalties associated with uncertain tax positions were immaterial in fiscal 2023, fiscal 2022, and fiscal 2021. Our total accrued interest and penalties associated with uncertain tax positions were immaterial as of January 28, 2024 and January 29, 2023.\nTITLE: 7.STOCKHOLDERS’ EQUITY\nTITLE: STOCKHOLDERS’ EQUITY\nTITLE: Stock Rollforward\nTEXT: The following table presents a reconciliation of the number of shares of our common stock outstanding and cash dividends per share:\nTEXT: shares in millionsFiscalFiscalFiscal202320222021Common stock:Shares at beginning of year1,794 1,792 1,789 Shares issued under employee stock plans, net2 2 3 Shares at end of year1,796 1,794 1,792 Treasury stock:Shares at beginning of year(778)(757)(712)Repurchases of common stock(26)(21)(45)Shares at end of year(804)(778)(757)Shares outstanding at end of year992 1,016 1,035 Cash dividends per share$8.36 $7.60 $6.60\nTABLE: TABLE: shares in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Shares at beginning of year 1,794 1,792 1,789; Shares issued under employee stock plans, net 2 2 3; Shares at end of year 1,796 1,794 1,792; Shares at beginning of year (778) (757) (712); Repurchases of common stock (26) (21) (45); Shares at end of year (804) (778) (757); Shares outstanding at end of year 992 1,016 1,035; Cash dividends per share $ 8.36 $ 7.60 $ 6.60.\nTITLE: shares in millionsFiscalFiscalFiscal\nTITLE: shares in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTITLE: Common stock:\nTITLE: Treasury stock:\nTITLE: Share Repurchases\nTEXT: In August 2023, our Board of Directors approved a $15.0 billion share repurchase authorization that replaced the previous authorization of $15.0 billion, which was approved in August 2022. The August 2023 authorization does not have a prescribed expiration date. As of January 28, 2024, approximately $12.3 billion of the $15.0 billion share repurchase authorization remained available.\nTEXT: The following table presents information about our repurchases of common stock, all of which were completed through open market purchases:\n"
    },
    {
      "cluster": 20,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfair, value, level, assets, liabilities, inputs, derivative, which, january, repurchases\n\nTITLE: FiscalFiscalFiscalin millions202320222021Total number of shares repurchased26 21 45 Total cost of shares repurchased$8,074 $6,504 $15,001\nTABLE: TABLE: Fiscal Fiscal Fiscal; in millions 2023 2022 2021; Total number of shares repurchased 26 21 45; Total cost of shares repurchased $ 8,074 $ 6,504 $ 15,001.\nTITLE: FiscalFiscalFiscalin millions202320222021Total number of shares repurchased26 21 45 Total cost of shares repurchased$8,074 $6,504 $15,001\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: in millions202320222021\nTITLE: in millions\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: Total cost of shares repurchased\nTEXT: The cost of shares repurchased may differ from the repurchases of common stock amounts in the consolidated statements of cash flows due to unsettled share repurchases at the end of a period and excise taxes incurred on share repurchases.\nTITLE: 8.FAIR VALUE MEASUREMENTS\nTITLE: FAIR VALUE MEASUREMENTS\nTEXT: The fair value of an asset is considered to be the price at which the asset could be sold in an orderly transaction between unrelated knowledgeable and willing parties. A liability’s fair value is defined as the amount that would be paid to transfer the liability to a new obligor, rather than the amount that would be paid to settle the liability with the creditor. Assets and liabilities recorded at fair value are measured using a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value. The levels of the fair value hierarchy are:\nTEXT: •Level 1: observable inputs such as quoted prices in active markets for identical assets or liabilities;\nTEXT: •Level 2: inputs other than quoted prices in active markets in Level 1 that are either directly or indirectly observable; and\nTEXT: •Level 3: unobservable inputs for which little or no market data exists, therefore requiring management judgment to develop the Company’s own models with estimates and assumptions.\nTITLE: Assets and Liabilities Measured at Fair Value on a Recurring Basis\nTEXT: The following table presents the assets and liabilities that are measured at fair value on a recurring basis:\nTEXT: January 28, 2024January 29, 2023in millions Fair Value (Level 2)Fair Value (Level 2)Derivative agreements – assets$— $— Derivative agreements – liabilities(859)(778)Total$(859)$(778)\nTABLE: TABLE: January 28, 2024 January 29, 2023; in millions Fair Value (Level 2) Fair Value (Level 2); Derivative agreements – assets $ — $ —; Derivative agreements – liabilities (859) (778); Total $ (859) $ (778).\nTITLE: January 28, 2024January 29, 2023\nTITLE: January 28, 2024\nTITLE: January 29, 2023\nTITLE: in millions Fair Value (Level 2)Fair Value (Level 2)\nTITLE: in millions\nTITLE: Fair Value (Level 2)\nTEXT: Derivative agreements – liabilities\nTEXT: The fair values of our derivative instruments are determined using an income approach and Level 2 inputs, which primarily include the respective interest rate forward curves and discount rates. Our derivative instruments are discussed further in Note 5.\nTITLE: Assets and Liabilities Measured at Fair Value on a Nonrecurring Basis\nTEXT: Long-lived assets, goodwill, and other intangible assets are subject to nonrecurring fair value measurement for the assessment of impairment. We did not have any material assets or liabilities that were measured and recognized at fair value on a nonrecurring basis during fiscal 2023, fiscal 2022, or fiscal 2021.\nTITLE: Other Fair Value Disclosures\nTEXT: The carrying amounts of cash and cash equivalents, receivables, and accounts payable approximate fair value due to their short-term nature.\nTEXT: The following table presents the aggregate fair values and carrying values of our senior notes:\nTEXT: January 28, 2024January 29, 2023in millionsFair Value(Level 1)CarryingValueFair Value(Level 1)CarryingValueSenior notes$38,495 $40,843 $38,537 $39,908\nTABLE: TABLE: January 28, 2024 January 29, 2023; in millions Fair Value(Level 1) CarryingValue Fair Value(Level 1) CarryingValue; Senior notes $ 38,495 $ 40,843 $ 38,537 $ 39,908.\nTITLE: January 28, 2024January 29, 2023\nTITLE: January 28, 2024\nTITLE: January 29, 2023\nTITLE: in millionsFair Value(Level 1)CarryingValueFair Value(Level 1)CarryingValue\nTITLE: in millions\nTITLE: Fair Value(Level 1)\nTITLE: CarryingValue\nTITLE: Fair Value(Level 1)\nTITLE: CarryingValue\nTITLE: 9.STOCK-BASED COMPENSATION\nTITLE: STOCK-BASED COMPENSATION\n"
    },
    {
      "cluster": 21,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstock, options, shares, plan, omnibus, option, value, awards, fair, date\n\nTITLE: Omnibus Stock Incentive Plans\nTEXT: The Home Depot, Inc. Omnibus Stock Incentive Plan, as Amended and Restated May 19, 2022 (the “Omnibus Plan”) and The Home Depot, Inc. 1997 Omnibus Stock Incentive Plan (the “1997 Plan” and collectively with the Omnibus Plan, the “Plans”) provide that incentive and nonqualified stock options, stock appreciation rights, restricted stock, restricted stock units, performance shares, performance units, deferred shares, and other stock-based awards may be issued to certain of our associates and non-employee directors. Under the Omnibus Plan, the maximum number of shares of our common stock authorized for issuance is 80 million shares plus a number of shares (not to exceed 10 million) related to underlying awards outstanding as of May 19, 2022, which can be returned to the share pool if those awards are subsequently terminated or expire unexercised, or are cancelled, forfeited or lapse for any reason, with any award other than a stock option or stock appreciation right reducing the number of shares available for issuance by 2.11 shares. At January 28, 2024, there were approximately 77 million shares available for future grants under the Omnibus Plan. No additional equity awards could be issued from the 1997 Plan after May 26, 2005.\nTEXT: The following table presents total stock-based compensation expense, net of estimated forfeitures, including expense related to our ESPPs, and related income tax benefit:\nTEXT: in millionsFiscalFiscalFiscal202320222021Pre-tax stock-based compensation expense$382 $367 $403 Income tax benefit(79)(73)(86)After-tax stock-based compensation expense$303 $294 $317\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Pre-tax stock-based compensation expense $ 382 $ 367 $ 403; Income tax benefit (79) (73) (86); After-tax stock-based compensation expense $ 303 $ 294 $ 317.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: At January 28, 2024, there was $454 million of unrecognized stock-based compensation expense, which is expected to be recognized over a weighted average period of two years.\nTEXT: The award types issued under the Plans are as follows:\nTEXT: Stock Options. Under the terms of the Plans, incentive stock options and nonqualified stock options must have an exercise price at or above the fair market value of our stock on the date of the grant. Typically, nonqualified stock options vest at the rate of 25% per year commencing on the second anniversary date of the grant and expire on the tenth anniversary date of the grant. Additionally, a majority of our stock options may become non-forfeitable upon the associate reaching age 60, provided the associate has had five years of continuous service. No incentive stock options have been issued under the Omnibus Plan.\nTEXT: We estimate the fair value of stock option awards on the date of grant using the Black-Scholes option-pricing model. Our determination of fair value of stock option awards on the date of grant using the Black-Scholes option-pricing model is affected by our stock price as well as assumptions regarding a number of variables.\nTEXT: The following table presents the per share weighted average fair value of stock options granted and the assumptions used in determining fair value at the date of grant using the Black-Scholes option-pricing model:\nTEXT: FiscalFiscalFiscal 202320222021Per share weighted average fair value$66.01 $70.21 $57.71 Risk-free interest rate3.6 %2.5 %1.0 %Assumed volatility26.7 %27.0 %26.5 %Assumed dividend yield2.8 %2.4 %2.2 %Assumed lives of options6 years6 years6 years\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2023 2022 2021; Per share weighted average fair value $ 66.01 $ 70.21 $ 57.71; Risk-free interest rate 3.6 % 2.5 % 1.0 %; Assumed volatility 26.7 % 27.0 % 26.5 %; Assumed dividend yield 2.8 % 2.4 % 2.2 %; Assumed lives of options 6 years 6 years 6 years.\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: The following table presents a summary of stock option activity by number of shares and weighted average exercise price during fiscal 2023:\nTEXT: shares in thousandsNumber ofSharesWeighted AverageExercise PriceOutstanding at beginning of year3,626 $167.66 Granted235 283.85 Exercised(743)106.96 Forfeited(33)275.93 Outstanding at end of year3,085 189.97\nTABLE: TABLE: shares in thousands Number ofShares Weighted AverageExercise Price; Outstanding at beginning of year 3,626 $ 167.66; Granted 235 283.85; Exercised (743) 106.96; Forfeited (33) 275.93; Outstanding at end of year 3,085 189.97.\nTITLE: shares in thousandsNumber ofSharesWeighted AverageExercise Price\nTITLE: shares in thousands\nTITLE: Number ofShares\nTITLE: Weighted AverageExercise Price\nTEXT: The following table presents the total intrinsic value of stock options exercised:\nTITLE: in millionsFiscalFiscalFiscal202320222021Total intrinsic value of stock options exercised$152 $61 $237\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Total intrinsic value of stock options exercised $ 152 $ 61 $ 237.\nTITLE: in millionsFiscalFiscalFiscal202320222021Total intrinsic value of stock options exercised$152 $61 $237\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\n"
    },
    {
      "cluster": 22,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstock, shares, restricted, performance, upon, awards, date, following, share, grant\n\nTITLE: 2021\nTEXT: The following table presents details regarding outstanding and exercisable stock options at January 28, 2024:\nTEXT: shares in thousands, dollars in millions, except for per share amountsNumber ofSharesIntrinsicValueWeighted Average Remaining LifeWeighted AverageExercise PriceOutstanding3,085 $510 4.6 years$189.97 Exercisable2,102 424 3.2 years153.57\nTABLE: TABLE: shares in thousands, dollars in millions, except for per share amounts Number ofShares IntrinsicValue Weighted Average Remaining Life Weighted AverageExercise Price; Outstanding 3,085 $ 510 4.6 years $ 189.97; Exercisable 2,102 424 3.2 years 153.57.\nTITLE: shares in thousands, dollars in millions, except for per share amounts\nTITLE: Number ofShares\nTITLE: IntrinsicValue\nTITLE: Weighted Average Remaining Life\nTITLE: Weighted AverageExercise Price\nTEXT: Shares of common stock issued from stock option exercises may be issued from authorized and unissued common stock or treasury stock.\nTEXT: Restricted Stock and Performance Share Awards. Restrictions on the restricted stock issued under the Plans generally lapse over various periods up to five years. At the grant date of the award, recipients of restricted stock are granted voting rights and generally receive dividends on unvested shares, paid in the form of cash on each dividend payment date. Dividends paid on unvested shares were immaterial for fiscal 2023, fiscal 2022, and fiscal 2021. Additionally, the majority of our restricted stock awards may become non-forfeitable upon the associate’s attainment of age 60, provided the associate has had five years of continuous service.\nTEXT: We have also granted performance share awards under the Plans. These awards provide for the issuance of shares of our common stock at the end of the three-year performance cycle based upon our performance against target average ROIC and operating profit over that performance cycle. Additionally, the awards become non-forfeitable upon the associate’s attainment of age 60, provided the associate has had five years of continuous service and minimum performance targets are achieved. Recipients of performance share awards have no voting rights until the shares are issued following completion of the performance period. Dividend equivalents accrue on the performance shares (as reinvested shares) and are paid upon the payout of the award based upon the actual number of shares earned. The fair value of the restricted stock and performance shares is based on the closing stock price on the date of grant and is expensed over the period during which the restrictions lapse.\nTEXT: Restricted Stock Units. Each restricted stock unit entitles the associate to one share of common stock to be received upon vesting up to five years after the grant date. Additionally, the majority of these awards may become non-forfeitable upon the associate reaching age 60, provided the associate has had five years of continuous service. Recipients of restricted stock units have no voting rights until the vesting of the award. Recipients receive dividend equivalents that accrue on unvested units and are paid out in the form of additional shares of stock on the vesting date. The fair value of the restricted stock units is based on the closing stock price on the date of grant and is expensed over the period during which the units vest.\nTEXT: The following table presents a summary of restricted stock, performance shares, and restricted stock unit activity during fiscal 2023:\nTEXT: shares in thousandsNumber ofSharesWeighted AverageGrant Date Fair ValueNonvested at beginning of year3,359 $261.66 Granted1,692 273.63 Vested(1,429)231.72 Forfeited(236)277.20 Nonvested at end of year3,386 279.19\nTABLE: TABLE: shares in thousands Number ofShares Weighted AverageGrant Date Fair Value; Nonvested at beginning of year 3,359 $ 261.66; Granted 1,692 273.63; Vested (1,429) 231.72; Forfeited (236) 277.20; Nonvested at end of year 3,386 279.19.\nTITLE: shares in thousandsNumber ofSharesWeighted AverageGrant Date Fair Value\nTITLE: shares in thousands\nTITLE: Number ofShares\nTITLE: Weighted AverageGrant Date Fair Value\nTEXT: The following table presents the total fair value of restricted stock, performance shares, and restricted stock units vested:\nTITLE: in millionsFiscalFiscalFiscal202320222021Total fair value vested$412 $479 $405\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Total fair value vested $ 412 $ 479 $ 405.\nTITLE: in millionsFiscalFiscalFiscal202320222021Total fair value vested$412 $479 $405\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: Deferred Shares. We grant awards of deferred shares to non-employee directors under the Plans. Each deferred share entitles the non-employee director to one share of common stock to be received following termination of Board service. Recipients of deferred shares have no voting rights and receive dividend equivalents that accrue and are paid out in the form of additional shares of stock upon payout of the underlying shares following termination of service. The fair value of the deferred shares is based on the closing stock price on the date of grant and is expensed immediately upon grant.\nTEXT: The following table presents deferred shares granted to non-employee directors:\nTITLE: FiscalFiscalFiscal202320222021Deferred shares granted to non-employee directors19,000 19,000 15,000\nTABLE: TABLE: Fiscal Fiscal Fiscal; 2023 2022 2021; Deferred shares granted to non-employee directors 19,000 19,000 15,000.\nTITLE: FiscalFiscalFiscal202320222021Deferred shares granted to non-employee directors19,000 19,000 15,000\nTITLE: FiscalFiscalFiscal\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\n"
    },
    {
      "cluster": 23,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nshares, plans, plan, common, associates, average, purchase, stock, benefit, weighted\n\nTITLE: Employee Stock Purchase Plans\nTEXT: We maintain two ESPPs: a U.S. and a non-U.S. plan. The plan for U.S. associates is a tax-qualified plan under Section 423 of the Internal Revenue Code. The non-U.S. plan is not a Section 423 plan. At January 28, 2024, there were approximately 15 million shares available under the U.S. plan and approximately 18 million shares available under the non-U.S. plan. The purchase price of shares under the ESPPs is equal to 85% of the stock’s fair market value on the last day of the purchase period, which is a six-month period ending on December 31 and June 30 of each year. During fiscal 2023, there were approximately 1 million shares purchased under the ESPPs at an average price of $277.19. Under the outstanding ESPPs at January 28, 2024, associates have contributed $22 million to purchase shares at 85% of the stock’s fair market value on the last day of the current purchase period, June 30, 2024.\nTITLE: 10.EMPLOYEE BENEFIT PLANS\nTITLE: EMPLOYEE BENEFIT PLANS\nTEXT: We maintain active defined contribution retirement plans for our associates (the “Benefit Plans”). All associates satisfying certain service requirements are eligible to participate in the Benefit Plans. We make cash contributions each payroll period up to specified percentages of associates’ contributions as approved by our Board of Directors.\nTEXT: We also maintain the Restoration Plans to provide certain associates deferred compensation that they would have received under the Benefit Plans as a matching contribution if not for the maximum compensation limits under the Internal Revenue Code. We fund the Restoration Plans through contributions made to grantor trusts, which are then used to purchase shares of our common stock in the open market.\nTEXT: The following table presents our contributions to the Benefit Plans and the Restoration Plans:\nTITLE: in millionsFiscalFiscalFiscal202320222021Contributions to the Benefit Plans and the Restoration Plans$293 $280 $278\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Contributions to the Benefit Plans and the Restoration Plans $ 293 $ 280 $ 278.\nTITLE: in millionsFiscalFiscalFiscal202320222021Contributions to the Benefit Plans and the Restoration Plans$293 $280 $278\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: At January 28, 2024, the Benefit Plans and the Restoration Plans held a total of 5.0 million shares of our common stock in trusts for plan participants.\nTITLE: 11.WEIGHTED AVERAGE COMMON SHARES\nTITLE: WEIGHTED AVERAGE COMMON SHARES\nTEXT: The following table presents the reconciliation of our basic to diluted weighted average common shares as well as the number of anti-dilutive securities excluded from diluted weighted average common shares:\nTEXT: in millionsFiscalFiscalFiscal202320222021Basic weighted average common shares999 1,022 1,054 Effect of potentially dilutive securities (1)3 3 4 Diluted weighted average common shares1,002 1,025 1,058\nTABLE: TABLE: in millions Fiscal Fiscal Fiscal; 2023 2022 2021; Basic weighted average common shares 999 1,022 1,054; Effect of potentially dilutive securities (1) 3 3 4; Diluted weighted average common shares 1,002 1,025 1,058.\nTITLE: in millionsFiscalFiscalFiscal\nTITLE: in millions\nTITLE: Fiscal\nTITLE: 202320222021\nTITLE: 2023\nTITLE: 2022\nTITLE: 2021\nTEXT: Effect of potentially dilutive securities (1)\nTEXT: Anti-dilutive securities excluded from diluted weighted average common shares1 1 —\nTEXT: (1) Represents the dilutive impact of stock-based awards.\nTITLE: 12.COMMITMENTS AND CONTINGENCIES\nTITLE: COMMITMENTS AND CONTINGENCIES\nTEXT: At January 28, 2024, we had outstanding letters of credit totaling $598 million, primarily related to certain business transactions, including insurance programs, trade contracts, and construction contracts.\nTEXT: We are involved in litigation arising in the normal course of business. In management’s opinion, any such litigation is not expected to have a material adverse effect on our consolidated financial condition, results of operations, or cash flows.\nTITLE: 13.ACQUISITIONS\n"
    },
    {
      "cluster": 24,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nacquisitions, acquisition, values, aggregate, fair, assets, period, goodwill, dates, respective\n\nTITLE: ACQUISITIONS\nTEXT: During fiscal 2023, we completed three individually immaterial acquisitions for total aggregate cash purchase consideration of $1.5 billion. Based on preliminary acquisition date fair values, we recognized aggregate definite-lived intangible assets of $469 million with a weighted average amortization period of 17 years, primarily related to customer relationships, and goodwill of $998 million. The goodwill arising from the acquisitions is primarily attributable to operational synergies and acceleration of growth strategy, as well as the assembled workforce. The portion of goodwill generated through these acquisitions that is expected to be deductible for U.S. federal and state tax purposes is not material.\nTEXT: We have completed preliminary valuation analyses necessary to assess the fair values of the assets acquired and liabilities assumed and the amount of goodwill to be recognized as of the acquisition dates. These fair values were based on management’s estimates and assumptions; however, the amounts indicated above are preliminary in nature and are subject to adjustment as additional information is obtained about the facts and circumstances that existed as of the respective acquisition dates. Accordingly, there may be adjustments to the assigned values of acquired assets and liabilities, including, but not limited to, intangible assets and their respective estimated useful lives. The final determination of the fair values and related income tax impacts will be completed as soon as practicable, and within the measurement period of up to one year from the respective acquisition dates as permitted under GAAP. Any adjustments to provisional amounts that are identified during the measurement period will be recorded in the reporting period in which the adjustment is determined.\nTEXT: Net sales and net earnings for fiscal 2023 attributable to these acquisitions in the aggregate after their respective acquisition dates were immaterial. Pro forma results of operations would not be materially different as a result of the acquisitions in the aggregate and therefore are not presented.\n"
    }
  ]
}