[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.03\nTEXT: Item 5.03 Amendments to Articles of Incorporation or Bylaws; Change in Fiscal Year. On November 20, 2025, as part of its periodic review of corporate governance matters, the Board of Directors (the “Board”) of The Home Depot, Inc. (the “Company”) approved and adopted amendments to the Company’s by-laws (as so amended and restated, the “By-Laws”), effective as of November 20, 2025. These amendments include (i) aligning the advance notice window for both director nominations and proposals of other business (outside of Rule 14a-8 under the Securities Exchange Act of 1934, as amended, (“Rule 14a-8”) or proxy access) to a single period beginning 120 days and ending 90 days prior to the first anniversary of the prior year’s annual shareholders’ meeting; (ii) clarifying that the number of director nominees a shareholder may propose under the advance notice provisions of the By-Laws may not exceed the number of directors to be elected at the meeting; (iii) revising and clarifying certain informational requirements set forth in the advance notice provisions for shareholder nominations of directors, including removing the requirement that the notice from shareholders include information regarding persons “acting in concert therewith;” (iv) removing a provision regarding the binding nature of the Board’s determination of the sufficiency of a shareholder’s special meeting request; (v) providing that the Board will elect a chair of a shareholders’ meeting that is a Company officer or director if the Company’s Chair, Chief Executive Officer or President will not be present at such meeting; (vi) clarifying that any shareholder request to act by written consent must include a statement of intent to solicit written consents from holders of all outstanding shares, which aligns with the existing solicitation requirements in the Company’s Amended and Restated Certificate of Incorporation; (vii) removing a provision that permitted the adjournment of Board meetings without notice to absent directors; and (viii) making certain other immaterial updates and conforming, ministerial, or technical changes, including to align with recent changes in Delaware law. On November 20, 2025, as part of its periodic review of corporate governance matters, the Board of Directors (the “Board”) of The Home Depot, Inc. (the “Company”) approved and adopted amendments to the Company’s by-laws (as so amended and restated, the “By-Laws”), effective as of November 20, 2025. These amendments include (i) aligning the advance notice window for both director nominations and proposals of other business (outside of Rule 14a-8 under the Securities Exchange Act of 1934, as amended, (“Rule 14a-8”) or proxy access) to a single period beginning 120 days and ending 90 days prior to the first anniversary of the prior year’s annual shareholders’ meeting; (ii) clarifying that the number of director nominees a shareholder may propose under the advance notice provisions of the By-Laws may not exceed the number of directors to be elected at the meeting; (iii) revising and clarifying certain informational requirements set forth in the advance notice provisions for shareholder nominations of directors, including removing the requirement that the notice from shareholders include information regarding persons “acting in concert therewith;” (iv) removing a provision regarding the binding nature of the Board’s determination of the sufficiency of a shareholder’s special meeting request; (v) providing that the Board will elect a chair of a shareholders’ meeting that is a Company officer or director if the Company’s Chair, Chief Executive Officer or President will not be present at such meeting; (vi) clarifying that any shareholder request to act by written consent must include a statement of intent to solicit written consents from holders of all outstanding shares, which aligns with the existing solicitation requirements in the Company’s Amended and Restated Certificate of Incorporation; (vii) removing a provision that permitted the adjournment of Board meetings without notice to absent directors; and (viii) making certain other immaterial updates and conforming, ministerial, or technical changes, including to align with recent changes in Delaware law. The foregoing summary of the amendments to the By-Laws does not purport to be complete and is qualified in its entirety by reference to the full text of the By-Laws, a copy of which is filed as Exhibit 3.2 hereto and incorporated herein by reference. The foregoing summary of the amendments to the By-Laws does not purport to be complete and is qualified in its entirety by reference to the full text of the By-Laws, a copy of which is filed as Exhibit 3.2 hereto and incorporated herein by reference.\nTEXT: Item 5.03 above, the Company is updating its disclosure regarding the deadlines for submission of shareholder proposals or director nominations under the advance notice provisions of the By-Laws that were previously announced in the 2025 Proxy Statement. For a proposal or nomination to be considered at next year’s annual shareholders’ meeting (other than proposals pursuant to Rule 14a-8 or nominations pursuant to the Company’s proxy access By-Law), notice of such proposal or nomination must be received no earlier than 120 days (January 22, 2026) and no later than 90 days (February 21, 2026) prior to the anniversary of the 2025 annual shareholders’ meeting (the “2025 Meeting”). However, if next year’s annual shareholders’ meeting is to be held more than 30 days before or 70 days after the anniversary of the 2025 Meeting, notice of the proposal or nomination must be received no earlier than 120 days and no later than 90 days prior to next year’s annual shareholders’ meeting date, or if the first public announcement of the annual shareholders’ meeting date is less than 70 days prior to such meeting, by the tenth day following the Company’s public announcement of next year’s annual shareholders’ meeting date. As a result of the amendments to the By-laws described in\n"
  },
  {
    "cluster": 2,
    "content": "TITLE: Item 8.01\nTEXT: Item 8.01. Other Events. As a result of the amendments to the By-laws described in\nTITLE: Item 9.01\nTEXT: Item 9.01. Financial Statements and Exhibits. ExhibitDescription3.2By-Laws of The Home Depot, Inc. (As Amended and Restated Effective November 20, 2025)104Cover Page Interactive Data File (formatted as Inline XBRL). ExhibitDescription3.2By-Laws of The Home Depot, Inc. (As Amended and Restated Effective November 20, 2025)104Cover Page Interactive Data File (formatted as Inline XBRL). ExhibitDescription3.2By-Laws of The Home Depot, Inc. (As Amended and Restated Effective November 20, 2025)104Cover Page Interactive Data File (formatted as Inline XBRL). 3.2By-Laws of The Home Depot, Inc. (As Amended and Restated Effective November 20, 2025) By-Laws of The Home Depot, Inc. (As Amended and Restated Effective November 20, 2025) By-Laws of The Home Depot, Inc. (As Amended and Restated Effective November 20, 2025) By-Laws of The Home Depot, Inc. (As Amended and Restated Effective November 20, 2025) By-Laws of The Home Depot, Inc. (As Amended and Restated Effective November 20, 2025) 104Cover Page Interactive Data File (formatted as Inline XBRL). Cover Page Interactive Data File (formatted as Inline XBRL). Cover Page Interactive Data File (formatted as Inline XBRL). Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. THE HOME DEPOT, INC.Date: November 24, 2025By:/s/ Teresa Wynn RoseboroughName:Teresa Wynn Roseborough Title:Executive Vice President, General Counsel and Corporate Secretary THE HOME DEPOT, INC.Date: November 24, 2025By:/s/ Teresa Wynn RoseboroughName:Teresa Wynn Roseborough Title:Executive Vice President, General Counsel and Corporate Secretary THE HOME DEPOT, INC.Date: November 24, 2025By:/s/ Teresa Wynn RoseboroughName:Teresa Wynn Roseborough Title:Executive Vice President, General Counsel and Corporate Secretary Date: November 24, 2025By:/s/ Teresa Wynn Roseborough Date: November 24, 2025 Date: November 24, 2025 /s/ Teresa Wynn Roseborough /s/ Teresa Wynn Roseborough Name:Teresa Wynn Roseborough Teresa Wynn Roseborough Teresa Wynn Roseborough Title:Executive Vice President, General Counsel and Corporate Secretary Executive Vice President, General Counsel and Corporate Secretary Executive Vice President, General Counsel and Corporate Secretary\n"
  }
]