[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.02\nTEXT: Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 7, 2025, Michelle Johnston Holthaus, Chief Executive Officer of Intel Products, notified Intel Corporation (“Intel”) of her decision to resign for Good Reason (as defined in her Offer Letter, dated as of February 28, 2025). In connection with her resignation, Ms. Johnston Holthaus has agreed to remain employed by Intel in a non-executive role through March 1, 2026 to ensure a smooth transition. Upon her departure on March 1, 2026, Ms. Johnston Holthaus will be entitled to severance benefits in accordance with the terms and conditions of the Intel Corporation Executive Severance Plan, as previously disclosed, in exchange for a release of claims in favor of Intel. On September 7, 2025, Michelle Johnston Holthaus, Chief Executive Officer of Intel Products, notified Intel Corporation (“Intel”) of her decision to resign for Good Reason (as defined in her Offer Letter, dated as of February 28, 2025). In connection with her resignation, Ms. Johnston Holthaus has agreed to remain employed by Intel in a non-executive role through March 1, 2026 to ensure a smooth transition. Upon her departure on March 1, 2026, Ms. Johnston Holthaus will be entitled to severance benefits in accordance with the terms and conditions of the Intel Corporation Executive Severance Plan, as previously disclosed, in exchange for a release of claims in favor of Intel.\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. Financial Statements and Exhibits. The following exhibits are provided as part of this report: The following exhibits are provided as part of this report: Exhibit NumberDescription104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription 104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. INTEL CORPORATION(Registrant)Date:September 8, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant)Date:September 8, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant)Date:September 8, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant) INTEL CORPORATION(Registrant) Date:September 8, 2025By:/s/ April Miller Boise /s/ April Miller Boise /s/ April Miller Boise Executive Vice President and Chief Legal Officer Executive Vice President and Chief Legal Officer Executive Vice President and Chief Legal Officer\n"
  }
]