[
  {
    "cluster": 1,
    "content": "TITLE: Item 3.02\nTEXT: Item 3.02 Unregistered Sales of Equity Securities. On September 26, 2025, Intel Corporation (the “Company”) completed the issuance and sale of 86,956,522 shares of the Company’s common stock, par value $0.001 per share (the “Shares”), to SoftBank Group Corp. (“SoftBank”) at a price per share of $23.00, for an aggregate purchase price in cash of $2.0 billion. The issuance and sale were undertaken pursuant to a Securities Purchase Agreement (the “Purchase Agreement”), dated August 28, 2025, between the Company and Softbank, in a private placement relying upon the exemption provided by Section 4(a)(2) of the Securities Act of 1933 as a transaction not involving a public offering, as previously disclosed by the Company in a Current Report on Form 8-K filed with the U.S. Securities and Exchange Commission on August 21, 2025. On September 26, 2025, Intel Corporation (the “Company”) completed the issuance and sale of 86,956,522 shares of the Company’s common stock, par value $0.001 per share (the “Shares”), to SoftBank Group Corp. (“SoftBank”) at a price per share of $23.00, for an aggregate purchase price in cash of $2.0 billion. The issuance and sale were undertaken pursuant to a Securities Purchase Agreement (the “Purchase Agreement”), dated August 28, 2025, between the Company and Softbank, in a private placement relying upon the exemption provided by Section 4(a)(2) of the Securities Act of 1933 as a transaction not involving a public offering, as previously disclosed by the Company in a Current Report on Form 8-K filed with the U.S. Securities and Exchange Commission on August 21, 2025. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. INTEL CORPORATION(Registrant)Date:September 29, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant)Date:September 29, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant)Date:September 29, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant) INTEL CORPORATION(Registrant) Date:September 29, 2025By:/s/ April Miller Boise /s/ April Miller Boise /s/ April Miller Boise Executive Vice President and Chief Legal Officer Executive Vice President and Chief Legal Officer Executive Vice President and Chief Legal Officer\n"
  }
]