[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.02\nTEXT: Item 2.02 Results of Operations and Financial Condition. Results of Operations and Financial Condition. On October 23, 2025, Intel Corporation (“Intel” or the \"Company\") issued a press release announcing the financial results of its third quarter ended September 27, 2025 and forward-looking statements relating to its fourth quarter of 2025. A copy of this press release is attached hereto as Exhibit 99.1 and is incorporated by reference herein. On October 23, 2025, Intel Corporation (“Intel” or the \"Company\") issued a press release announcing the financial results of its third quarter ended September 27, 2025 and forward-looking statements relating to its fourth quarter of 2025. A copy of this press release is attached hereto as Exhibit 99.1 and is incorporated by reference herein. The attached press release includes non-GAAP financial measures relating to our operations and forecasted outlook. Certain of these non-GAAP measures will be used in Intel’s earnings conference for the third quarter of 2025. In addition, the attached press release includes reconciliations of these non-GAAP measures to GAAP measures, as well as an explanation of how management uses these non-GAAP measures and the reasons why management views these measures as providing useful information for investors. These non-GAAP financial measures should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP, and the financial results calculated in accordance with GAAP and reconciliations to these results should be carefully evaluated. The attached press release includes non-GAAP financial measures relating to our operations and forecasted outlook. Certain of these non-GAAP measures will be used in Intel’s earnings conference for the third quarter of 2025. In addition, the attached press release includes reconciliations of these non-GAAP measures to GAAP measures, as well as an explanation of how management uses these non-GAAP measures and the reasons why management views these measures as providing useful information for investors. These non-GAAP financial measures should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP, and the financial results calculated in accordance with GAAP and reconciliations to these results should be carefully evaluated. The information in\nTEXT: Item 2.02 of this Report and the press release attached hereto as Exhibit 99.1 are furnished and shall not be treated as filed for purposes of the Securities Exchange Act of 1934, as amended. The information in\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. Financial Statements and Exhibits. The following exhibits are provided as part of this Report: The following exhibits are provided as part of this Report: Exhibit NumberDescription99.1Press Release entitled “Intel Reports Third-Quarter 2025 Financial Results” dated September 27, 2025.104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription99.1Press Release entitled “Intel Reports Third-Quarter 2025 Financial Results” dated September 27, 2025.104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription99.1Press Release entitled “Intel Reports Third-Quarter 2025 Financial Results” dated September 27, 2025.104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription 99.1Press Release entitled “Intel Reports Third-Quarter 2025 Financial Results” dated September 27, 2025. Press Release entitled “Intel Reports Third-Quarter 2025 Financial Results” dated September 27, 2025. Press Release entitled “Intel Reports Third-Quarter 2025 Financial Results” dated September 27, 2025. Press Release entitled “Intel Reports Third-Quarter 2025 Financial Results” dated September 27, 2025 Press Release entitled “Intel Reports -Quarter 2025 Financial Results” dated 104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. INTEL CORPORATION(Registrant)Date:October 23, 2025By:/s/ DAVID ZINSNERDavid ZinsnerExecutive Vice President, Chief Financial Officer, andPrincipal Financial Officer INTEL CORPORATION(Registrant)Date:October 23, 2025By:/s/ DAVID ZINSNERDavid ZinsnerExecutive Vice President, Chief Financial Officer, andPrincipal Financial Officer INTEL CORPORATION(Registrant)Date:October 23, 2025By:/s/ DAVID ZINSNERDavid ZinsnerExecutive Vice President, Chief Financial Officer, andPrincipal Financial Officer INTEL CORPORATION(Registrant) INTEL CORPORATION(Registrant) Date:October 23, 2025By:/s/ DAVID ZINSNER Executive Vice President, Chief Financial Officer, andPrincipal Financial Officer Executive Vice President, Chief Financial Officer, andPrincipal Financial Officer Executive Vice President, Chief Financial Officer, and Executive Vice President, Chief Financial Officer, and Principal Financial Officer Principal Financial Officer\n"
  }
]