{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nTABLE: TABLE: Years Ended (In Millions, Except Per Share Amounts) December 31, 2022 December 25, 2021 December 26, 2020; Amount % of NetRevenue Amount % of NetRevenue Amount % of NetRevenue; Net revenue $ 63,054 100.0 % $ 79,024 100.0 % $ 77,867 100.0 %; Cost of sales 36,188 57.4 % 35,209 44.6 % 34,255 44.0 %; Gross margin 26,866 42.6 % 43,815 55.4 % 43,612 56.0 %; Research and development 17,528 27.8 % 15,190 19.2 % 13,556 17.4 %; Marketing, general and administrative 7,002 11.1 % 6,543 8.3 % 6,180 7.9 %; Restructuring and other charges 2 — % 2,626 3.3 % 198 0.3 %; Operating income 2,334 3.7 % 19,456 24.6 % 23,678 30.4 %; Gains (losses) on equity investments, net 4,268 6.8 % 2,729 3.5 % 1,904 2.4 %; Interest and other, net 1,166 1.8 % (482) (0.6) % (504) (0.6) %; Income before taxes 7,768 12.3 % 21,703 27.5 % 25,078 32.2 %; Provision for (benefit from) taxes (249) (0.4) % 1,835 2.3 % 4,179 5.4 %; Net income 8,017 12.7 % 19,868 25.1 % 20,899 26.8 %; Less: Net income attributable to non-controlling interests 3 — — — — —; Net income attributable to Intel $ 8,014 — $ 19,868 — $ 20,899 —; Earnings per share attributable to Intel—diluted $ 1.94 $ 4.86 $ 4.94.\nTITLE: $\nTITLE: 63,054\nTITLE: 100.0\nTITLE: %\nTITLE: 36,188\nTITLE: 57.4\nTITLE: %\nTITLE: 26,866\nTITLE: 42.6\nTITLE: %\nTITLE: 17,528\nTITLE: 27.8\nTITLE: %\nTITLE: 7,002\nTITLE: 11.1\nTITLE: %\nTITLE: 2\nTITLE: —\nTITLE: %\nTITLE: 2,334\nTITLE: 3.7\nTITLE: %\nTITLE: 4,268\nTITLE: 6.8\nTITLE: %\nTITLE: 1,166\nTITLE: 1.8\nTITLE: %\nTITLE: 7,768\nTITLE: 12.3\nTITLE: %\nTITLE: (249)\nTITLE: (0.4)\nTITLE: %\nTITLE: 8,017\nTITLE: 12.7\nTITLE: %\nTITLE: 3\nTITLE: —\nTITLE: $\nTITLE: 8,014\nTITLE: —\nTITLE: $\nTITLE: 1.94\nTITLE: Revenue\nTITLE: Segment Revenue Walk $B\nTITLE: 2022 vs. 2021\nTITLE: 2021 vs. 2020\nTITLE: Gross Margin\nTABLE: TABLE: .\nTITLE: Gross Margin $B\nTABLE: TABLE: $ 26,866 2022 Gross Margin; (4,673) Lower gross margin from CCG revenue, driven by notebook and desktop revenue; (3,330) Lower gross margin from DCAI server revenue; (2,663) Higher unit cost primarily from increased mix of Intel 7 products and 10nm SuperFin; (2,159) Higher period charges primarily driven by inventory reserves taken in 2022; (2,012) Higher period charges primarily associated with the ramp up of Intel 4 and other product enhancements; (1,995) Lower gross margin related to the divested NAND memory business; (723) Optane inventory impairment related to the wind down of our Intel Optane memory business; (584) Lack of revenue recognized in Q1 2021 from a prepaid customer supply contract; (313) Higher stock-based compensation; (423) Higher period charges due to excess capacity charges; (204) Corporate charges from patent settlement; 484 Lower period charges due to a benefit related to insurance proceeds received for business interruption and property damage that occurred in 2020; 522 Higher gross margin from NEX Ethernet revenue; 702 Higher gross margin from DCAI other product revenue; 422 Other; $ 43,815 2021 Gross Margin; 790 Higher gross margin from CCG revenue, driven by desktop revenue partially offset by notebook; 584 Prepaid customer supply agreement settled and recognized to revenue in Q1 2021; 505 Lower unit cost primarily due to cost improvements in 10nm SuperFin; 471 Higher gross margin related to the NAND memory business; 375 Higher gross margin from DCAI other product revenue; 262 Lower period charges due to reserve sell through, partially offset by reserves taken in 2021; 215 Higher gross margin from NEX revenue, primarily driven by Ethernet and Edge; (1,880) Higher period charges primarily associated with ramp up of Intel 4 and subsequent ramp down of 14nm; (725) Lower gross margin from DCAI server revenue; (394) Other; $ 43,612 2020 Gross Margin.\nTITLE: $\nTITLE: 26,866\nTITLE: (4,673)\nTITLE: (3,330)\nTITLE: (2,663)\nTITLE: (2,159)\nTITLE: (2,012)\nTITLE: (1,995)\nTITLE: (723)\nTITLE: (584)\nTITLE: (313)\nTITLE: (423)\nTITLE: (204)\nTITLE: 484\nTITLE: 522\nTITLE: 702\nTITLE: 422\nTITLE: Operating Expenses\nTABLE: TABLE: Research and Development $B Marketing, General and Administrative $B.\nTITLE: Research and Development $B\nTITLE: Marketing, General and Administrative $B\nTITLE: Research and Development\nTABLE: TABLE: + Investments in our process technology; + Increase in corporate spending; + Investments in our businesses to drive strategic growth; - Incentive-based cash compensation; + Investments in our businesses to drive strategic growth; + Investments in our process technology; + Incentive-based cash compensation.\nTITLE: 2022 vs. 2021\nTITLE: 2021 vs. 2020\nTITLE: Marketing, General and Administrative\nTABLE: TABLE: + Increase in corporate spending; - Incentive-based cash compensation; + Increase in corporate spending; + Incentive-based cash compensation.\nTITLE: 2022 vs. 2021\nTITLE: 2021 vs. 2020\nTITLE: Restructuring and Other Charges\nTABLE: TABLE: Years Ended (In Millions) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020; Employee severance and benefit arrangements $ 1,038 $ 48 $ 124; Litigation charges and other (1,187) 2,291 67; Asset impairment charges 151 287 7; Total restructuring and other charges $ 2 $ 2,626 $ 198.\nTITLE: $\nTITLE: 1,038\nTITLE: (1,187)\nTITLE: 151\nTITLE: $\nTITLE: 2\nTITLE: Gains (Losses) on Equity Investments and Interest and Other, Net\nTABLE: TABLE: Years Ended (In Millions) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020; Ongoing mark-to-market adjustments on marketable equity securities $ (787) $ (130) $ (133); Observable price adjustments on non-marketable equity securities 299 750 176; Impairment charges (190) (154) (303); Sale of equity investments and other 4,946 2,263 2,164; Gains (losses) on equity investments, net $ 4,268 $ 2,729 $ 1,904; Interest and other, net $ 1,166 $ (482) $ (504).\nTITLE: $\nTITLE: (787)\nTITLE: 299\nTITLE: (190)\nTITLE: 4,946\nTITLE: $\nTITLE: 4,268\nTITLE: $\nTITLE: 1,166\nTITLE: Gains (Losses) on Equity Investments, Net\nTITLE: Interest and Other, Net\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nTITLE: Provision for (Benefit from) Taxes\nTABLE: TABLE: Years Ended (Dollars in Millions) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020; Income before taxes $ 7,768 $ 21,703 $ 25,078; Provision for (benefit from) taxes $ (249) $ 1,835 $ 4,179; Effective tax rate (3.2) % 8.5 % 16.7 %.\nTITLE: $\nTITLE: 7,768\nTITLE: $\nTITLE: (249)\nTITLE: (3.2)\nTITLE: %\nTITLE: Liquidity and Capital Resources\nTABLE: TABLE: (In Millions) Dec 31, 2022 Dec 25, 2021; Cash and cash equivalents $ 11,144 $ 4,827; Short-term investments 17,194 24,426; Loans receivable and other 463 240; Total cash and investments1 $ 28,801 $ 29,493; Total debt $ 42,051 $ 38,101.\nTITLE: $\nTITLE: 11,144\nTITLE: 17,194\nTITLE: 463\nTITLE: $\nTITLE: 28,801\nTITLE: $\nTITLE: 42,051\nTABLE: TABLE: Years Ended (In Millions) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020; Net cash provided by operating activities $ 15,433 $ 29,456 $ 35,864; Net cash used for investing activities (10,477) (24,449) (21,524); Net cash provided by (used for) financing activities 1,361 (6,045) (12,669); Net increase (decrease) in cash and cash equivalents $ 6,317 $ (1,038) $ 1,671.\nTITLE: $\nTITLE: 15,433\nTITLE: (10,477)\nTITLE: 1,361\nTITLE: $\nTITLE: 6,317\nTITLE: Operating Activities\nTITLE: Investing Activities\nTITLE: Financing Activities\nTITLE: Critical Accounting Estimates\nTITLE: ▪\nTITLE: Inventories\nTITLE: ▪\nTITLE: Long-lived assets\nTITLE: ▪\nTITLE: Non-marketable equity investments\nTITLE: ▪\nTITLE: Loss contingencies\nTITLE: Non-GAAP Financial Measures\nTABLE: TABLE: Non-GAAP adjustment or measure Definition Usefulness to management and investors; NAND memory business We completed the first closing of the divestiture of our NAND memory business to SK hynix on December 29, 2021 and fully deconsolidated our ongoing interests in the NAND OpCo Business in the first quarter of 2022. We exclude the impact of our NAND memory business in certain non-GAAP measures. While the second closing of the sale is still pending and subject to closing conditions, we deconsolidated this business in Q1 2022 and management does not view the historical results of the business as a part of our core operations. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model and how management currently evaluates core operational performance. In making these adjustments, we have not made any changes to our methods for measuring and calculating revenue or other financial statement amounts..\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nTABLE: TABLE: Non-GAAP adjustment or measure Definition Usefulness to management and investors; Acquisition-related adjustments Amortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology, brands, and customer relationships acquired in connection with business combinations. Charges related to the amortization of these intangibles are recorded within both cost of sales and MG&A in our US GAAP financial statements. Amortization charges are recorded over the estimated useful life of the related acquired intangible asset, and thus are generally recorded over multiple years. We exclude amortization charges for our acquisition-related intangible assets for purposes of calculating certain non-GAAP measures because these charges are inconsistent in size and are significantly impacted by the timing and valuation of our acquisitions. These adjustments facilitate a useful evaluation of our current operating performance and comparison to our past operating performance and provide investors with additional means to evaluate cost and expense trends.; Share-based compensation Share-based compensation consists of charges related to our employee equity incentive plans. We exclude charges related to share-based compensation for purposes of calculating certain non-GAAP measures because we believe these adjustments provide better comparability to peer company results and because these charges are not viewed by management as part of our core operating performance. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model, how management currently evaluates core operational performance, and additional means to evaluate expense trends, including in comparison to other peer companies.; Patent settlement A portion of the charge from our IP settlements represents a catch-up of cumulative amortization that would have been incurred for the right to use the related patents in prior periods. This charge related to prior periods is excluded from our non-GAAP results; amortization related to the right to use the patents in the current and ongoing periods is included. We exclude the catch-up charge related to prior periods for purposes of calculating certain non-GAAP measures because this adjustment facilitates comparison to past operating results and provides a useful evaluation of our current operating performance.; Optane inventory impairment Beginning in 2022, we initiated the wind-down of our Intel Optane memory business. We exclude these impairments for purposes of calculating certain non-GAAP measures because these charges do not reflect our current operating performance. This adjustment facilitates a useful evaluation of our current operating performance and comparisons to past operating results.; Restructuring and other charges Restructuring charges are costs associated with a formal restructuring plan and are primarily related to employee severance and benefit arrangements. Other charges include a benefit in Q1 2022 related to the annulled EC fine, a charge in Q1 2021 related to the VLSI litigation, periodic goodwill and asset impairments, certain pension charges, and costs associated with restructuring activity. We exclude restructuring and other charges, including any adjustments to charges recorded in prior periods, for purposes of calculating certain non-GAAP measures because these costs do not reflect our core operating performance. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends.; (Gains) losses on equity investments, net (Gains) losses on equity investments, net consists of ongoing mark-to-market adjustments on marketable equity securities, observable price adjustments on non-marketable equity securities, related impairment charges, and the sale of equity investments and other. We exclude these non-operating gains and losses for purposes of calculating certain non-GAAP measures because it provides better comparability between periods. The exclusion reflects how management evaluates the core operations of the business.; Gains (losses) from divestiture Gains (losses) are recognized at the close of a divestiture, or over a specified deferral period when deferred consideration is received at the time of closing. Based on our ongoing obligation under the NAND wafer manufacturing and sale agreement entered into in connection with the first closing of the sale of our NAND memory business on December 29, 2021, a portion of the initial closing consideration was deferred and will be recognized between first and second closing. We exclude gains or losses resulting from divestitures for purposes of calculating certain non-GAAP measures because they do not reflect our current operating performance. These adjustments facilitate a useful evaluation of our current operating performance and comparisons to past operating results..\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nTABLE: TABLE: Non-GAAP adjustment or measure Definition Usefulness to management and investors; Tax Reform Adjustments for Tax Reform reflect the impact of a change in tax law from 2017 Tax Reform related to the capitalization of R&D costs. We exclude the impacts of this 2022 change in US tax treatment of R&D costs for purposes of calculating certain non-GAAP measures as we believe these adjustments facilitate a better evaluation of our current operating performance and comparison to past operating results.; Adjusted free cash flow We reference a non-GAAP financial measure of adjusted free cash flow, which is used by management when assessing our sources of liquidity, capital resources, and quality of earnings. Adjusted free cash flow is operating cash flow adjusted for (1) additions to property, plant and equipment, net of proceeds from capital grants and partner contributions, (2) payments on finance leases, and (3) proceeds from the McAfee equity sale. This non-GAAP financial measure is helpful in understanding our capital requirements and sources of liquidity by providing an additional means to evaluate the cash flow trends of our business. Since the 2017 divestiture, McAfee equity distributions and sales have contributed to operating and free cash flow, and while the McAfee equity sale in Q1 2022 would typically be excluded from adjusted free cash flow as an equity sale, we believe including the sale proceeds in adjusted free cash flow facilitate a better, more consistent comparison to past presentations of liquidity.; Total cash and investments Total cash and investments is used by management when assessing our sources of liquidity, which include cash and cash equivalents, short-term investments, and loans receivable and other. This non-GAAP measure is helpful in understanding our capital resources and liquidity position..\nTABLE: TABLE: Years Ended (In Millions, Except Per Share Amounts) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020; Net revenue $ 63,054 $ 79,024 $ 77,867; NAND memory business — (4,306) (4,967); Non-GAAP net revenue $ 63,054 $ 74,718 $ 72,900; Gross margin percentage 42.6 % 55.4 % 56.0 %; Acquisition-related adjustments 2.1 % 1.6 % 1.6 %; Share-based compensation 1.0 % 0.4 % 0.4 %; Patent settlement 0.3 % — % — %; Optane inventory impairment 1.1 % — % — %; NAND memory business — % 0.6 % 1.8 %; Non-GAAP gross margin percentage 47.3 % 58.1 % 59.8 %; Earnings per share—diluted1 $ 1.94 $ 4.86 $ 4.94; Acquisition-related adjustments 0.37 0.36 0.33; Share-based compensation 0.76 0.50 0.44; Patent settlement 0.05 — —; Optane inventory impairment 0.18 — —; Restructuring and other charges — 0.64 0.05; (Gains) losses on equity investments, net (1.04) (0.67) (0.45); (Gains) losses from divestiture (0.28) — —; NAND memory business — (0.33) (0.22); Tax Reform (0.20) — —; Income tax effects 0.06 (0.06) (0.03); Non-GAAP earnings per share—diluted $ 1.84 $ 5.30 $ 5.06.\nTITLE: $\nTITLE: 63,054\nTITLE: —\nTITLE: $\nTITLE: 63,054\nTITLE: 42.6\nTITLE: %\nTITLE: 2.1\nTITLE: %\nTITLE: 1.0\nTITLE: %\nTITLE: 0.3\nTITLE: %\nTITLE: 1.1\nTITLE: %\nTITLE: —\nTITLE: %\nTITLE: 47.3\nTITLE: %\nTITLE: $\nTITLE: 1.94\nTITLE: 0.37\nTITLE: 0.76\nTITLE: 0.05\nTITLE: 0.18\nTITLE: —\nTITLE: (1.04)\nTITLE: (0.28)\nTITLE: —\nTITLE: (0.20)\nTITLE: 0.06\nTITLE: $\nTITLE: 1.84\nTABLE: TABLE: Years Ended (In Millions) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020 Dec 28, 2019 Dec 29, 2018; Net cash provided by operating activities $ 15,433 $ 29,456 $ 35,864 $ 32,618 $ 29,757; Net additions to property, plant, and equipment (23,724) (18,567) (14,086) (15,948) (14,649); Payments on finance leases (345) — — — —; Sale of equity investment 4,561 — — — —; Adjusted free cash flow $ (4,075) $ 10,889 $ 21,778 $ 16,670 $ 15,108; Net cash used for investing activities $ (10,477) $ (24,449) $ (21,524) $ (13,579) $ (11,638); Net cash provided by (used for) financing activities $ 1,361 $ (6,045) $ (12,669) $ (17,864) $ (18,533).\nTITLE: $\nTITLE: 15,433\nTITLE: (23,724)\nTITLE: (345)\nTITLE: 4,561\nTITLE: $\nTITLE: (4,075)\nTITLE: $\nTITLE: (10,477)\nTITLE: $\nTITLE: 1,361\nTITLE: Sales and Marketing\nTITLE: Customers\nTITLE: Sales Arrangements\nTITLE: Distribution\nTITLE: Seasonal Trends\nTITLE: Marketing\nTITLE: Quantitative and Qualitative Disclosures About Market Risk\nTITLE: Currency Exchange Rates\nTITLE: Interest Rates\nTITLE: Equity Prices\nTITLE: Commodity Price Risk\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nTABLE: TABLE: Years Ended (In Millions, Except Per Share Amounts) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020; Net revenue $ 63,054 $ 79,024 $ 77,867; Cost of sales 36,188 35,209 34,255; Gross margin 26,866 43,815 43,612; Research and development 17,528 15,190 13,556; Marketing, general and administrative 7,002 6,543 6,180; Restructuring and other charges 2 2,626 198; Operating expenses 24,532 24,359 19,934; Operating income 2,334 19,456 23,678; Gains (losses) on equity investments, net 4,268 2,729 1,904; Interest and other, net 1,166 (482) (504); Income before taxes 7,768 21,703 25,078; Provision for (benefit from) taxes (249) 1,835 4,179; Net income 8,017 19,868 20,899; Less: Net income attributable to non-controlling interests 3 — —; Net income attributable to Intel $ 8,014 $ 19,868 $ 20,899; Earnings per share attributable to Intel—basic $ 1.95 $ 4.89 $ 4.98; Earnings per share attributable to Intel—diluted $ 1.94 $ 4.86 $ 4.94; Basic 4,108 4,059 4,199; Diluted 4,123 4,090 4,232.\nTITLE: $\nTITLE: 63,054\nTITLE: 36,188\nTITLE: 26,866\nTITLE: 17,528\nTITLE: 7,002\nTITLE: 2\nTITLE: 24,532\nTITLE: 2,334\nTITLE: 4,268\nTITLE: 1,166\nTITLE: 7,768\nTITLE: (249)\nTITLE: 8,017\nTITLE: 3\nTITLE: $\nTITLE: 8,014\nTITLE: $\nTITLE: 1.95\nTITLE: $\nTITLE: 1.94\nTITLE: 4,108\nTITLE: 4,123\nTABLE: TABLE: Years Ended (In Millions) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020; Net income $ 8,017 $ 19,868 $ 20,899; Net unrealized holding gains (losses) on derivatives (510) (520) 677; Actuarial valuation and other pension benefits (expenses), net 855 451 (183); Translation adjustments and other (27) (60) 35; Other comprehensive income (loss) 318 (129) 529; Total comprehensive income 8,335 19,739 21,428; Less: Comprehensive income attributable to non-controlling interests 3 — —; Total comprehensive income attributable to Intel $ 8,332 $ 19,739 $ 21,428.\nTITLE: $\nTITLE: 8,017\nTITLE: (510)\nTITLE: 855\nTITLE: (27)\nTITLE: 318\nTITLE: 8,335\nTITLE: 3\nTITLE: $\nTITLE: 8,332\nTABLE: TABLE: (In Millions, Except Par Value) Dec 31, 2022 Dec 25, 2021; Cash and cash equivalents $ 11,144 $ 4,827; Short-term investments 17,194 24,426; Accounts receivable, net 4,133 9,457; Inventories 13,224 10,776; Assets held for sale 45 6,942; Other current assets 4,667 2,130; Total current assets 50,407 58,558; Property, plant and equipment, net 80,860 63,245; Equity investments 5,912 6,298; Goodwill 27,591 26,963; Identified intangible assets, net 6,018 7,270; Other long-term assets 11,315 6,072; Total assets $ 182,103 $ 168,406; Short-term debt $ 4,367 $ 4,591; Accounts payable 9,595 5,747; Accrued compensation and benefits 4,084 4,535; Income taxes payable 2,251 1,076; Other accrued liabilities 11,858 11,513; Total current liabilities 32,155 27,462; Debt 37,684 33,510; Long-term income taxes payable 3,796 4,305; Deferred income taxes 202 2,667; Other long-term liabilities 4,980 5,071; Preferred stock, $0.001 par value, 50 shares authorized; none issued — —; Common stock, $0.001 par value, 10,000 shares authorized; 4,137 shares issued and outstanding (4,070 issued and outstanding in 2021) and capital in excess of par value 31,580 28,006; Accumulated other comprehensive income (loss) (562) (880); Retained earnings 70,405 68,265; Total Intel stockholders' equity 101,423 95,391; Non-controlling interests 1,863 —; Total stockholders’ equity 103,286 95,391; Total liabilities and stockholders' equity $ 182,103 $ 168,406.\nTITLE: $\nTITLE: 11,144\nTITLE: 17,194\nTITLE: 4,133\nTITLE: 13,224\nTITLE: 45\nTITLE: 4,667\nTITLE: 50,407\nTITLE: 80,860\nTITLE: 5,912\nTITLE: 27,591\nTITLE: 6,018\nTITLE: 11,315\nTITLE: $\nTITLE: 182,103\nTITLE: $\nTITLE: 4,367\nTITLE: 9,595\nTITLE: 4,084\nTITLE: 2,251\nTITLE: 11,858\nTITLE: 32,155\nTITLE: 37,684\nTITLE: 3,796\nTITLE: 202\nTITLE: 4,980\nTITLE: —\nTITLE: 31,580\nTITLE: (562)\nTITLE: 70,405\nTITLE: 101,423\nTITLE: 1,863\nTITLE: 103,286\nTITLE: $\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nTITLE: 182,103\nTABLE: TABLE: Years Ended (In Millions) Dec 31, 2022 Dec 25, 2021 Dec 26, 2020; Cash and cash equivalents, beginning of period $ 4,827 $ 5,865 $ 4,194; Net income 8,017 19,868 20,899; Depreciation 11,128 9,953 10,482; Share-based compensation 3,128 2,036 1,854; Restructuring and other charges 1,074 2,626 198; Amortization of intangibles 1,907 1,839 1,757; (Gains) losses on equity investments, net (4,254) (1,458) (1,757); (Gains) losses on divestitures (1,059) — (30); Accounts receivable 5,327 (2,674) 883; Inventories (2,436) (2,339) (687); Accounts payable (29) 1,190 405; Accrued compensation and benefits (1,533) 515 348; Prepaid customer supply agreements (24) (1,583) (181); Income taxes (4,535) (441) 1,620; Other assets and liabilities (1,278) (76) 73; Total adjustments 7,416 9,588 14,965; Net cash provided by operating activities 15,433 29,456 35,864; Additions to property, plant and equipment (24,844) (18,733) (14,259); Additions to held for sale NAND property, plant and equipment (206) (1,596) (194); Purchase of short-term investments (43,647) (40,554) (29,239); Maturities and sales of short-term investments 48,730 35,299 22,158; Purchases of equity investments (510) (613) (720); Sales of equity investments 4,961 581 910; Proceeds from divestitures 6,579 — 123; Other investing (1,540) 1,167 (303); Net cash used for investing activities (10,477) (24,449) (21,524); Issuance of commercial paper, net of issuance costs 3,945 — —; Payments on finance leases (345) — —; Partner contributions 874 — —; Proceeds from Mobileye IPO 1,032 — —; Issuance of term debt, net of issuance costs 6,548 4,974 10,247; Repayment of term debt and debt conversions (4,984) (2,500) (4,525); Proceeds from sales of common stock through employee equity incentive plans 977 1,020 897; Repurchase of common stock — (2,415) (14,229); Payment of dividends to stockholders (5,997) (5,644) (5,568); Other financing (689) (1,480) 509; Net cash provided by (used for) financing activities 1,361 (6,045) (12,669); Net increase (decrease) in cash and cash equivalents 6,317 (1,038) 1,671; Cash and cash equivalents, end of period $ 11,144 $ 4,827 $ 5,865; Acquisition of property, plant and equipment included in accounts payable and accrued liabilities $ 5,431 $ 1,619 $ 2,973; Interest, net of capitalized interest $ 459 $ 545 $ 594; Income taxes, net of refunds $ 4,282 $ 2,263 $ 2,436.\nTITLE: Dec 31, 2022\nTITLE: $\nTITLE: 4,827\nTITLE: 8,017\nTITLE: 11,128\nTITLE: 3,128\nTITLE: 1,074\nTITLE: 1,907\nTITLE: (4,254)\nTITLE: (1,059)\nTITLE: 5,327\nTITLE: (2,436)\nTITLE: (29)\nTITLE: (1,533)\nTITLE: (24)\nTITLE: (4,535)\nTITLE: (1,278)\nTITLE: 7,416\nTITLE: 15,433\nTITLE: (24,844)\nTITLE: (206)\nTITLE: (43,647)\nTITLE: 48,730\nTITLE: (510)\nTITLE: 4,961\nTITLE: 6,579\nTITLE: (1,540)\nTITLE: (10,477)\nTITLE: 3,945\nTITLE: (345)\nTITLE: 874\nTITLE: 1,032\nTITLE: 6,548\nTITLE: (4,984)\nTITLE: 977\nTITLE: —\nTITLE: (5,997)\nTITLE: (689)\nTITLE: 1,361\nTITLE: 6,317\nTITLE: $\nTITLE: 11,144\nTITLE: $\nTITLE: 5,431\nTITLE: $\nTITLE: 459\nTITLE: $\nTITLE: 4,282\nTABLE: TABLE: Common Stock and Capitalin Excess of Par Value AccumulatedOtherComprehensiveIncome (Loss) RetainedEarnings Non-Controlling Interests Total; (In Millions, Except Per Share Amounts) Number ofShares Amount; Balance as of December 28, 2019 4,290 $ 25,261 $ (1,280) $ 53,523 — $ 77,504; Net income — — — 20,899 — 20,899; Other comprehensive income (loss) — — 529 — — 529; Total comprehensive income 21,428; Employee equity incentive plans and other 55 1,018 — — — 1,018; Share-based compensation — 1,854 — — — 1,854; Temporary equity reduction — 155 — — — 155; Convertible debt — (750) — — — (750); Repurchase of common stock (275) (1,628) — (12,481) — (14,109); Restricted stock unit withholdings (8) (354) — (140) — (494); Cash dividends declared ($1.32 per share of common stock) — — — (5,568) — (5,568); Balance as of December 26, 2020 4,062 25,556 (751) 56,233 — 81,038; Adjustment to opening balance from change in accounting principle 35 35; Opening balance as of December 27, 2020 4,062 25,556 (751) 56,268 — 81,073; Net income — — — 19,868 — 19,868; Other comprehensive income (loss) — — (129) — — (129); Total comprehensive income 19,739; Employee equity incentive plans and other 54 1,022 — — — 1,022; Share-based compensation — 2,036 — — — 2,036; Repurchase of common stock (40) (249) — (2,166) — (2,415); Restricted stock unit withholdings (6) (359) — (61) — (420); Cash dividends declared ($1.39 per share of common stock) — — — (5,644) — (5,644); Balance as of December 25, 2021 4,070 28,006 (880) 68,265 — 95,391; Net income — — — 8,014 3 8,017; Other comprehensive income (loss) — — 318 — — 318; Total comprehensive income 8,335; Net proceeds received from IPO and partner contributions — 75 — — 1,831 1,906; Employee equity incentive plans and other 79 1,009 — — — 1,009; Share-based compensation — 3,099 — — 29 3,128; Restricted stock unit withholdings (12) (609) — 123 — (486); Cash dividends declared ($1.46 per share of common stock) — — — (5,997) — (5,997); Balance as of December 31, 2022 4,137 $ 31,580 $ (562) $ 70,405 $ 1,863 $ 103,286.\nTITLE: —\nTITLE: 8,014\nTITLE: 3\nTITLE: 8,017\nTITLE: —\nTITLE: 318\nTITLE: —\nTITLE: 318\nTITLE: 8,335\nTITLE: —\nTITLE: 75\nTITLE: —\nTITLE: 1,831\nTITLE: 1,906\nTITLE: 79\nTITLE: 1,009\nTITLE: —\nTITLE: 1,009\nTITLE: —\nTITLE: 3,099\nTITLE: —\nTITLE: 29\nTITLE: 3,128\nTITLE: (12)\nTITLE: (609)\nTITLE: —\nTITLE: 123\nTITLE: —\nTITLE: (486)\nTITLE: —\nTITLE: (5,997)\nTITLE: —\nTITLE: (5,997)\nTITLE: 4,137\nTITLE: $\nTITLE: 31,580\nTITLE: $\nTITLE: (562)\nTITLE: $\nTITLE: 70,405\nTITLE: $\nTITLE: 1,863\nTITLE: $\nTITLE: 103,286\n"
    }
  ]
}