[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.01\nTEXT: Item 2.01 Completion of Acquisition or Disposition of Assets. As previously disclosed, on April 14, 2025, Intel Corporation (“Intel”), Intel Americas, Inc. (“Intel Americas” and together with Intel, the “Sellers”), Altera Corporation, at the time a wholly owned subsidiary of Intel (“Altera”), and an affiliate of Silver Lake (“Purchaser”), entered into a transaction agreement (as amended, supplemented or otherwise modified from time to time, the “Transaction Agreement”), pursuant to which Intel would sell a majority interest in its Altera business to the Purchaser (the “Transaction”). As previously disclosed, on April 14, 2025, Intel Corporation (“Intel”), Intel Americas, Inc. (“Intel Americas” and together with Intel, the “Sellers”), Altera Corporation, at the time a wholly owned subsidiary of Intel (“Altera”), and an affiliate of Silver Lake (“Purchaser”), entered into a transaction agreement (as amended, supplemented or otherwise modified from time to time, the “Transaction Agreement”), pursuant to which Intel would sell a majority interest in its Altera business to the Purchaser (the “Transaction”). Following the satisfaction of the closing conditions of the Transaction Agreement, the closing of the Transaction was consummated on September 12, 2025, at which time: (i) the Purchaser acquired 51% of the equity interests of Altera for an equity value of approximately $3.3 billion, with Intel retaining the remaining 49% interest; (ii) each of Intel and the Purchaser contributed such equity interests in Altera to a newly formed limited partnership (the “Partnership”); and (iii) Intel and the Purchaser entered into an amended and restated limited partnership agreement (the “LPA”) in substantially the same form as previously described in Intel’s Current Report on Form 8-K filed with the Securities and Exchange Commission (the “SEC”) on April 17, 2025 and filed with Intel’s Quarterly Report on Form 10-Q for the quarterly period ended June 28, 2025 filed with the SEC on July 24, 2025. The LPA sets forth each party’s rights and responsibilities with respect to the Partnership and respective interests in the Partnership. Following the satisfaction of the closing conditions of the Transaction Agreement, the closing of the Transaction was consummated on September 12, 2025, at which time: (i) the Purchaser acquired 51% of the equity interests of Altera for an equity value of approximately $3.3 billion, with Intel retaining the remaining 49% interest; (ii) each of Intel and the Purchaser contributed such equity interests in Altera to a newly formed limited partnership (the “Partnership”); and (iii) Intel and the Purchaser entered into an amended and restated limited partnership agreement (the “LPA”) in substantially the same form as previously described in Intel’s Current Report on Form 8-K filed with the Securities and Exchange Commission (the “SEC”) on April 17, 2025 and filed with Intel’s Quarterly Report on Form 10-Q for the quarterly period ended June 28, 2025 filed with the SEC on July 24, 2025. The LPA sets forth each party’s rights and responsibilities with respect to the Partnership and respective interests in the Partnership.\n"
  },
  {
    "cluster": 2,
    "content": "TITLE: Item 7.01\nTEXT: Item 7.01 Regulation FD Disclosure. Intel’s consolidated financial statements for Q3 2025 will reflect Altera’s results from June 29, 2025 through September 11, 2025. Intel will account for its minority investment in Altera under the equity method of accounting upon the closing of the Transaction on September 12, 2025. Intel’s consolidated financial statements for Q3 2025 will reflect Altera’s results from June 29, 2025 through September 11, 2025. Intel will account for its minority investment in Altera under the equity method of accounting upon the closing of the Transaction on September 12, 2025. Altera's results as a segment of Intel in the first half of 2025 included gross margin of 55% on revenue of $816 million, with operating expenses of $356 million. Intel has revised its full-year 2025 non-GAAP operating expense target to $16.8 billion (from $17 billion) to reflect the deconsolidation of Altera. Intel’s full-year 2026 operating expense target of $16 billion remains unchanged. Altera's results as a segment of Intel in the first half of 2025 included gross margin of 55% on revenue of $816 million, with operating expenses of $356 million. Intel has revised its full-year 2025 non-GAAP operating expense target to $16.8 billion (from $17 billion) to reflect the deconsolidation of Altera. Intel’s full-year 2026 operating expense target of $16 billion remains unchanged. Non-GAAP Financial Measures Non-GAAP Financial Measures In addition to disclosing financial results in accordance with US GAAP, this document references targets for non-GAAP operating expenses. Non-GAAP operating expenses refers to non-GAAP R&D and marketing, general and administrative (MG&A). We believe these non-GAAP financial measures provide investors with useful supplemental information about our operating performance, enable comparison of financial trends and results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect to key metrics used by management in operating our business and measuring our performance. In addition to disclosing financial results in accordance with US GAAP, this document references targets for non-GAAP operating expenses. Non-GAAP operating expenses refers to non-GAAP R&D and marketing, general and administrative (MG&A). We believe these non-GAAP financial measures provide investors with useful supplemental information about our operating performance, enable comparison of financial trends and results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect to key metrics used by management in operating our business and measuring our performance. Set forth below are reconciliations of non-GAAP operating expenses to the most directly comparable US GAAP financial measure, GAAP operating expenses. These non-GAAP financial measures should not be considered a substitute for, or superior to, financial measures calculated in accordance with US GAAP, and the reconciliations should be carefully evaluated. Set forth below are reconciliations of non-GAAP operating expenses to the most directly comparable US GAAP financial measure, GAAP operating expenses. These non-GAAP financial measures should not be considered a substitute for, or superior to, financial measures calculated in accordance with US GAAP, and the reconciliations should be carefully evaluated. (In Billions; Unaudited)Full-Year 2025Full-Year 2026ApproximatelyApproximatelyGAAP operating expenses$21.9 $19.0 Acquisition-related adjustments(0.1)(0.1)Share-based compensation(2.5)(2.9)Restructuring and other charges(2.5)— Non-GAAP operating expenses$16.8 $16.0 (In Billions; Unaudited)Full-Year 2025Full-Year 2026ApproximatelyApproximatelyGAAP operating expenses$21.9 $19.0 Acquisition-related adjustments(0.1)(0.1)Share-based compensation(2.5)(2.9)Restructuring and other charges(2.5)— Non-GAAP operating expenses$16.8 $16.0 (In Billions; Unaudited)Full-Year 2025Full-Year 2026ApproximatelyApproximatelyGAAP operating expenses$21.9 $19.0 Acquisition-related adjustments(0.1)(0.1)Share-based compensation(2.5)(2.9)Restructuring and other charges(2.5)— Non-GAAP operating expenses$16.8 $16.0 (In Billions; Unaudited)Full-Year 2025Full-Year 2026 (In Billions; Unaudited) (In Billions; Unaudited) (In Billions; Unaudited) ApproximatelyApproximately GAAP operating expenses$21.9 $19.0 GAAP operating expenses GAAP operating expenses GAAP operating expenses Acquisition-related adjustments(0.1)(0.1) Acquisition-related adjustments Acquisition-related adjustments Share-based compensation(2.5)(2.9) Share-based compensation Share-based compensation Restructuring and other charges(2.5)— Restructuring and other charges Restructuring and other charges Restructuring and other charges Non-GAAP operating expenses$16.8 $16.0 Non-GAAP operating expenses Non-GAAP operating expenses Non-GAAP operating expenses Our non-GAAP financial measures reflect adjustments based on one or more of the following items: Our non-GAAP financial measures reflect adjustments based on one or more of the following items: Non-GAAP adjustment or measureDefinition Usefulness to management and investorsAcquisition-related adjustmentsAmortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology, brands, and customer relationships acquired in connection with business combinations. Charges related to the amortization of these intangibles are recorded within both cost of sales and MG&A in our US GAAP financial statements. Amortization charges are recorded over the estimated useful life of the related acquired intangible asset, and thus are generally recorded over multiple years.We exclude amortization charges for our acquisition-related intangible assets for purposes of calculating certain non-GAAP measures because these charges are inconsistent in size and are significantly impacted by the timing and valuation of our acquisitions. These adjustments facilitate a useful evaluation of our current operating performance and comparison to our past operating performance and provide investors with additional means to evaluate cost and expense trends.Share-based compensationShare-based compensation consists of charges related to our employee equity incentive plans.We exclude charges related to share-based compensation for purposes of calculating certain non-GAAP measures because we believe these adjustments provide comparability to peer company results and because these charges are not viewed by management as part of our core operating performance. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model, how management currently evaluates core operational performance, and additional means to evaluate expense trends, including in comparison to other peer companies.Restructuring and other chargesRestructuring charges are costs associated with restructuring plans and are primarily related to employee severance and benefit arrangements. Other charges include periodic goodwill and asset impairments, and other costs associated with certain non-core activities.We exclude restructuring and other charges, including any adjustments to charges recorded in prior periods, for purposes of calculating certain non-GAAP measures because these costs do not reflect our core operating performance. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends. Non-GAAP adjustment or measureDefinition Usefulness to management and investorsAcquisition-related adjustmentsAmortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology, brands, and customer relationships acquired in connection with business combinations. Charges related to the amortization of these intangibles are recorded within both cost of sales and MG&A in our US GAAP financial statements. Amortization charges are recorded over the estimated useful life of the related acquired intangible asset, and thus are generally recorded over multiple years.We exclude amortization charges for our acquisition-related intangible assets for purposes of calculating certain non-GAAP measures because these charges are inconsistent in size and are significantly impacted by the timing and valuation of our acquisitions. These adjustments facilitate a useful evaluation of our current operating performance and comparison to our past operating performance and provide investors with additional means to evaluate cost and expense trends.Share-based compensationShare-based compensation consists of charges related to our employee equity incentive plans.We exclude charges related to share-based compensation for purposes of calculating certain non-GAAP measures because we believe these adjustments provide comparability to peer company results and because these charges are not viewed by management as part of our core operating performance. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model, how management currently evaluates core operational performance, and additional means to evaluate expense trends, including in comparison to other peer companies.Restructuring and other chargesRestructuring charges are costs associated with restructuring plans and are primarily related to employee severance and benefit arrangements. Other charges include periodic goodwill and asset impairments, and other costs associated with certain non-core activities.We exclude restructuring and other charges, including any adjustments to charges recorded in prior periods, for purposes of calculating certain non-GAAP measures because these costs do not reflect our core operating performance. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends. Non-GAAP adjustment or measureDefinition Usefulness to management and investorsAcquisition-related adjustmentsAmortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology, brands, and customer relationships acquired in connection with business combinations. Charges related to the amortization of these intangibles are recorded within both cost of sales and MG&A in our US GAAP financial statements. Amortization charges are recorded over the estimated useful life of the related acquired intangible asset, and thus are generally recorded over multiple years.We exclude amortization charges for our acquisition-related intangible assets for purposes of calculating certain non-GAAP measures because these charges are inconsistent in size and are significantly impacted by the timing and valuation of our acquisitions. These adjustments facilitate a useful evaluation of our current operating performance and comparison to our past operating performance and provide investors with additional means to evaluate cost and expense trends.Share-based compensationShare-based compensation consists of charges related to our employee equity incentive plans.We exclude charges related to share-based compensation for purposes of calculating certain non-GAAP measures because we believe these adjustments provide comparability to peer company results and because these charges are not viewed by management as part of our core operating performance. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model, how management currently evaluates core operational performance, and additional means to evaluate expense trends, including in comparison to other peer companies.Restructuring and other chargesRestructuring charges are costs associated with restructuring plans and are primarily related to employee severance and benefit arrangements. Other charges include periodic goodwill and asset impairments, and other costs associated with certain non-core activities.We exclude restructuring and other charges, including any adjustments to charges recorded in prior periods, for purposes of calculating certain non-GAAP measures because these costs do not reflect our core operating performance. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends. Non-GAAP adjustment or measureDefinition Usefulness to management and investors Non-GAAP adjustment or measure Non-GAAP adjustment or measure Usefulness to management and investors Usefulness to management and investors Acquisition-related adjustmentsAmortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology, brands, and customer relationships acquired in connection with business combinations. Charges related to the amortization of these intangibles are recorded within both cost of sales and MG&A in our US GAAP financial statements. Amortization charges are recorded over the estimated useful life of the related acquired intangible asset, and thus are generally recorded over multiple years.We exclude amortization charges for our acquisition-related intangible assets for purposes of calculating certain non-GAAP measures because these charges are inconsistent in size and are significantly impacted by the timing and valuation of our acquisitions. These adjustments facilitate a useful evaluation of our current operating performance and comparison to our past operating performance and provide investors with additional means to evaluate cost and expense trends. Acquisition-related adjustments Acquisition-related adjustments Amortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology, brands, and customer relationships acquired in connection with business combinations. Charges related to the amortization of these intangibles are recorded within both cost of sales and MG&A in our US GAAP financial statements. Amortization charges are recorded over the estimated useful life of the related acquired intangible asset, and thus are generally recorded over multiple years. Amortization of acquisition-related intangible assets consists of amortization of intangible assets such as developed technology, brands, and customer relationships acquired in connection with business combinations. Charges related to the amortization of these intangibles are recorded within both cost of sales and MG&A in our US GAAP financial statements. Amortization charges are recorded over the estimated useful life of the related acquired intangible asset, and thus are generally recorded over multiple years. We exclude amortization charges for our acquisition-related intangible assets for purposes of calculating certain non-GAAP measures because these charges are inconsistent in size and are significantly impacted by the timing and valuation of our acquisitions. These adjustments facilitate a useful evaluation of our current operating performance and comparison to our past operating performance and provide investors with additional means to evaluate cost and expense trends. We exclude amortization charges for our acquisition-related intangible assets for purposes of calculating certain non-GAAP measures because these charges are inconsistent in size and are significantly impacted by the timing and valuation of our acquisitions. These adjustments facilitate a useful evaluation of our current operating performance and comparison to our past operating performance and provide investors with additional means to evaluate cost and expense trends. Share-based compensationShare-based compensation consists of charges related to our employee equity incentive plans.We exclude charges related to share-based compensation for purposes of calculating certain non-GAAP measures because we believe these adjustments provide comparability to peer company results and because these charges are not viewed by management as part of our core operating performance. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model, how management currently evaluates core operational performance, and additional means to evaluate expense trends, including in comparison to other peer companies. Share-based compensation Share-based compensation Share-based compensation consists of charges related to our employee equity incentive plans. Share-based compensation consists of charges related to our employee equity incentive plans. We exclude charges related to share-based compensation for purposes of calculating certain non-GAAP measures because we believe these adjustments provide comparability to peer company results and because these charges are not viewed by management as part of our core operating performance. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model, how management currently evaluates core operational performance, and additional means to evaluate expense trends, including in comparison to other peer companies. We exclude charges related to share-based compensation for purposes of calculating certain non-GAAP measures because we believe these adjustments provide comparability to peer company results and because these charges are not viewed by management as part of our core operating performance. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model, how management currently evaluates core operational performance, and additional means to evaluate expense trends, including in comparison to other peer companies. Restructuring and other chargesRestructuring charges are costs associated with restructuring plans and are primarily related to employee severance and benefit arrangements. Other charges include periodic goodwill and asset impairments, and other costs associated with certain non-core activities.We exclude restructuring and other charges, including any adjustments to charges recorded in prior periods, for purposes of calculating certain non-GAAP measures because these costs do not reflect our core operating performance. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends. Restructuring and other charges Restructuring and other charges Restructuring charges are costs associated with restructuring plans and are primarily related to employee severance and benefit arrangements. Other charges include periodic goodwill and asset impairments, and other costs associated with certain non-core activities. Restructuring charges are costs associated with restructuring plans and are primarily related to employee severance and benefit arrangements. Other charges include periodic goodwill and asset impairments, and other costs associated with certain non-core activities. Restructuring charges are costs associated with restructuring plans and are primarily related to employee severance and benefit arrangements. Other charges include periodic goodwill and asset impairments, and other costs associated with certain non-core activities. We exclude restructuring and other charges, including any adjustments to charges recorded in prior periods, for purposes of calculating certain non-GAAP measures because these costs do not reflect our core operating performance. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends. We exclude restructuring and other charges, including any adjustments to charges recorded in prior periods, for purposes of calculating certain non-GAAP measures because these costs do not reflect our core operating performance. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends. Forward-Looking Statements Forward-Looking Statements This report contains forward-looking statements as to Intel’s expectations regarding its non-GAAP operating expenses in future periods. Such statements involve many risks and uncertainties that could cause our actual results to differ materially from those expressed or implied, including those associated with: This report contains forward-looking statements as to Intel’s expectations regarding its non-GAAP operating expenses in future periods. Such statements involve many risks and uncertainties that could cause our actual results to differ materially from those expressed or implied, including those associated with: ▪the high level of competition and rapid technological change in our industry; the high level of competition and rapid technological change in our industry; ▪the significant long-term and inherently risky investments we are making in R&D and manufacturing facilities that may not realize a favorable return; the significant long-term and inherently risky investments we are making in R&D and manufacturing facilities that may not realize a favorable return; ▪the complexities and uncertainties in developing and implementing new semiconductor products and manufacturing process technologies; the complexities and uncertainties in developing and implementing new semiconductor products and manufacturing process technologies; ▪our ability to time and scale our capital investments appropriately and successfully secure favorable alternative financing arrangements and government grants; our ability to time and scale our capital investments appropriately and successfully secure favorable alternative financing arrangements and government grants; ▪implementing new business strategies and investing in new businesses and technologies; implementing new business strategies and investing in new businesses and technologies; ▪changes in demand for our products; changes in demand for our products; ▪macroeconomic conditions and geopolitical tensions and conflicts, including geopolitical and trade tensions between the US and China, the impacts of Russia's war on Ukraine, tensions and conflict affecting Israel and the Middle East, and rising tensions between mainland China and Taiwan; macroeconomic conditions and geopolitical tensions and conflicts, including geopolitical and trade tensions between the US and China, the impacts of Russia's war on Ukraine, tensions and conflict affecting Israel and the Middle East, and rising tensions between mainland China and Taiwan; ▪the evolving market for products with AI capabilities; the evolving market for products with AI capabilities; ▪our complex global supply chain supporting our manufacturing facilities and incorporating external foundries, our complex global supply chain supporting our manufacturing facilities and incorporating external foundries, including from disruptions, delays, trade tensions and conflicts, or shortages; including from disruptions, delays, trade tensions and conflicts, or shortages; ▪recently elevated geopolitical tensions, volatility and uncertainty with respect to international trade policies, including tariffs and export controls, impacting our business, the markets in which we compete and the world economy; recently elevated geopolitical tensions, volatility and uncertainty with respect to international trade policies, including tariffs and export controls, impacting our business, the markets in which we compete and the world economy; ▪product defects, errata and other product issues, particularly as we develop next-generation products and implement next-generation manufacturing process technologies; product defects, errata and other product issues, particularly as we develop next-generation products and implement next-generation manufacturing process technologies; ▪potential security vulnerabilities in our products; potential security vulnerabilities in our products; ▪increasing and evolving cybersecurity threats and privacy risks; increasing and evolving cybersecurity threats and privacy risks; ▪IP risks including related litigation and regulatory proceedings; IP risks including related litigation and regulatory proceedings; ▪the need to attract, retain, and motivate key talent; the need to attract, retain, and motivate key talent; ▪strategic transactions and investments; strategic transactions and investments; ▪sales-related risks, including customer concentration and the use of distributors and other third parties; sales-related risks, including customer concentration and the use of distributors and other third parties; ▪our significantly reduced return of capital in recent years; our significantly reduced return of capital in recent years; ▪our debt obligations and our ability to access sources of capital; our debt obligations and our ability to access sources of capital; ▪complex and evolving laws and regulations across many jurisdictions; complex and evolving laws and regulations across many jurisdictions; ▪fluctuations in currency exchange rates; fluctuations in currency exchange rates; ▪changes in our effective tax rate; changes in our effective tax rate; ▪catastrophic events; ▪environmental, health, safety, and product regulations; environmental, health, safety, and product regulations; ▪our initiatives and new legal requirements with respect to corporate responsibility matters; and our initiatives and new legal requirements with respect to corporate responsibility matters; and ▪other risks and uncertainties described in this release, our 2024 Form 10-K, our Q1 2025 Form 10-Q, our Q2 2025 Form 10-Q, and our other filings with the SEC. other risks and uncertainties described in this release, our 2024 Form 10-K, our Q1 2025 Form 10-Q, our Q2 2025 Form 10-Q, and our other filings with the SEC. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. Readers are urged to carefully review and consider the various disclosures made in this release and in other documents we file from time to time with the SEC that disclose risks and uncertainties that may affect our business. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. Readers are urged to carefully review and consider the various disclosures made in this release and in other documents we file from time to time with the SEC that disclose risks and uncertainties that may affect our business. Unless specifically indicated otherwise, the forward-looking statements in this release do not reflect the potential impact of any divestitures, mergers, acquisitions, or other business combinations that have not been completed as of the date of this filing. In addition, the forward-looking statements in this release are based on management's expectations as of the date of this release, unless an earlier date is specified, including expectations based on third-party information and projections that management believes to be reputable. We do not undertake, and expressly disclaim any duty, to update such statements, whether as a result of new information, new developments, or otherwise, except to the extent that disclosure may be required by law. Unless specifically indicated otherwise, the forward-looking statements in this release do not reflect the potential impact of any divestitures, mergers, acquisitions, or other business combinations that have not been completed as of the date of this filing. In addition, the forward-looking statements in this release are based on management's expectations as of the date of this release, unless an earlier date is specified, including expectations based on third-party information and projections that management believes to be reputable. We do not undertake, and expressly disclaim any duty, to update such statements, whether as a result of new information, new developments, or otherwise, except to the extent that disclosure may be required by law.\n"
  },
  {
    "cluster": 3,
    "content": "TITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. Financial Statements and Exhibits. The following exhibits are provided as part of this report: The following exhibits are provided as part of this report: Exhibit NumberDescription104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Exhibit NumberDescription 104Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Cover Page Interactive Data File, formatted in Inline XBRL and included as Exhibit 101. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. INTEL CORPORATION(Registrant)Date:September 15, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant)Date:September 15, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant)Date:September 15, 2025By:/s/ April Miller BoiseApril Miller BoiseExecutive Vice President and Chief Legal Officer INTEL CORPORATION(Registrant) INTEL CORPORATION(Registrant) Date:September 15, 2025By:/s/ April Miller Boise /s/ April Miller Boise /s/ April Miller Boise Executive Vice President and Chief Legal Officer Executive Vice President and Chief Legal Officer Executive Vice President and Chief Legal Officer\n"
  }
]