[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.02\nTEXT: Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers On September 8, 2025, Johnson & Johnson (the Company) announced that John Morikis was elected to the Board of Directors. The Board has determined that Mr. Morikis satisfies the applicable independence requirements of the NYSE Listed Company Manual. Mr. Morikis will serve on the Audit Committee and Compensation & Benefits Committee. On September 8, 2025, Johnson & Johnson (the Company) announced that John Morikis was elected to the Board of Directors. The Board has determined that Mr. Morikis satisfies the applicable independence requirements of the NYSE Listed Company Manual. Mr. Morikis will serve on the Audit Committee and Compensation & Benefits Committee. As a non-employee director of the Company, Mr. Morikis will receive compensation as described in the Director Compensation section of the Company’s 2025 Proxy Statement. As a non-employee director of the Company, Mr. Morikis will receive compensation as described in the Director Compensation section of the Company’s 2025 Proxy Statement. Mr. Morikis served as the Executive Chairman, President and Chief Executive Officer of The Sherwin-Williams Company from 2016 to 2024. He joined Sherwin-Williams in 1984 as a management trainee in the Paint Stores Group. Over the next four decades, he advanced through key leadership roles, including Division President and Group President. From 2006 to 2016, Mr. Morikis served as President and Chief Operating Officer. Mr. Morikis served as the Executive Chairman, President and Chief Executive Officer of The Sherwin-Williams Company from 2016 to 2024. He joined Sherwin-Williams in 1984 as a management trainee in the Paint Stores Group. Over the next four decades, he advanced through key leadership roles, including Division President and Group President. From 2006 to 2016, Mr. Morikis served as President and Chief Operating Officer. The Company’s press release announcing the appointment is attached to this Report as Exhibit 99.1. The Company’s press release announcing the appointment is attached to this Report as Exhibit 99.1.\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial statements and exhibits Exhibit No.Description of Exhibit99.1Press Release dated September 8, 2025104The cover page from this Current Report on Form 8-K, formatted in Inline XBRL. Exhibit No.Description of Exhibit99.1Press Release dated September 8, 2025104The cover page from this Current Report on Form 8-K, formatted in Inline XBRL. Exhibit No.Description of Exhibit99.1Press Release dated September 8, 2025104The cover page from this Current Report on Form 8-K, formatted in Inline XBRL. Exhibit No.Description of Exhibit Description of Exhibit Description of Exhibit 99.1Press Release dated September 8, 2025 Press Release dated September 8, 2025 Press Release dated September 8, 2025 Press Release dated September 8, 2025 Press Release dated September 8, 2025 104The cover page from this Current Report on Form 8-K, formatted in Inline XBRL. The cover page from this Current Report on Form 8-K, formatted in Inline XBRL. The cover page from this Current Report on Form 8-K, formatted in Inline XBRL. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Date: September 8, 2025JOHNSON & JOHNSON(Registrant)By:/s/ Marc LarkinsMarc LarkinsSecretary Date: September 8, 2025 Date: September 8, 2025 Date: September 8, 2025 JOHNSON & JOHNSON(Registrant)By:/s/ Marc LarkinsMarc LarkinsSecretary JOHNSON & JOHNSON(Registrant)By:/s/ Marc LarkinsMarc LarkinsSecretary JOHNSON & JOHNSON(Registrant)By:/s/ Marc LarkinsMarc LarkinsSecretary JOHNSON & JOHNSON(Registrant)By:/s/ Marc LarkinsMarc LarkinsSecretary Marc LarkinsSecretary Marc LarkinsSecretary\n"
  }
]