[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.02\nTEXT: Item 5.02(b) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 7, 2025, Todd A. Combs notified JPMorgan Chase & Co. (the \"Company\") of his intention to resign as a member of the Board of Directors, effective December 7, 2025. Mr. Combs’ resignation is not the result of any disagreement with the Company. On December 7, 2025, Todd A. Combs notified JPMorgan Chase & Co. (the \"Company\") of his intention to resign as a member of the Board of Directors, effective December 7, 2025. Mr. Combs’ resignation is not the result of any disagreement with the Company.\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits Exhibit No.Description of Exhibit101Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL (Inline eXtensible Business Reporting Language).104Cover Page Interactive Data File (embedded within the Inline XBRL document and included in Exhibit 101). Exhibit No.Description of Exhibit101Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL (Inline eXtensible Business Reporting Language).104Cover Page Interactive Data File (embedded within the Inline XBRL document and included in Exhibit 101). Exhibit No.Description of Exhibit101Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL (Inline eXtensible Business Reporting Language).104Cover Page Interactive Data File (embedded within the Inline XBRL document and included in Exhibit 101). Exhibit No.Description of Exhibit Description of Exhibit Description of Exhibit 101Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL (Inline eXtensible Business Reporting Language). Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL (Inline eXtensible Business Reporting Language). Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL (Inline eXtensible Business Reporting Language). 104Cover Page Interactive Data File (embedded within the Inline XBRL document and included in Exhibit 101). Cover Page Interactive Data File (embedded within the Inline XBRL document and included in Exhibit 101). Cover Page Interactive Data File (embedded within the Inline XBRL document and included in Exhibit 101). Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. JPMorgan Chase & Co.(Registrant) JPMorgan Chase & Co.(Registrant) JPMorgan Chase & Co.(Registrant) By:/s/ Reid R. BrodaReid R. BrodaCorporate Secretary By:/s/ Reid R. BrodaReid R. BrodaCorporate Secretary By:/s/ Reid R. BrodaReid R. BrodaCorporate Secretary Dated:December 8, 2025 Dated:December 8, 2025 Dated:December 8, 2025 Dated:December 8, 2025\n"
  }
]