[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.02\nTEXT: Item 2.02. Results of Operations and Financial Condition. Results of Operations and Financial Condition. Attached as Exhibit 99.1 is a copy of a press release of The Coca-Cola Company (“company”), dated October 21, 2025, reporting the Company’s financial results for the third quarter 2025. The information in this\nTEXT: Item 2.02, including the Exhibit 99.1 attached hereto, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, except as shall be expressly set forth by specific reference in such filing. Attached as Exhibit 99.1 is a copy of a press release of The Coca-Cola Company (“company”), dated October 21, 2025, reporting the Company’s financial results for the third quarter 2025. The information in this\nTITLE: Item 9.01\nTEXT: Item 9.01(d). Financial Statements and Exhibits. Financial Statements and Exhibits. Exhibit No.DescriptionExhibit 99.1Press Release of The Coca-Cola Company, dated October 21, 2025, reportingThe Coca-Cola Company’s financial results for the third quarter 2025.Exhibit 104Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Exhibit No.DescriptionExhibit 99.1Press Release of The Coca-Cola Company, dated October 21, 2025, reportingThe Coca-Cola Company’s financial results for the third quarter 2025.Exhibit 104Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Exhibit No.DescriptionExhibit 99.1Press Release of The Coca-Cola Company, dated October 21, 2025, reportingThe Coca-Cola Company’s financial results for the third quarter 2025.Exhibit 104Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Exhibit No.Description Exhibit 99.1Press Release of The Coca-Cola Company, dated October 21, 2025, reportingThe Coca-Cola Company’s financial results for the third quarter 2025. Press Release of The Coca-Cola Company, dated October 21, 2025, reportingThe Coca-Cola Company’s financial results for the third quarter 2025. Press Release of The Coca-Cola Company, dated October 21, 2025, reporting Press Release of The Coca-Cola Company, dated October 21, 2025, reporting Press Release of The Coca-Cola Company, dated The Coca-Cola Company’s financial results for the third quarter 2025. The Coca-Cola Company’s financial results for the third quarter 2025. The Coca-Cola Company’s financial results for the Exhibit 104Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized. THE COCA-COLA COMPANY(REGISTRANT)Date: October 21, 2025By:/s/ ERIN L. MAYErin L. MaySenior Vice President, Controller and Chief Accounting Officer THE COCA-COLA COMPANY(REGISTRANT)Date: October 21, 2025By:/s/ ERIN L. MAYErin L. MaySenior Vice President, Controller and Chief Accounting Officer THE COCA-COLA COMPANY(REGISTRANT)Date: October 21, 2025By:/s/ ERIN L. MAYErin L. MaySenior Vice President, Controller and Chief Accounting Officer THE COCA-COLA COMPANY(REGISTRANT) THE COCA-COLA COMPANY(REGISTRANT) THE COCA-COLA COMPANY(REGISTRANT) Date: October 21, 2025By:/s/ ERIN L. MAY Date: October 21, 2025 Date: October 21, 2025 Date: October 21, 2025 Erin L. MaySenior Vice President, Controller and Chief Accounting Officer Erin L. MaySenior Vice President, Controller and Chief Accounting Officer Erin L. MaySenior Vice President, Controller and Chief Accounting Officer\n"
  }
]