[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.02\nTEXT: Item 5.02.Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 10, 2025, the Board of Directors (the “Board”) of The Coca-Cola Company (the “Company”) elected Henrique Braun, Executive Vice President and Chief Operating Officer, as Chief Executive Officer of the Company, effective March 31, 2026, on which date James Quincey, the Company’s current Chief Executive Officer, will transition to Executive Chairman. The Board also intends to nominate Mr. Braun to stand for election as a director at the 2026 Annual Meeting of Shareowners. Henrique Braun, age 57, was appointed Executive Vice President and Chief Operating Officer of the Company in January 2025, overseeing all the Company’s operating units worldwide. He has served as Executive Vice President since 2024. From 2023 to 2024, Mr. Braun served as Senior Vice President and President, International Development, overseeing seven of the Company’s nine operating units. Mr. Braun served as President of the Latin America operating unit from 2020 to 2022, and as President of the Brazil business unit from 2016 to 2020. From 2013 to 2016, Mr. Braun was President of the Greater China and Korea business unit. Mr. Braun joined the Company in 1996. He will continue to serve as Executive Vice President and Chief Operating Officer until his appointment to Chief Executive Officer. A copy of the press release issued by the Company is furnished with this report as Exhibit 99.1.\nTITLE: Item 9.01\nTEXT: Item 9.01(d).Financial Statements and Exhibits. Financial Statements and Exhibits. Financial Statements and Exhibits. Financial Statements and Exhibits. Exhibit No. Description Exhibit 99.1 Press Release of The Coca-Cola Company, dated December 10, 2025. Exhibit 104 Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Exhibit No. Description Exhibit 99.1 Press Release of The Coca-Cola Company, dated December 10, 2025. Exhibit 104 Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Exhibit No. Description Exhibit 99.1 Press Release of The Coca-Cola Company, dated December 10, 2025. Press Release of The Coca-Cola Company, dated December 10, 2025. Press Release of The Coca-Cola Company, dated December 10, 2025. Press Release of The Coca-Cola Company, dated December 10, 2025. Exhibit 104 Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Cover Page Interactive Data File (the cover page XBRL tags are embedded within the iXBRL document). Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. THE COCA-COLA COMPANY (REGISTRANT) Date: December 10, 2025 By: /s/ Monica Howard Douglas Monica Howard Douglas Executive Vice President and Global General Counsel THE COCA-COLA COMPANY (REGISTRANT) Date: December 10, 2025 By: /s/ Monica Howard Douglas Monica Howard Douglas Executive Vice President and Global General Counsel THE COCA-COLA COMPANY THE COCA-COLA COMPANY THE COCA-COLA COMPANY THE COCA-COLA COMPANY Date: December 10, 2025 By: /s/ Monica Howard Douglas Date: December 10, 2025 Date: December 10, 2025 /s/ Monica Howard Douglas /s/ Monica Howard Douglas Monica Howard Douglas Monica Howard Douglas Monica Howard Douglas Executive Vice President and Global General Counsel Executive Vice President and Global General Counsel Executive Vice President and Global General Counsel\n"
  }
]