[
  {
    "cluster": 1,
    "content": "TITLE: Item 8.01\nTEXT: Item 8.01 Other Events. On September 23, 2025, Morgan Stanley, a Delaware corporation, approved a Form of Master Note to be used in connection with offerings of certain debt securities of Global Medium-Term Notes, Series I that may be issued under the Senior Indenture among Morgan Stanley, as issuer, and The Bank of New York Mellon, as trustee, dated November 1, 2004 (as previously supplemented and amended). A copy of such form is attached as Exhibit 4.1 hereto. On September 23, 2025, Morgan Stanley Finance LLC, a Delaware limited liability company, approved a Form of Master Note to be used in connection with offerings of certain debt securities of Global Medium-Term Notes, Series A that may be issued under the Senior Indenture among Morgan Stanley Finance LLC, as issuer, Morgan Stanley, as guarantor, and The Bank of New York Mellon, as trustee, dated February 16, 2016 (as previously supplemented and amended). A copy of such form is attached as Exhibit 4.2 hereto.\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. The following exhibits are part of this Report on Form 8-K: 4.1 Form of Master Note for Morgan Stanley Global Medium-Term Notes, Series I. 4.2 Form of Master Note for Morgan Stanley Finance LLC Global Medium-Term Notes, Series A. 5 Opinion of Davis Polk & Wardwell LLP. 23 Consent of Davis Polk & Wardwell LLP (included in Exhibit 5 hereto). 101 Interactive Data Files pursuant to Rule 406 of Regulation S-T formatted in Inline eXtensible Business Reporting Language (“Inline XBRL”). 104 Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101). 4.1 Form of Master Note for Morgan Stanley Global Medium-Term Notes, Series I. 4.2 Form of Master Note for Morgan Stanley Finance LLC Global Medium-Term Notes, Series A. 5 Opinion of Davis Polk & Wardwell LLP. 23 Consent of Davis Polk & Wardwell LLP (included in Exhibit 5 hereto). 101 Interactive Data Files pursuant to Rule 406 of Regulation S-T formatted in Inline eXtensible Business Reporting Language (“Inline XBRL”). 104 Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101). 4.1 Form of Master Note for Morgan Stanley Global Medium-Term Notes, Series I. Form of Master Note for Morgan Stanley Global Medium-Term Notes, Series I. Form of Master Note for Morgan Stanley Global Medium-Term Notes, Series I. 4.2 Form of Master Note for Morgan Stanley Finance LLC Global Medium-Term Notes, Series A. Form of Master Note for Morgan Stanley Finance LLC Global Medium-Term Notes, Series A. Form of Master Note for Morgan Stanley Finance LLC Global Medium-Term Notes, Series A. 5 Opinion of Davis Polk & Wardwell LLP. Opinion of Davis Polk & Wardwell LLP. Opinion of Davis Polk & Wardwell LLP. 23 Consent of Davis Polk & Wardwell LLP (included in Exhibit 5 hereto). Consent of Davis Polk & Wardwell LLP (included in Exhibit 5 hereto). 101 Interactive Data Files pursuant to Rule 406 of Regulation S-T formatted in Inline eXtensible Business Reporting Language (“Inline XBRL”). Interactive Data Files pursuant to Rule 406 of Regulation S-T formatted in Inline eXtensible Business Reporting Language (“Inline XBRL”). 104 Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101). Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101). Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, hereunto duly authorized. Date: September 23, 2025 Date: September 23, 2025 Date: September 23, 2025 MORGAN STANLEY By: /s/ Kevin Sheehan Name: Kevin Sheehan Title: Assistant Treasurer MORGAN STANLEY By: /s/ Kevin Sheehan Name: Kevin Sheehan Title: Assistant Treasurer By: /s/ Kevin Sheehan Title: Assistant Treasurer MORGAN STANLEY FINANCE LLC By: /s/ Aaron Page Name: Aaron Page Title: Secretary and Counsel MORGAN STANLEY FINANCE LLC By: /s/ Aaron Page Name: Aaron Page Title: Secretary and Counsel MORGAN STANLEY FINANCE LLC MORGAN STANLEY FINANCE LLC Title: Secretary and Counsel Secretary and Counsel Secretary and Counsel\n"
  }
]