[
  {
    "cluster": 1,
    "content": "TITLE: Item 8.01\nTEXT: Item 8.01 Other Events. The Federal Reserve announced today that it has reduced Morgan Stanley’s (the “Company”) Stress Capital Buffer (“SCB”) from 5.1% to 4.3%, effective on October 1, 2025 in response to the Company seeking reconsideration of its preliminary SCB announced in June 2025. Together with other features of the regulatory capital framework, this SCB results in an aggregate U.S. Basel III Standardized Approach Common Equity Tier 1 (“CET1”) ratio of 11.8%. The Company’s U.S. Basel III Standardized Approach CET1 ratio was 15.0% as of June 30, 2025. A copy of the Company’s press release relating to this announcement is attached as Exhibit 99.1 hereto and is incorporated herein by reference.\nTITLE: Item 9.01\nTEXT: Item 9.01. Financial Statements and Exhibits. (d) Exhibits Exhibit Number Description 99.1 Press Release of the Company, dated September 30, 2025. 101 Interactive Data Files pursuant to Rule 406 of Regulation S-T formatted in Inline eXtensible Business Reporting Language (“Inline XBL”). 104 Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101).\nTEXT: Item 9.01. Financial Statements and Exhibits. Financial Statements and Exhibits. Financial Statements and Exhibits. 99.1 Press Release of the Company, dated September 30, 2025. Press Release of the Company, dated September 30, 2025. Press Release of the Company, dated September 30, 2025. Press Release of the Company, dated September 30, 2025. Press Release of the Company, dated September 30, 2025. 101 Interactive Data Files pursuant to Rule 406 of Regulation S-T formatted in Inline eXtensible Business Reporting Language (“Inline XBL”). Interactive Data Files pursuant to Rule 406 of Regulation S-T formatted in Inline eXtensible Business Reporting Language (“Inline XBL”). 104 Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101). Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101). Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, hereunto duly authorized. MORGAN STANLEY (Registrant) Date: September 30, 2025 By: /s/ Martin M. Cohen Name: Martin M. Cohen Title: Corporate Secretary MORGAN STANLEY (Registrant) Date: September 30, 2025 By: /s/ Martin M. Cohen Name: Martin M. Cohen Title: Corporate Secretary MORGAN STANLEY (Registrant) MORGAN STANLEY (Registrant) Date: September 30, 2025 By: /s/ Martin M. Cohen Name: Martin M. Cohen Title: Corporate Secretary\n"
  }
]