[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.03\nTEXT: Item 5.03 Amendments to Articles of Incorporation or Bylaws; Change in Fiscal Year. On October 30, 2025, Netflix, Inc. (the “Company”) announced a ten-for-one forward stock split (the “Stock Split”) of the Company’s issued common stock. On November 14, 2025, the Company filed an amendment (the “Amendment”) to the Company’s Amended and Restated Certificate of Incorporation with the Secretary of State of the State of Delaware to effect the Stock Split and proportionately increase the number of shares of the Company’s authorized common stock from 4,990,000,000 to 49,900,000,000. The Amendment, which became effective at 4:01 p.m. Eastern Time on November 14, 2025, is filed as Exhibit 3.1 to this Current Report on Form 8-K. On October 30, 2025, Netflix, Inc. (the “Company”) announced a ten-for-one forward stock split (the “Stock Split”) of the Company’s issued common stock. On November 14, 2025, the Company filed an amendment (the “Amendment”) to the Company’s Amended and Restated Certificate of Incorporation with the Secretary of State of the State of Delaware to effect the Stock Split and proportionately increase the number of shares of the Company’s authorized common stock from 4,990,000,000 to 49,900,000,000. The Amendment, which became effective at 4:01 p.m. Eastern Time on November 14, 2025, is filed as Exhibit 3.1 to this Current Report on Form 8-K. Trading is expected to commence on a split-adjusted basis at market open on November 17, 2025. Trading is expected to commence on a split-adjusted basis at market open on November 17, 2025.\nTITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. Exhibit NumberDescription of Exhibit3.1Certificate of Amendment of Amended and Restated Certificate of Incorporation104Cover Page Interactive Data File (embedded within the Inline XBRL document) Exhibit NumberDescription of Exhibit3.1Certificate of Amendment of Amended and Restated Certificate of Incorporation104Cover Page Interactive Data File (embedded within the Inline XBRL document) Exhibit NumberDescription of Exhibit3.1Certificate of Amendment of Amended and Restated Certificate of Incorporation104Cover Page Interactive Data File (embedded within the Inline XBRL document) Exhibit NumberDescription of Exhibit Description of Exhibit Description of Exhibit 3.1Certificate of Amendment of Amended and Restated Certificate of Incorporation Certificate of Amendment of Amended and Restated Certificate of Incorporation Certificate of Amendment of Amended and Restated Certificate of Incorporation Certificate of Amendment of Amended and Restated Certificate of Incorporation Certificate of Amendment of Amended and Restated Certificate of Incorporation 104Cover Page Interactive Data File (embedded within the Inline XBRL document) Cover Page Interactive Data File (embedded within the Inline XBRL document) Cover Page Interactive Data File (embedded within the Inline XBRL document) Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. NETFLIX, INC.Date:November 14, 2025/s/ David HymanDavid HymanChief Legal Officer and Secretary NETFLIX, INC.Date:November 14, 2025/s/ David HymanDavid HymanChief Legal Officer and Secretary NETFLIX, INC.Date:November 14, 2025/s/ David HymanDavid HymanChief Legal Officer and Secretary Date:November 14, 2025 Chief Legal Officer and Secretary Chief Legal Officer and Secretary Chief Legal Officer and Secretary\n"
  }
]