[
  {
    "cluster": 1,
    "content": "TITLE: Item 1.01\nTEXT: Item 1.01 Entry into a Material Definitive Agreement. Agreement and Plan of Merger On December 4, 2025, Netflix, Inc., a Delaware corporation (“Netflix”), Nightingale Sub, Inc., a Delaware corporation and wholly owned subsidiary of Netflix (“Merger Sub”), Warner Bros. Discovery, Inc., a Delaware corporation (“WBD”), and New Topco 25, Inc., a newly formed Delaware corporation and wholly owned subsidiary of WBD (“Newco”), entered into an Agreement and Plan of Merger (the “Merger Agreement”), pursuant to which, subject to the terms of the Merger Agreement, among other things, (i) a newly formed Delaware corporation and wholly owned subsidiary of Newco will merge with and into WBD (the “Holdco Merger”) in accordance with Section 251(g) of the General Corporation Law of the State of Delaware, with WBD surviving as a wholly owned subsidiary of Newco and with the stockholders of WBD immediately prior to the effective time of the Holdco Merger becoming the stockholders of Newco at and immediately following the effective time of the Holdco Merger, and (ii) following an internal reorganization and the separation and distribution of WBD’s Global Linear Networks business and certain other assets as further described below, as a result of which WBD will hold the Streaming & Studios businesses of WBD (the “Retained Business”), Merger Sub will merge with and into WBD, with WBD surviving as a wholly owned subsidiary of Netflix (the “Merger”). The Boards of Directors of Netflix and WBD have unanimously approved the Merger Agreement, including the Merger and the other transactions contemplated thereby. For the avoidance of doubt, all references to WBD with respect to a matter occurring after the completion of the Holdco Merger will be deemed to be references to Newco. Separation and Distribution Prior to the consummation of the Merger, WBD and a newly formed subsidiary of WBD (“SpinCo”) will enter into a Separation and Distribution Agreement (the “Separation and Distribution Agreement”), pursuant to which WBD will, among other things, engage in an internal reorganization, including the Holdco Merger, whereby it will transfer to SpinCo its Global Linear Networks business and certain other assets, and SpinCo will assume from WBD certain liabilities associated with such business (the “Separation”). WBD will retain the Retained Business, and all other assets and liabilities not transferred to SpinCo, including WBD’s Streaming & Studios businesses. Following the Separation and prior to the Merger, WBD will distribute all of the issued and outstanding common stock of SpinCo to the holders of outstanding shares of WBD common stock, par value $0.01 per share (the “WBD Common Stock”), on a pro rata basis (the “Distribution”) in accordance with the terms and subject to the conditions of the Separation and Distribution Agreement. In connection with the transactions contemplated by the Separation and Distribution Agreement, WBD and SpinCo will enter into certain additional agreements, including an Employee Matters Agreement, an Intellectual Property Matters Agreement, a Tax Matters Agreement and a Transition Services Agreement, which will govern certain rights, responsibilities and obligations of WBD and SpinCo, respectively, with respect to the subject matter applicable therein in connection with the Separation and the Distribution. At the effective time of the Distribution, WBD will use commercially reasonable efforts to cause the net debt of SpinCo to equal a specified amount of indebtedness, which may be reduced by WBD in its sole discretion, resulting in a dollar-for-dollar reduction to the price per share of WBD Common Stock payable by Netflix at the effective time of the Merger (the “Effective Time”) (such reduction, the “Net Debt Adjustment”). Effect on Capital Stock Following the consummation of the Separation and the Distribution, at the Effective Time, subject to the terms and conditions of the Merger Agreement, each share of WBD Common Stock issued and outstanding immediately prior to the Effective Time (other than shares of WBD Common Stock to be canceled in accordance with the Merger Agreement or as to which appraisal rights have been properly exercised) shall be converted into the right to receive (i) an amount in cash equal to $23.25, without interest (the “Cash Consideration”), and (ii) such number of validly issued, fully paid and nonassessable shares of common stock of Netflix, par value $0.001 per share (the “Buyer Common Stock”) equal to the Exchange Ratio (“Stock Consideration” and together with the Cash Consideration, the “Merger Consideration”), plus cash in lieu of any fractional shares to which such share would otherwise be entitled. The “Exchange Ratio” will be determined based on the per share volume-weighted average trading price of Buyer Common Stock for the fifteen (15) consecutive trading days ending on (and including) the trading day that is three (3) trading days prior to the closing date of the Merger (the “Average Buyer Stock Price”), and which will be (x) 0.0376, if the Average Buyer Stock Price is equal to or greater than $119.67, (y) the quotient obtained by dividing $4.50 by the Average Buyer Stock Price if the Average Buyer Stock Price is greater than $97.91 but less than $119.67 and (z) 0.0460, if the Average Buyer Stock Price is less than or equal to $97.91, in each case, subject to any Net Debt Adjustment.\nTEXT: Item 1.01 Entry into a Material Definitive Agreement. Agreement and Plan of Merger Agreement and Plan of Merger On December 4, 2025, Netflix, Inc., a Delaware corporation (“Netflix”), Nightingale Sub, Inc., a Delaware corporation and wholly owned subsidiary of Netflix (“Merger Sub”), Warner Bros. Discovery, Inc., a Delaware corporation (“WBD”), and New Topco 25, Inc., a newly formed Delaware corporation and wholly owned subsidiary of WBD (“Newco”), entered into an Agreement and Plan of Merger (the “Merger Agreement”), pursuant to which, subject to the terms of the Merger Agreement, among other things, (i) a newly formed Delaware corporation and wholly owned subsidiary of Newco will merge with and into WBD (the “Holdco Merger”) in accordance with Section 251(g) of the General Corporation Law of the State of Delaware, with WBD surviving as a wholly owned subsidiary of Newco and with the stockholders of WBD immediately prior to the effective time of the Holdco Merger becoming the stockholders of Newco at and immediately following the effective time of the Holdco Merger, and (ii) following an internal reorganization and the separation and distribution of WBD’s Global Linear Networks business and certain other assets as further described below, as a result of which WBD will hold the Streaming & Studios businesses of WBD (the “Retained Business”), Merger Sub will merge with and into WBD, with WBD surviving as a wholly owned subsidiary of Netflix (the “Merger”). The Boards of Directors of Netflix and WBD have unanimously approved the Merger Agreement, including the Merger and the other transactions contemplated thereby. For the avoidance of doubt, all references to WBD with respect to a matter occurring after the completion of the Holdco Merger will be deemed to be references to Newco. Separation and Distribution Separation and Distribution Prior to the consummation of the Merger, WBD and a newly formed subsidiary of WBD (“SpinCo”) will enter into a Separation and Distribution Agreement (the “Separation and Distribution Agreement”), pursuant to which WBD will, among other things, engage in an internal reorganization, including the Holdco Merger, whereby it will transfer to SpinCo its Global Linear Networks business and certain other assets, and SpinCo will assume from WBD certain liabilities associated with such business (the “Separation”). WBD will retain the Retained Business, and all other assets and liabilities not transferred to SpinCo, including WBD’s Streaming & Studios businesses. Following the Separation and prior to the Merger, WBD will distribute all of the issued and outstanding common stock of SpinCo to the holders of outstanding shares of WBD common stock, par value $0.01 per share (the “WBD Common Stock”), on a pro rata basis (the “Distribution”) in accordance with the terms and subject to the conditions of the Separation and Distribution Agreement. In connection with the transactions contemplated by the Separation and Distribution Agreement, WBD and SpinCo will enter into certain additional agreements, including an Employee Matters Agreement, an Intellectual Property Matters Agreement, a Tax Matters Agreement and a Transition Services Agreement, which will govern certain rights, responsibilities and obligations of WBD and SpinCo, respectively, with respect to the subject matter applicable therein in connection with the Separation and the Distribution. At the effective time of the Distribution, WBD will use commercially reasonable efforts to cause the net debt of SpinCo to equal a specified amount of indebtedness, which may be reduced by WBD in its sole discretion, resulting in a dollar-for-dollar reduction to the price per share of WBD Common Stock payable by Netflix at the effective time of the Merger (the “Effective Time”) (such reduction, the “Net Debt Adjustment”). Effect on Capital Stock Effect on Capital Stock Following the consummation of the Separation and the Distribution, at the Effective Time, subject to the terms and conditions of the Merger Agreement, each share of WBD Common Stock issued and outstanding immediately prior to the Effective Time (other than shares of WBD Common Stock to be canceled in accordance with the Merger Agreement or as to which appraisal rights have been properly exercised) shall be converted into the right to receive (i) an amount in cash equal to $23.25, without interest (the “Cash Consideration”), and (ii) such number of validly issued, fully paid and nonassessable shares of common stock of Netflix, par value $0.001 per share (the “Buyer Common Stock”) equal to the Exchange Ratio (“Stock Consideration” and together with the Cash Consideration, the “Merger Consideration”), plus cash in lieu of any fractional shares to which such share would otherwise be entitled. The “Exchange Ratio” will be determined based on the per share volume-weighted average trading price of Buyer Common Stock for the fifteen (15) consecutive trading days ending on (and including) the trading day that is three (3) trading days prior to the closing date of the Merger (the “Average Buyer Stock Price”), and which will be (x) 0.0376, if the Average Buyer Stock Price is equal to or greater than $119.67, (y) the quotient obtained by dividing $4.50 by the Average Buyer Stock Price if the Average Buyer Stock Price is greater than $97.91 but less than $119.67 and (z) 0.0460, if the Average Buyer Stock Price is less than or equal to $97.91, in each case, subject to any Net Debt Adjustment. Treatment of Equity Awards Pursuant to the Merger Agreement, at the Effective Time, each outstanding option to purchase shares of WBD Common Stock granted under any WBD stock plan (a “WBD Option”) that is (x) by its terms vested as of the Effective Time, or (y) held by a former employee or service provider of WBD (each, a “Vested WBD Option”), in each case, with an exercise price per share of WBD Common Stock that is less than the sum (rounded to the nearest four decimals) of (1) the Cash Consideration plus (2) an amount in cash equal to the product obtained by multiplying (3) the Exchange Ratio by (4) the Average Buyer Stock Price (the “Merger Consideration Value”), will be canceled in consideration for the right to receive the Merger Consideration (or, for any individual who holds any WBD equity award assumed and adjusted by SpinCo in accordance with the Employee Matters Agreement (each, a “SpinCo Award Holder”), the cash value thereof) in respect of the number of whole and partial shares of WBD Common Stock equal to (i) the product obtained by multiplying (A) the number of shares of WBD Common Stock subject to such Vested WBD Option immediately prior to the Effective Time, and (B) the excess of the Merger Consideration Value over the exercise price per share of WBD Common Stock subject to such Vested WBD Option, divided by (ii) the Merger Consideration Value (the “Net WBD Shares”) as if each Net WBD Share were one share of WBD Common Stock issued and outstanding immediately prior to the Effective Time. At the Effective Time, each WBD Option that is outstanding and unexercised immediately prior to the Effective Time and that is not a Vested WBD Option (an “Unvested WBD Option”) with an exercise price per share of WBD Common Stock that is less than the Merger Consideration Value will be assumed by Netflix and automatically converted into the contingent right to receive an amount in cash, without interest, equal to the product obtained by multiplying (i) the excess of the Merger Consideration Value over the per-share exercise price for such Unvested WBD Option, by (ii) the total number of shares of WBD Common Stock subject to such Unvested WBD Option immediately prior to the Effective Time (the “Unvested WBD Option Consideration”), with such Unvested WBD Option Consideration remaining subject to the same terms and conditions (including any applicable terms relating to accelerated vesting upon qualifying terminations of employment and timing and form of payment) that applied to the corresponding Unvested WBD Option immediately prior to the Effective Time (except for terms rendered inoperative by reason of the transactions contemplated by the Merger Agreement or for other administrative or ministerial changes as in the reasonable and the good faith determination of Netflix are appropriate to conform the administration of the Unvested WBD Option Consideration amounts and are not adverse to the holders) with respect to receipt of the Unvested WBD Option Consideration. At the Effective Time, each WBD Option with an exercise price per share of WBD Common Stock that is equal to or greater than the Merger Consideration Value will be canceled without any cash payment or other consideration being made in respect thereof. At the Effective Time, each award of restricted stock units corresponding to shares of WBD Common Stock granted pursuant to any WBD stock plan, including performance restricted stock units (a “WBD RSU”) that is vested in accordance with its terms as of the Effective Time or that is held by a non-employee member of the Board of Directors of WBD (each, a “Vested WBD RSU”), will be canceled and converted into the right to receive the Merger Consideration (or, for SpinCo Award Holders, the cash value thereof) with respect to each share of WBD Common Stock underlying such Vested WBD RSU. At the Effective Time, each WBD RSU Award that is outstanding immediately prior to Effective Time and that is not a Vested WBD RSU (each, an “Unvested WBD RSU”) will be assumed by Netflix and automatically converted into the contingent right to receive an amount in cash, without interest, equal to (x) the product of (i) the Merger Consideration Value, multiplied by (ii) the total number of shares of WBD Common Stock subject to such Unvested WBD RSU immediately prior to the Effective Time (the “Unvested Company WBD RSU Consideration”), with such Unvested WBD RSU Consideration remaining subject to the same terms and conditions (including any applicable terms relating to accelerated vesting upon qualifying terminations of employment and timing and form of payment) that applied to the corresponding Unvested WBD RSU immediately prior to the Effective Time (except for terms rendered inoperative by reason of the transactions contemplated by the Merger Agreement or for other administrative or ministerial changes as in the reasonable and the good faith determination of Netflix are appropriate to conform the administration of the Unvested WBD RSU Consideration amounts and are not adverse to the holders) with respect to receipt of the Unvested WBD RSU Consideration. At the Effective Time, the total number of shares of WBD Common Stock that are subject to each Unvested WBD RSU that remains subject to performance-based vesting conditions as of the Effective Time will be determined by assuming, in respect of such WBD RSU, achievement at the greater of (x) target performance and (y) actual performance extrapolated through the end of the applicable performance period based on actual performance through the closing date of the Merger, determined by the Board of Directors of WBD or a committee thereof in good faith and consistent with past practice. Treatment of Equity Awards Pursuant to the Merger Agreement, at the Effective Time, each outstanding option to purchase shares of WBD Common Stock granted under any WBD stock plan (a “WBD Option”) that is (x) by its terms vested as of the Effective Time, or (y) held by a former employee or service provider of WBD (each, a “Vested WBD Option”), in each case, with an exercise price per share of WBD Common Stock that is less than the sum (rounded to the nearest four decimals) of (1) the Cash Consideration plus (2) an amount in cash equal to the product obtained by multiplying (3) the Exchange Ratio by (4) the Average Buyer Stock Price (the “Merger Consideration Value”), will be canceled in consideration for the right to receive the Merger Consideration (or, for any individual who holds any WBD equity award assumed and adjusted by SpinCo in accordance with the Employee Matters Agreement (each, a “SpinCo Award Holder”), the cash value thereof) in respect of the number of whole and partial shares of WBD Common Stock equal to (i) the product obtained by multiplying (A) the number of shares of WBD Common Stock subject to such Vested WBD Option immediately prior to the Effective Time, and (B) the excess of the Merger Consideration Value over the exercise price per share of WBD Common Stock subject to such Vested WBD Option, divided by (ii) the Merger Consideration Value (the “Net WBD Shares”) as if each Net WBD Share were one share of WBD Common Stock issued and outstanding immediately prior to the Effective Time. At the Effective Time, each WBD Option that is outstanding and unexercised immediately prior to the Effective Time and that is not a Vested WBD Option (an “Unvested WBD Option”) with an exercise price per share of WBD Common Stock that is less than the Merger Consideration Value will be assumed by Netflix and automatically converted into the contingent right to receive an amount in cash, without interest, equal to the product obtained by multiplying (i) the excess of the Merger Consideration Value over the per-share exercise price for such Unvested WBD Option, by (ii) the total number of shares of WBD Common Stock subject to such Unvested WBD Option immediately prior to the Effective Time (the “Unvested WBD Option Consideration”), with such Unvested WBD Option Consideration remaining subject to the same terms and conditions (including any applicable terms relating to accelerated vesting upon qualifying terminations of employment and timing and form of payment) that applied to the corresponding Unvested WBD Option immediately prior to the Effective Time (except for terms rendered inoperative by reason of the transactions contemplated by the Merger Agreement or for other administrative or ministerial changes as in the reasonable and the good faith determination of Netflix are appropriate to conform the administration of the Unvested WBD Option Consideration amounts and are not adverse to the holders) with respect to receipt of the Unvested WBD Option Consideration. At the Effective Time, each WBD Option with an exercise price per share of WBD Common Stock that is equal to or greater than the Merger Consideration Value will be canceled without any cash payment or other consideration being made in respect thereof. At the Effective Time, each award of restricted stock units corresponding to shares of WBD Common Stock granted pursuant to any WBD stock plan, including performance restricted stock units (a “WBD RSU”) that is vested in accordance with its terms as of the Effective Time or that is held by a non-employee member of the Board of Directors of WBD (each, a “Vested WBD RSU”), will be canceled and converted into the right to receive the Merger Consideration (or, for SpinCo Award Holders, the cash value thereof) with respect to each share of WBD Common Stock underlying such Vested WBD RSU. At the Effective Time, each WBD RSU Award that is outstanding immediately prior to Effective Time and that is not a Vested WBD RSU (each, an “Unvested WBD RSU”) will be assumed by Netflix and automatically converted into the contingent right to receive an amount in cash, without interest, equal to (x) the product of (i) the Merger Consideration Value, multiplied by (ii) the total number of shares of WBD Common Stock subject to such Unvested WBD RSU immediately prior to the Effective Time (the “Unvested Company WBD RSU Consideration”), with such Unvested WBD RSU Consideration remaining subject to the same terms and conditions (including any applicable terms relating to accelerated vesting upon qualifying terminations of employment and timing and form of payment) that applied to the corresponding Unvested WBD RSU immediately prior to the Effective Time (except for terms rendered inoperative by reason of the transactions contemplated by the Merger Agreement or for other administrative or ministerial changes as in the reasonable and the good faith determination of Netflix are appropriate to conform the administration of the Unvested WBD RSU Consideration amounts and are not adverse to the holders) with respect to receipt of the Unvested WBD RSU Consideration. At the Effective Time, the total number of shares of WBD Common Stock that are subject to each Unvested WBD RSU that remains subject to performance-based vesting conditions as of the Effective Time will be determined by assuming, in respect of such WBD RSU, achievement at the greater of (x) target performance and (y) actual performance extrapolated through the end of the applicable performance period based on actual performance through the closing date of the Merger, determined by the Board of Directors of WBD or a committee thereof in good faith and consistent with past practice. Treatment of Equity Awards Treatment of Equity Awards Pursuant to the Merger Agreement, at the Effective Time, each outstanding option to purchase shares of WBD Common Stock granted under any WBD stock plan (a “WBD Option”) that is (x) by its terms vested as of the Effective Time, or (y) held by a former employee or service provider of WBD (each, a “Vested WBD Option”), in each case, with an exercise price per share of WBD Common Stock that is less than the sum (rounded to the nearest four decimals) of (1) the Cash Consideration plus (2) an amount in cash equal to the product obtained by multiplying (3) the Exchange Ratio by (4) the Average Buyer Stock Price (the “Merger Consideration Value”), will be canceled in consideration for the right to receive the Merger Consideration (or, for any individual who holds any WBD equity award assumed and adjusted by SpinCo in accordance with the Employee Matters Agreement (each, a “SpinCo Award Holder”), the cash value thereof) in respect of the number of whole and partial shares of WBD Common Stock equal to (i) the product obtained by multiplying (A) the number of shares of WBD Common Stock subject to such Vested WBD Option immediately prior to the Effective Time, and (B) the excess of the Merger Consideration Value over the exercise price per share of WBD Common Stock subject to such Vested WBD Option, divided by (ii) the Merger Consideration Value (the “Net WBD Shares”) as if each Net WBD Share were one share of WBD Common Stock issued and outstanding immediately prior to the Effective Time. At the Effective Time, each WBD Option that is outstanding and unexercised immediately prior to the Effective Time and that is not a Vested WBD Option (an “Unvested WBD Option”) with an exercise price per share of WBD Common Stock that is less than the Merger Consideration Value will be assumed by Netflix and automatically converted into the contingent right to receive an amount in cash, without interest, equal to the product obtained by multiplying (i) the excess of the Merger Consideration Value over the per-share exercise price for such Unvested WBD Option, by (ii) the total number of shares of WBD Common Stock subject to such Unvested WBD Option immediately prior to the Effective Time (the “Unvested WBD Option Consideration”), with such Unvested WBD Option Consideration remaining subject to the same terms and conditions (including any applicable terms relating to accelerated vesting upon qualifying terminations of employment and timing and form of payment) that applied to the corresponding Unvested WBD Option immediately prior to the Effective Time (except for terms rendered inoperative by reason of the transactions contemplated by the Merger Agreement or for other administrative or ministerial changes as in the reasonable and the good faith determination of Netflix are appropriate to conform the administration of the Unvested WBD Option Consideration amounts and are not adverse to the holders) with respect to receipt of the Unvested WBD Option Consideration. At the Effective Time, each WBD Option with an exercise price per share of WBD Common Stock that is equal to or greater than the Merger Consideration Value will be canceled without any cash payment or other consideration being made in respect thereof. At the Effective Time, each award of restricted stock units corresponding to shares of WBD Common Stock granted pursuant to any WBD stock plan, including performance restricted stock units (a “WBD RSU”) that is vested in accordance with its terms as of the Effective Time or that is held by a non-employee member of the Board of Directors of WBD (each, a “Vested WBD RSU”), will be canceled and converted into the right to receive the Merger Consideration (or, for SpinCo Award Holders, the cash value thereof) with respect to each share of WBD Common Stock underlying such Vested WBD RSU. At the Effective Time, each WBD RSU Award that is outstanding immediately prior to Effective Time and that is not a Vested WBD RSU (each, an “Unvested WBD RSU”) will be assumed by Netflix and automatically converted into the contingent right to receive an amount in cash, without interest, equal to (x) the product of (i) the Merger Consideration Value, multiplied by (ii) the total number of shares of WBD Common Stock subject to such Unvested WBD RSU immediately prior to the Effective Time (the “Unvested Company WBD RSU Consideration”), with such Unvested WBD RSU Consideration remaining subject to the same terms and conditions (including any applicable terms relating to accelerated vesting upon qualifying terminations of employment and timing and form of payment) that applied to the corresponding Unvested WBD RSU immediately prior to the Effective Time (except for terms rendered inoperative by reason of the transactions contemplated by the Merger Agreement or for other administrative or ministerial changes as in the reasonable and the good faith determination of Netflix are appropriate to conform the administration of the Unvested WBD RSU Consideration amounts and are not adverse to the holders) with respect to receipt of the Unvested WBD RSU Consideration. At the Effective Time, the total number of shares of WBD Common Stock that are subject to each Unvested WBD RSU that remains subject to performance-based vesting conditions as of the Effective Time will be determined by assuming, in respect of such WBD RSU, achievement at the greater of (x) target performance and (y) actual performance extrapolated through the end of the applicable performance period based on actual performance through the closing date of the Merger, determined by the Board of Directors of WBD or a committee thereof in good faith and consistent with past practice. At the Effective Time, each deferred stock unit of WBD (a “WBD DSU”) that is outstanding immediately prior to the Effective Time will be assumed by Netflix and automatically converted into a right to receive an amount in cash, without interest, equal to the product obtained by multiplying (A) the Merger Consideration Value by (B) the number of shares of WBD Common Stock subject to such WBD DSU immediately prior to the Effective Time (the “WBD DSU Consideration”), with such WBD DSU Consideration remaining subject to the same terms and conditions that applied to the corresponding WBD DSU immediately prior to the Effective Time (including with respect to timing of payment). At the Effective Time, each notional investment unit with respect to shares of WBD Common Stock (a “WBD Notional Unit”) subject to WBD’s Non-Employee Directors Deferral Plan and WBD’s Supplemental Retirement Plan (each, a “WBD DC Plan”) that is outstanding immediately prior to the Effective Time will be assumed by Netflix and automatically converted into a notional unit with respect to a number of shares of Buyer Common Stock (a “Buyer Notional Unit”) equal to the product obtained by multiplying (A) the Equity Award Exchange Ratio by (B) the number of shares of WBD Common Stock subject to such WBD Notional Unit immediately prior to the Effective Time, with each such Buyer Notional Unit remaining subject to the same terms and conditions that applied to the corresponding WBD Notional Unit immediately prior to the Effective Time (including with respect to timing and form of payment), as set forth in the applicable WBD DC Plan, provided that WBD Notional Units held by SpinCo Award Holders will settle in cash. “Equity Award Exchange Ratio” is determined by summing (i) the Exchange Ratio plus (ii) the fraction obtained by dividing the Cash Consideration by the Average Buyer Stock Price. Representation and Warranties; Certain Covenants The Merger Agreement contains customary representations and warranties of Netflix relating to its business and public filings and WBD relating to the Retained Business and public filings, in each case generally subject to materiality qualifiers. Additionally, the Merger Agreement provides for customary pre-closing covenants of WBD, including covenants relating to conducting the Retained Business in the ordinary course consistent with past practice and to refrain from taking certain actions without Netflix’s consent, covenants not to solicit proposals relating to alternative transactions or, subject to certain exceptions, enter into discussions concerning or provide information in connection with such alternative transactions and, subject to certain exceptions, covenants to recommend that WBD’s stockholders approve the Merger and adopt the Merger Agreement (such recommendation, the “WBD Recommendation”). The Merger Agreement also provides for covenants of Netflix, including certain actions that Netflix must refrain from taking without WBD’s consent. Prior to the adoption of the Merger Agreement by WBD’s stockholders, the board of directors of WBD may, in response to an unsolicited third-party acquisition proposal received after the date of the Merger Agreement, withdraw, qualify, modify or propose publicly to do the foregoing with respect to the WBD Recommendation, or approve, recommend or otherwise declare advisable a Superior Proposal (as defined in the Merger Agreement), or cause WBD to terminate the Merger Agreement, subject to complying with notice requirements and other specified processes in the Merger Agreement, including giving Netflix the opportunity to propose revisions to the terms of the transactions contemplated by the Merger Agreement during a match right period, and paying Netflix the Company Termination Fee (as defined below) prior to or substantially concurrently with such termination. The parties have agreed to use their respective reasonable best efforts to take all actions necessary, proper or advisable under applicable laws to consummate the Merger as promptly as practicable after the date of the Merger Agreement, including to obtain the required regulatory approvals for the Merger, and Netflix has agreed, if required to resolve or eliminate any impediments or objections that may be asserted with respect to the Merger, to certain commitments relating thereto. Closing Conditions Consummation of the Merger is subject to the satisfaction or waiver of certain customary conditions, including, among others, (i) the consummation of the Separation and Distribution in all material respects in accordance with the principal terms of the Separation and Distribution Agreement, (ii) the adoption of the Merger Agreement by the affirmative vote of the holders of a majority of the voting power of the outstanding shares of WBD Common Stock entitled to vote (the “WBD Stockholder Approval”) at a meeting of WBD’s stockholders duly called and held At the Effective Time, each deferred stock unit of WBD (a “WBD DSU”) that is outstanding immediately prior to the Effective Time will be assumed by Netflix and automatically converted into a right to receive an amount in cash, without interest, equal to the product obtained by multiplying (A) the Merger Consideration Value by (B) the number of shares of WBD Common Stock subject to such WBD DSU immediately prior to the Effective Time (the “WBD DSU Consideration”), with such WBD DSU Consideration remaining subject to the same terms and conditions that applied to the corresponding WBD DSU immediately prior to the Effective Time (including with respect to timing of payment). At the Effective Time, each notional investment unit with respect to shares of WBD Common Stock (a “WBD Notional Unit”) subject to WBD’s Non-Employee Directors Deferral Plan and WBD’s Supplemental Retirement Plan (each, a “WBD DC Plan”) that is outstanding immediately prior to the Effective Time will be assumed by Netflix and automatically converted into a notional unit with respect to a number of shares of Buyer Common Stock (a “Buyer Notional Unit”) equal to the product obtained by multiplying (A) the Equity Award Exchange Ratio by (B) the number of shares of WBD Common Stock subject to such WBD Notional Unit immediately prior to the Effective Time, with each such Buyer Notional Unit remaining subject to the same terms and conditions that applied to the corresponding WBD Notional Unit immediately prior to the Effective Time (including with respect to timing and form of payment), as set forth in the applicable WBD DC Plan, provided that WBD Notional Units held by SpinCo Award Holders will settle in cash. “Equity Award Exchange Ratio” is determined by summing (i) the Exchange Ratio plus (ii) the fraction obtained by dividing the Cash Consideration by the Average Buyer Stock Price. Representation and Warranties; Certain Covenants The Merger Agreement contains customary representations and warranties of Netflix relating to its business and public filings and WBD relating to the Retained Business and public filings, in each case generally subject to materiality qualifiers. Additionally, the Merger Agreement provides for customary pre-closing covenants of WBD, including covenants relating to conducting the Retained Business in the ordinary course consistent with past practice and to refrain from taking certain actions without Netflix’s consent, covenants not to solicit proposals relating to alternative transactions or, subject to certain exceptions, enter into discussions concerning or provide information in connection with such alternative transactions and, subject to certain exceptions, covenants to recommend that WBD’s stockholders approve the Merger and adopt the Merger Agreement (such recommendation, the “WBD Recommendation”). The Merger Agreement also provides for covenants of Netflix, including certain actions that Netflix must refrain from taking without WBD’s consent. Prior to the adoption of the Merger Agreement by WBD’s stockholders, the board of directors of WBD may, in response to an unsolicited third-party acquisition proposal received after the date of the Merger Agreement, withdraw, qualify, modify or propose publicly to do the foregoing with respect to the WBD Recommendation, or approve, recommend or otherwise declare advisable a Superior Proposal (as defined in the Merger Agreement), or cause WBD to terminate the Merger Agreement, subject to complying with notice requirements and other specified processes in the Merger Agreement, including giving Netflix the opportunity to propose revisions to the terms of the transactions contemplated by the Merger Agreement during a match right period, and paying Netflix the Company Termination Fee (as defined below) prior to or substantially concurrently with such termination. The parties have agreed to use their respective reasonable best efforts to take all actions necessary, proper or advisable under applicable laws to consummate the Merger as promptly as practicable after the date of the Merger Agreement, including to obtain the required regulatory approvals for the Merger, and Netflix has agreed, if required to resolve or eliminate any impediments or objections that may be asserted with respect to the Merger, to certain commitments relating thereto. Closing Conditions Consummation of the Merger is subject to the satisfaction or waiver of certain customary conditions, including, among others, (i) the consummation of the Separation and Distribution in all material respects in accordance with the principal terms of the Separation and Distribution Agreement, (ii) the adoption of the Merger Agreement by the affirmative vote of the holders of a majority of the voting power of the outstanding shares of WBD Common Stock entitled to vote (the “WBD Stockholder Approval”) at a meeting of WBD’s stockholders duly called and held At the Effective Time, each deferred stock unit of WBD (a “WBD DSU”) that is outstanding immediately prior to the Effective Time will be assumed by Netflix and automatically converted into a right to receive an amount in cash, without interest, equal to the product obtained by multiplying (A) the Merger Consideration Value by (B) the number of shares of WBD Common Stock subject to such WBD DSU immediately prior to the Effective Time (the “WBD DSU Consideration”), with such WBD DSU Consideration remaining subject to the same terms and conditions that applied to the corresponding WBD DSU immediately prior to the Effective Time (including with respect to timing of payment). At the Effective Time, each notional investment unit with respect to shares of WBD Common Stock (a “WBD Notional Unit”) subject to WBD’s Non-Employee Directors Deferral Plan and WBD’s Supplemental Retirement Plan (each, a “WBD DC Plan”) that is outstanding immediately prior to the Effective Time will be assumed by Netflix and automatically converted into a notional unit with respect to a number of shares of Buyer Common Stock (a “Buyer Notional Unit”) equal to the product obtained by multiplying (A) the Equity Award Exchange Ratio by (B) the number of shares of WBD Common Stock subject to such WBD Notional Unit immediately prior to the Effective Time, with each such Buyer Notional Unit remaining subject to the same terms and conditions that applied to the corresponding WBD Notional Unit immediately prior to the Effective Time (including with respect to timing and form of payment), as set forth in the applicable WBD DC Plan, provided that WBD Notional Units held by SpinCo Award Holders will settle in cash. “Equity Award Exchange Ratio” is determined by summing (i) the Exchange Ratio plus (ii) the fraction obtained by dividing the Cash Consideration by the Average Buyer Stock Price. Representation and Warranties; Certain Covenants Representation and Warranties; Certain Covenants The Merger Agreement contains customary representations and warranties of Netflix relating to its business and public filings and WBD relating to the Retained Business and public filings, in each case generally subject to materiality qualifiers. Additionally, the Merger Agreement provides for customary pre-closing covenants of WBD, including covenants relating to conducting the Retained Business in the ordinary course consistent with past practice and to refrain from taking certain actions without Netflix’s consent, covenants not to solicit proposals relating to alternative transactions or, subject to certain exceptions, enter into discussions concerning or provide information in connection with such alternative transactions and, subject to certain exceptions, covenants to recommend that WBD’s stockholders approve the Merger and adopt the Merger Agreement (such recommendation, the “WBD Recommendation”). The Merger Agreement also provides for covenants of Netflix, including certain actions that Netflix must refrain from taking without WBD’s consent. Prior to the adoption of the Merger Agreement by WBD’s stockholders, the board of directors of WBD may, in response to an unsolicited third-party acquisition proposal received after the date of the Merger Agreement, withdraw, qualify, modify or propose publicly to do the foregoing with respect to the WBD Recommendation, or approve, recommend or otherwise declare advisable a Superior Proposal (as defined in the Merger Agreement), or cause WBD to terminate the Merger Agreement, subject to complying with notice requirements and other specified processes in the Merger Agreement, including giving Netflix the opportunity to propose revisions to the terms of the transactions contemplated by the Merger Agreement during a match right period, and paying Netflix the Company Termination Fee (as defined below) prior to or substantially concurrently with such termination. The parties have agreed to use their respective reasonable best efforts to take all actions necessary, proper or advisable under applicable laws to consummate the Merger as promptly as practicable after the date of the Merger Agreement, including to obtain the required regulatory approvals for the Merger, and Netflix has agreed, if required to resolve or eliminate any impediments or objections that may be asserted with respect to the Merger, to certain commitments relating thereto. Consummation of the Merger is subject to the satisfaction or waiver of certain customary conditions, including, among others, (i) the consummation of the Separation and Distribution in all material respects in accordance with the principal terms of the Separation and Distribution Agreement, (ii) the adoption of the Merger Agreement by the affirmative vote of the holders of a majority of the voting power of the outstanding shares of WBD Common Stock entitled to vote (the “WBD Stockholder Approval”) at a meeting of WBD’s stockholders duly called and held for such purpose (the “WBD Stockholder Meeting”), (iii) the authorization for listing on NASDAQ upon official notice of issuance of the shares of Buyer Common Stock issuable to the holders of shares of WBD Common Stock pursuant to the Merger Agreement and the effectiveness of a registration statement on Form S-4 with respect thereto, (iv) the expiration or termination of the applicable waiting period (or any extension thereof) under the Hart-Scott-Rodino Antitrust Improvements Act of 1976, as amended, and the expiration of certain other mandatory waiting periods or receipt of certain other clearances or affirmative approvals of certain other governmental bodies, agencies or authorities and (v) the absence of any law or order, issued by a court or governmental entity of competent jurisdiction, restraining, enjoining, prohibiting or preventing the consummation of the Merger. Each party’s obligation to consummate the Merger is also subject to certain other conditions, including, among others, the accuracy of the other party’s representations and warranties, the other party’s compliance with its pre-closing covenants and agreements contained in the Merger Agreement (in each case, subject to certain qualifications) and the absence of certain changes that have had, or would reasonably be expected to have, a material adverse effect with respect to each of Netflix and the Retained Business of WBD. Financing In connection with the Merger Agreement, Netflix entered into a commitment letter, dated as of December 4, 2025 (the “Debt Commitment Letter”), among Netflix, Wells Fargo Bank, National Association (“WFBNA”), Wells Fargo Strategic Capital, Inc. (“WFSCI” and, together with WFBNA, “Wells Fargo Lender”), Wells Fargo Securities, LLC (“Wells Fargo Securities” and, together with Wells Fargo Lender, “Wells Fargo”), BNP Paribas (“BNPP”), BNP Paribas Securities Corp. (“BNPPSC” and, together with BNPP, “BNP”), HSBC Bank USA, National Association (“HSBC USA”), HSBC Continental Europe (“HSBC Europe”), HSBC Bank plc (“HSBC Bank”), HSBC Bank Middle East Limited (“HSBC Middle East” and, together with HSBC USA, HSBC Europe, HSBC Bank and HSBC Middle East, “HSBC Lender”), HSBC Securities (USA) Inc. (“HSI” and, together with HSBC Lender, “HSBC” and, together with Wells Fargo and BNP, collectively, the “Commitment Parties”), pursuant to which the Commitment Parties have agreed to provide, subject to the satisfaction of customary closing conditions, up to $59,000,000,000 of senior unsecured bridge term loans for the purpose of financing the cash portion of the purchase price required under the Merger Agreement, to pay certain fees, costs and expenses incurred in connection with the transactions contemplated by the Merger Agreement and the Debt Commitment Letter and, at the option of Netflix, to refinance certain indebtedness. The receipt of financing by Netflix is not a condition to Netflix’s obligation to consummate the Merger. The foregoing description of the Debt Commitment Letter does not purport to be complete and is qualified in its entirety by reference to the full text of the Debt Commitment Letter, a copy of which is attached hereto as Exhibit 10.1 and is incorporated herein by reference. Termination Rights and Fees The Merger Agreement also provides for certain mutual termination rights. Subject to certain limitations, the Merger Agreement may be terminated by either Netflix or WBD (i) by mutual written consent, (ii) if the WBD Stockholder Meeting concludes without obtaining the WBD Stockholder Approval, (iii) if any governmental entity of competent jurisdiction issues, enacts, enforces or enters any order permanently enjoining or prohibiting the consummation of the Merger, and such order becomes final and non-appealable or (iv) subject to certain limitations, if the Effective Time has not occurred on or before 11:59 p.m., Eastern time, on March 4, 2027 (the “End Date”), subject to two automatic three (3)-month extensions if on both such dates all of the closing conditions, except those related to regulatory approvals and governmental orders, have been satisfied or waived. In addition, (x) the Merger Agreement may be terminated by Netflix (A) due to certain breaches by WBD of its representations, warranties and covenants contained in the Merger Agreement, subject to certain cure rights, or (B) if prior to the WBD Stockholder Meeting, the Board of Directors of WBD effects a change in the WBD Recommendation, and (y) the Merger Agreement may be terminated by WBD (A) due to certain breaches by Netflix of its representations, warranties and covenants contained in the Merger Agreement, subject to certain cure rights or (B) if prior to the WBD Stockholder Meeting, WBD determines to enter into a definitive agreement providing for a Superior Proposal. If, prior to receipt of WBD Stockholder Approval, (i) the Merger Agreement is terminated by WBD in order to enter into a definitive agreement providing for a Superior Proposal, (ii) the Merger Agreement is terminated by Netflix because the board of directors of WBD has changed its recommendation that WBD stockholders adopt the Merger Agreement, (iii) the Merger Agreement is terminated by Netflix or WBD as a result of the WBD Stockholder Approval having not been obtained and, immediately prior to the WBD Stockholder Meeting, Netflix would have been entitled to terminate the Merger Agreement because the board of directors of WBD has changed its for such purpose (the “WBD Stockholder Meeting”), (iii) the authorization for listing on NASDAQ upon official notice of issuance of the shares of Buyer Common Stock issuable to the holders of shares of WBD Common Stock pursuant to the Merger Agreement and the effectiveness of a registration statement on Form S-4 with respect thereto, (iv) the expiration or termination of the applicable waiting period (or any extension thereof) under the Hart-Scott-Rodino Antitrust Improvements Act of 1976, as amended, and the expiration of certain other mandatory waiting periods or receipt of certain other clearances or affirmative approvals of certain other governmental bodies, agencies or authorities and (v) the absence of any law or order, issued by a court or governmental entity of competent jurisdiction, restraining, enjoining, prohibiting or preventing the consummation of the Merger. Each party’s obligation to consummate the Merger is also subject to certain other conditions, including, among others, the accuracy of the other party’s representations and warranties, the other party’s compliance with its pre-closing covenants and agreements contained in the Merger Agreement (in each case, subject to certain qualifications) and the absence of certain changes that have had, or would reasonably be expected to have, a material adverse effect with respect to each of Netflix and the Retained Business of WBD. Financing In connection with the Merger Agreement, Netflix entered into a commitment letter, dated as of December 4, 2025 (the “Debt Commitment Letter”), among Netflix, Wells Fargo Bank, National Association (“WFBNA”), Wells Fargo Strategic Capital, Inc. (“WFSCI” and, together with WFBNA, “Wells Fargo Lender”), Wells Fargo Securities, LLC (“Wells Fargo Securities” and, together with Wells Fargo Lender, “Wells Fargo”), BNP Paribas (“BNPP”), BNP Paribas Securities Corp. (“BNPPSC” and, together with BNPP, “BNP”), HSBC Bank USA, National Association (“HSBC USA”), HSBC Continental Europe (“HSBC Europe”), HSBC Bank plc (“HSBC Bank”), HSBC Bank Middle East Limited (“HSBC Middle East” and, together with HSBC USA, HSBC Europe, HSBC Bank and HSBC Middle East, “HSBC Lender”), HSBC Securities (USA) Inc. (“HSI” and, together with HSBC Lender, “HSBC” and, together with Wells Fargo and BNP, collectively, the “Commitment Parties”), pursuant to which the Commitment Parties have agreed to provide, subject to the satisfaction of customary closing conditions, up to $59,000,000,000 of senior unsecured bridge term loans for the purpose of financing the cash portion of the purchase price required under the Merger Agreement, to pay certain fees, costs and expenses incurred in connection with the transactions contemplated by the Merger Agreement and the Debt Commitment Letter and, at the option of Netflix, to refinance certain indebtedness. The receipt of financing by Netflix is not a condition to Netflix’s obligation to consummate the Merger. The foregoing description of the Debt Commitment Letter does not purport to be complete and is qualified in its entirety by reference to the full text of the Debt Commitment Letter, a copy of which is attached hereto as Exhibit 10.1 and is incorporated herein by reference. Termination Rights and Fees The Merger Agreement also provides for certain mutual termination rights. Subject to certain limitations, the Merger Agreement may be terminated by either Netflix or WBD (i) by mutual written consent, (ii) if the WBD Stockholder Meeting concludes without obtaining the WBD Stockholder Approval, (iii) if any governmental entity of competent jurisdiction issues, enacts, enforces or enters any order permanently enjoining or prohibiting the consummation of the Merger, and such order becomes final and non-appealable or (iv) subject to certain limitations, if the Effective Time has not occurred on or before 11:59 p.m., Eastern time, on March 4, 2027 (the “End Date”), subject to two automatic three (3)-month extensions if on both such dates all of the closing conditions, except those related to regulatory approvals and governmental orders, have been satisfied or waived. In addition, (x) the Merger Agreement may be terminated by Netflix (A) due to certain breaches by WBD of its representations, warranties and covenants contained in the Merger Agreement, subject to certain cure rights, or (B) if prior to the WBD Stockholder Meeting, the Board of Directors of WBD effects a change in the WBD Recommendation, and (y) the Merger Agreement may be terminated by WBD (A) due to certain breaches by Netflix of its representations, warranties and covenants contained in the Merger Agreement, subject to certain cure rights or (B) if prior to the WBD Stockholder Meeting, WBD determines to enter into a definitive agreement providing for a Superior Proposal. If, prior to receipt of WBD Stockholder Approval, (i) the Merger Agreement is terminated by WBD in order to enter into a definitive agreement providing for a Superior Proposal, (ii) the Merger Agreement is terminated by Netflix because the board of directors of WBD has changed its recommendation that WBD stockholders adopt the Merger Agreement, (iii) the Merger Agreement is terminated by Netflix or WBD as a result of the WBD Stockholder Approval having not been obtained and, immediately prior to the WBD Stockholder Meeting, Netflix would have been entitled to terminate the Merger Agreement because the board of directors of WBD has changed its for such purpose (the “WBD Stockholder Meeting”), (iii) the authorization for listing on NASDAQ upon official notice of issuance of the shares of Buyer Common Stock issuable to the holders of shares of WBD Common Stock pursuant to the Merger Agreement and the effectiveness of a registration statement on Form S-4 with respect thereto, (iv) the expiration or termination of the applicable waiting period (or any extension thereof) under the Hart-Scott-Rodino Antitrust Improvements Act of 1976, as amended, and the expiration of certain other mandatory waiting periods or receipt of certain other clearances or affirmative approvals of certain other governmental bodies, agencies or authorities and (v) the absence of any law or order, issued by a court or governmental entity of competent jurisdiction, restraining, enjoining, prohibiting or preventing the consummation of the Merger. Each party’s obligation to consummate the Merger is also subject to certain other conditions, including, among others, the accuracy of the other party’s representations and warranties, the other party’s compliance with its pre-closing covenants and agreements contained in the Merger Agreement (in each case, subject to certain qualifications) and the absence of certain changes that have had, or would reasonably be expected to have, a material adverse effect with respect to each of Netflix and the Retained Business of WBD. In connection with the Merger Agreement, Netflix entered into a commitment letter, dated as of December 4, 2025 (the “Debt Commitment Letter”), among Netflix, Wells Fargo Bank, National Association (“WFBNA”), Wells Fargo Strategic Capital, Inc. (“WFSCI” and, together with WFBNA, “Wells Fargo Lender”), Wells Fargo Securities, LLC (“Wells Fargo Securities” and, together with Wells Fargo Lender, “Wells Fargo”), BNP Paribas (“BNPP”), BNP Paribas Securities Corp. (“BNPPSC” and, together with BNPP, “BNP”), HSBC Bank USA, National Association (“HSBC USA”), HSBC Continental Europe (“HSBC Europe”), HSBC Bank plc (“HSBC Bank”), HSBC Bank Middle East Limited (“HSBC Middle East” and, together with HSBC USA, HSBC Europe, HSBC Bank and HSBC Middle East, “HSBC Lender”), HSBC Securities (USA) Inc. (“HSI” and, together with HSBC Lender, “HSBC” and, together with Wells Fargo and BNP, collectively, the “Commitment Parties”), pursuant to which the Commitment Parties have agreed to provide, subject to the satisfaction of customary closing conditions, up to $59,000,000,000 of senior unsecured bridge term loans for the purpose of financing the cash portion of the purchase price required under the Merger Agreement, to pay certain fees, costs and expenses incurred in connection with the transactions contemplated by the Merger Agreement and the Debt Commitment Letter and, at the option of Netflix, to refinance certain indebtedness. The receipt of financing by Netflix is not a condition to Netflix’s obligation to consummate the Merger. The foregoing description of the Debt Commitment Letter does not purport to be complete and is qualified in its entirety by reference to the full text of the Debt Commitment Letter, a copy of which is attached hereto as Exhibit 10.1 and is incorporated herein by reference. Termination Rights and Fees Termination Rights and Fees The Merger Agreement also provides for certain mutual termination rights. Subject to certain limitations, the Merger Agreement may be terminated by either Netflix or WBD (i) by mutual written consent, (ii) if the WBD Stockholder Meeting concludes without obtaining the WBD Stockholder Approval, (iii) if any governmental entity of competent jurisdiction issues, enacts, enforces or enters any order permanently enjoining or prohibiting the consummation of the Merger, and such order becomes final and non-appealable or (iv) subject to certain limitations, if the Effective Time has not occurred on or before 11:59 p.m., Eastern time, on March 4, 2027 (the “End Date”), subject to two automatic three (3)-month extensions if on both such dates all of the closing conditions, except those related to regulatory approvals and governmental orders, have been satisfied or waived. In addition, (x) the Merger Agreement may be terminated by Netflix (A) due to certain breaches by WBD of its representations, warranties and covenants contained in the Merger Agreement, subject to certain cure rights, or (B) if prior to the WBD Stockholder Meeting, the Board of Directors of WBD effects a change in the WBD Recommendation, and (y) the Merger Agreement may be terminated by WBD (A) due to certain breaches by Netflix of its representations, warranties and covenants contained in the Merger Agreement, subject to certain cure rights or (B) if prior to the WBD Stockholder Meeting, WBD determines to enter into a definitive agreement providing for a Superior Proposal. If, prior to receipt of WBD Stockholder Approval, (i) the Merger Agreement is terminated by WBD in order to enter into a definitive agreement providing for a Superior Proposal, (ii) the Merger Agreement is terminated by Netflix because the board of directors of WBD has changed its recommendation that WBD stockholders adopt the Merger Agreement, (iii) the Merger Agreement is terminated by Netflix or WBD as a result of the WBD Stockholder Approval having not been obtained and, immediately prior to the WBD Stockholder Meeting, Netflix would have been entitled to terminate the Merger Agreement because the board of directors of WBD has changed its recommendation that WBD stockholders adopt the Merger Agreement or (iv) (x) after the date of the Merger Agreement, an acquisition proposal is publicly proposed or publicly disclosed prior to the WBD Stockholder Meeting (a “WBD Qualifying Transaction”), (y) the Merger Agreement is terminated (1) by Netflix or WBD as a result of the WBD Stockholder Approval having not been obtained or (2) by Netflix as a result of a willful breach by WBD of its covenants in the Merger Agreement and (z) concurrently with or within twelve (12) months after such termination, WBD (x) consummates a WBD Qualifying Transaction or (y) enters into a definitive agreement providing for a WBD Qualifying Transaction, then WBD will be obligated to pay Netflix a fee equal to $2,800,000,000 (the “Company Termination Fee”). Netflix will pay WBD a termination fee of $5,800,000,000 if the Merger Agreement is not consummated under certain circumstances relating to the failure to obtain approvals, or there is a final, non-appealable order preventing the transaction, in each case, relating to antitrust laws or foreign regulatory laws. The Merger Agreement also provides that either party may seek to compel the other party to specifically perform its obligations under the Merger Agreement. Description of Merger Not Complete The foregoing summary of the Merger Agreement does not purport to be complete and is qualified in its entirety by the full text of the Merger Agreement, which is attached hereto as Exhibit 2.1 and is incorporated by reference herein. The Merger Agreement has been included to provide investors with information regarding its terms. It is not intended to provide any other factual information about Netflix, WBD or their respective subsidiaries or affiliates. The representations, warranties and covenants contained in the Merger Agreement were made only for purposes of the Merger Agreement and as of specific dates, were solely for the benefit of the parties to the Merger Agreement, may be subject to limitations agreed upon by the contracting parties, including being qualified by confidential disclosures made for the purposes of allocating contractual risk between the parties to the Merger Agreement instead of establishing these matters as facts, and may be subject to standards of materiality applicable to the contracting parties that differ from those applicable to investors. Investors are not third-party beneficiaries under the Merger Agreement and should not rely on the representations, warranties and covenants or any descriptions thereof as characterizations of the actual state of facts or condition of the parties thereto or any of their respective subsidiaries or affiliates. Moreover, information concerning the subject matter of representations and warranties may change after the date of the Merger Agreement, which subsequent information may or may not be fully reflected in Netflix’s or WBD’s respective public disclosures.\n"
  },
  {
    "cluster": 2,
    "content": "TITLE: Item 7.01\nTEXT: Item 7.01 Regulation FD Disclosure On December 5, 2025, Netflix and WBD issued a joint press release announcing the execution of the Merger Agreement. A copy of the press release is attached as Exhibit 99.1 hereto and incorporated by reference herein. The press release also announced that Netflix will be hosting an investor conference call and webcast at 5 a.m. Pacific time, on December 5, 2025, to discuss the transactions contemplated by the Merger Agreement. The information contained in this\nTEXT: Item 7.01, including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be incorporated by reference into any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such filing.\n"
  },
  {
    "cluster": 3,
    "content": "TITLE: Item 9.01\nTEXT: Item 9.01 Financial Statements and Exhibits. (d) Exhibits. Exhibit No. Description 2.1 Agreement and Plan of Merger, dated as of December 4, 2025, by and among Netflix, Inc., Nightingale Sub, Inc., Warner Bros. Discovery, Inc. and New Topco 25, Inc.* 10.1 Commitment Letter, dated as of December 4, 2025, by and among Netflix, Inc., Wells Fargo Bank, National Association, Wells Fargo Strategic Capital, Inc., Wells Fargo Securities, LLC, BNP Paribas, BNP Paribas Securities Corp., HSBC Bank USA, National Association, HSBC Continental Europe, HSBC Bank plc, HSBC Bank Middle East Limited and HSBC Securities (USA) Inc. * Annexes, schedules and/or exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K promulgated by the SEC. Netflix agrees to furnish supplementally a copy of any omitted annexes, schedules or exhibits to the SEC upon request. recommendation that WBD stockholders adopt the Merger Agreement or (iv) (x) after the date of the Merger Agreement, an acquisition proposal is publicly proposed or publicly disclosed prior to the WBD Stockholder Meeting (a “WBD Qualifying Transaction”), (y) the Merger Agreement is terminated (1) by Netflix or WBD as a result of the WBD Stockholder Approval having not been obtained or (2) by Netflix as a result of a willful breach by WBD of its covenants in the Merger Agreement and (z) concurrently with or within twelve (12) months after such termination, WBD (x) consummates a WBD Qualifying Transaction or (y) enters into a definitive agreement providing for a WBD Qualifying Transaction, then WBD will be obligated to pay Netflix a fee equal to $2,800,000,000 (the “Company Termination Fee”). Netflix will pay WBD a termination fee of $5,800,000,000 if the Merger Agreement is not consummated under certain circumstances relating to the failure to obtain approvals, or there is a final, non-appealable order preventing the transaction, in each case, relating to antitrust laws or foreign regulatory laws. The Merger Agreement also provides that either party may seek to compel the other party to specifically perform its obligations under the Merger Agreement. Description of Merger Not Complete The foregoing summary of the Merger Agreement does not purport to be complete and is qualified in its entirety by the full text of the Merger Agreement, which is attached hereto as Exhibit 2.1 and is incorporated by reference herein. The Merger Agreement has been included to provide investors with information regarding its terms. It is not intended to provide any other factual information about Netflix, WBD or their respective subsidiaries or affiliates. The representations, warranties and covenants contained in the Merger Agreement were made only for purposes of the Merger Agreement and as of specific dates, were solely for the benefit of the parties to the Merger Agreement, may be subject to limitations agreed upon by the contracting parties, including being qualified by confidential disclosures made for the purposes of allocating contractual risk between the parties to the Merger Agreement instead of establishing these matters as facts, and may be subject to standards of materiality applicable to the contracting parties that differ from those applicable to investors. Investors are not third-party beneficiaries under the Merger Agreement and should not rely on the representations, warranties and covenants or any descriptions thereof as characterizations of the actual state of facts or condition of the parties thereto or any of their respective subsidiaries or affiliates. Moreover, information concerning the subject matter of representations and warranties may change after the date of the Merger Agreement, which subsequent information may or may not be fully reflected in Netflix’s or WBD’s respective public disclosures.\nTEXT: Item 9.01 Financial Statements and Exhibits. (d) Exhibits. Exhibit No. Description 2.1 Agreement and Plan of Merger, dated as of December 4, 2025, by and among Netflix, Inc., Nightingale Sub, Inc., Warner Bros. Discovery, Inc. and New Topco 25, Inc.* 10.1 Commitment Letter, dated as of December 4, 2025, by and among Netflix, Inc., Wells Fargo Bank, National Association, Wells Fargo Strategic Capital, Inc., Wells Fargo Securities, LLC, BNP Paribas, BNP Paribas Securities Corp., HSBC Bank USA, National Association, HSBC Continental Europe, HSBC Bank plc, HSBC Bank Middle East Limited and HSBC Securities (USA) Inc. * Annexes, schedules and/or exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K promulgated by the SEC. Netflix agrees to furnish supplementally a copy of any omitted annexes, schedules or exhibits to the SEC upon request. recommendation that WBD stockholders adopt the Merger Agreement or (iv) (x) after the date of the Merger Agreement, an acquisition proposal is publicly proposed or publicly disclosed prior to the WBD Stockholder Meeting (a “WBD Qualifying Transaction”), (y) the Merger Agreement is terminated (1) by Netflix or WBD as a result of the WBD Stockholder Approval having not been obtained or (2) by Netflix as a result of a willful breach by WBD of its covenants in the Merger Agreement and (z) concurrently with or within twelve (12) months after such termination, WBD (x) consummates a WBD Qualifying Transaction or (y) enters into a definitive agreement providing for a WBD Qualifying Transaction, then WBD will be obligated to pay Netflix a fee equal to $2,800,000,000 (the “Company Termination Fee”). Netflix will pay WBD a termination fee of $5,800,000,000 if the Merger Agreement is not consummated under certain circumstances relating to the failure to obtain approvals, or there is a final, non-appealable order preventing the transaction, in each case, relating to antitrust laws or foreign regulatory laws. The Merger Agreement also provides that either party may seek to compel the other party to specifically perform its obligations under the Merger Agreement. Description of Merger Not Complete Description of Merger Not Complete The foregoing summary of the Merger Agreement does not purport to be complete and is qualified in its entirety by the full text of the Merger Agreement, which is attached hereto as Exhibit 2.1 and is incorporated by reference herein. The Merger Agreement has been included to provide investors with information regarding its terms. It is not intended to provide any other factual information about Netflix, WBD or their respective subsidiaries or affiliates. The representations, warranties and covenants contained in the Merger Agreement were made only for purposes of the Merger Agreement and as of specific dates, were solely for the benefit of the parties to the Merger Agreement, may be subject to limitations agreed upon by the contracting parties, including being qualified by confidential disclosures made for the purposes of allocating contractual risk between the parties to the Merger Agreement instead of establishing these matters as facts, and may be subject to standards of materiality applicable to the contracting parties that differ from those applicable to investors. Investors are not third-party beneficiaries under the Merger Agreement and should not rely on the representations, warranties and covenants or any descriptions thereof as characterizations of the actual state of facts or condition of the parties thereto or any of their respective subsidiaries or affiliates. Moreover, information concerning the subject matter of representations and warranties may change after the date of the Merger Agreement, which subsequent information may or may not be fully reflected in Netflix’s or WBD’s respective public disclosures.\nTEXT: Item 9.01 Financial Statements and Exhibits. Exhibit No. Description 2.1 Agreement and Plan of Merger, dated as of December 4, 2025, by and among Netflix, Inc., Nightingale Sub, Inc., Warner Bros. Discovery, Inc. and New Topco 25, Inc.* 10.1 Commitment Letter, dated as of December 4, 2025, by and among Netflix, Inc., Wells Fargo Bank, National Association, Wells Fargo Strategic Capital, Inc., Wells Fargo Securities, LLC, BNP Paribas, BNP Paribas Securities Corp., HSBC Bank USA, National Association, HSBC Continental Europe, HSBC Bank plc, HSBC Bank Middle East Limited and HSBC Securities (USA) Inc. Exhibit No. Description 2.1 Agreement and Plan of Merger, dated as of December 4, 2025, by and among Netflix, Inc., Nightingale Sub, Inc., Warner Bros. Discovery, Inc. and New Topco 25, Inc.* 10.1 Commitment Letter, dated as of December 4, 2025, by and among Netflix, Inc., Wells Fargo Bank, National Association, Wells Fargo Strategic Capital, Inc., Wells Fargo Securities, LLC, BNP Paribas, BNP Paribas Securities Corp., HSBC Bank USA, National Association, HSBC Continental Europe, HSBC Bank plc, HSBC Bank Middle East Limited and HSBC Securities (USA) Inc. Exhibit No. Description 2.1 Agreement and Plan of Merger, dated as of December 4, 2025, by and among Netflix, Inc., Nightingale Sub, Inc., Warner Bros. Discovery, Inc. and New Topco 25, Inc.* Agreement and Plan of Merger, dated as of December 4, 2025, by and among Netflix, Inc., Nightingale Sub, Inc., Warner Bros. Discovery, Inc. and New Topco 25, Inc.* Agreement and Plan of Merger, dated as of December 4, 2025, by and among Netflix, Inc., Nightingale Sub, Inc., Warner Bros. Discovery, Inc. and New Topco 25, Inc.* 10.1 Commitment Letter, dated as of December 4, 2025, by and among Netflix, Inc., Wells Fargo Bank, National Association, Wells Fargo Strategic Capital, Inc., Wells Fargo Securities, LLC, BNP Paribas, BNP Paribas Securities Corp., HSBC Bank USA, National Association, HSBC Continental Europe, HSBC Bank plc, HSBC Bank Middle East Limited and HSBC Securities (USA) Inc. Commitment Letter, dated as of December 4, 2025, by and among Netflix, Inc., Wells Fargo Bank, National Association, Wells Fargo Strategic Capital, Inc., Wells Fargo Securities, LLC, BNP Paribas, BNP Paribas Securities Corp., HSBC Bank USA, National Association, HSBC Continental Europe, HSBC Bank plc, HSBC Bank Middle East Limited and HSBC Securities (USA) Inc. Commitment Letter, dated as of December 4, 2025, by and among Netflix, Inc., Wells Fargo Bank, National Association, Wells Fargo Strategic Capital, Inc., Wells Fargo Securities, LLC, BNP Paribas, BNP Paribas Securities Corp., HSBC Bank USA, National Association, HSBC Continental Europe, HSBC Bank plc, HSBC Bank Middle East Limited and HSBC Securities (USA) Inc. * Annexes, schedules and/or exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K promulgated by the SEC. Netflix agrees to furnish supplementally a copy of any omitted annexes, schedules or exhibits to the SEC upon request. * Annexes, schedules and/or exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K promulgated by the SEC. Netflix agrees to furnish supplementally a copy of any omitted annexes, schedules or exhibits to the SEC upon request. * Annexes, schedules and/or exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K promulgated by the SEC. Netflix agrees to furnish supplementally a copy of any omitted annexes, schedules or exhibits to the SEC upon request. Annexes, schedules and/or exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K promulgated by the SEC. Netflix agrees to furnish supplementally a copy of any omitted annexes, schedules or exhibits to the SEC upon request. Annexes, schedules and/or exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K promulgated by the SEC. Netflix agrees to furnish supplementally a copy of any omitted annexes, schedules or exhibits to the SEC upon request. 99.1 Press Release, dated December 5, 2025, jointly issued by Netflix, Inc. and Warner Bros. Discovery, Inc. 104.1 Cover Page Interactive Data File (embedded within the Inline XBRL document). Important Information and Where to Find It In connection with the Merger between WBD and Netflix, Netflix intends to file with the U.S. Securities and Exchange Commission (the “SEC”) the Registration Statement, which will include a prospectus with respect to the shares of Buyer Common Stock to be issued in the Merger and a proxy statement for WBD’s stockholders (the “Proxy Statement/Prospectus”), and WBD intends to file with the SEC the proxy statement. The definitive proxy statement (if and when available) will be mailed to stockholders of WBD. WBD also intends to file a registration statement for SpinCo. Each of Netflix and WBD may also file with or furnish to the SEC other relevant documents regarding the Merger. This communication is not a substitute for the Registration Statement, the Proxy Statement/Prospectus or any other document that Netflix or WBD may file with the SEC or mail to WBD’s stockholders in connection with the Merger. INVESTORS AND SECURITY HOLDERS OF NETFLIX AND WBD ARE URGED TO READ THE REGISTRATION STATEMENT AND THE PROXY STATEMENT/PROSPECTUS INCLUDED WITHIN THE REGISTRATION STATEMENT WHEN THEY BECOME AVAILABLE, AS WELL AS ANY OTHER RELEVANT DOCUMENTS FILED WITH THE SEC IN CONNECTION WITH THE MERGER OR INCORPORATED BY REFERENCE INTO THE REGISTRATION STATEMENT AND THE PROXY STATEMENT/PROSPECTUS (INCLUDING ANY AMENDMENTS OR SUPPLEMENTS THERETO), BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION REGARDING NETFLIX, WBD, THE MERGER AND RELATED MATTERS. The documents filed by Netflix with the SEC also may be obtained free of charge at Netflix’s website at https://ir.netflix.net/home/default.aspx. The documents filed by WBD with the SEC also may be obtained free of charge at WBD’s website at https://ir.wbd.com. Participants in the Solicitation Netflix, WBD and certain of their respective directors and executive officers may be deemed to be participants in the solicitation of proxies from the stockholders of WBD in connection with the Merger under the rules of the SEC. Information about the interests of the directors and executive officers of Netflix and WBD and other persons who may be deemed to be participants in the solicitation of stockholders of WBD in connection with the Merger and a description of their direct and indirect interests, by security holdings or otherwise, will be included in the Proxy Statement/Prospectus, which will be filed with the SEC. Information about WBD’s directors and executive officers is set forth in WBD’s proxy statement for its 2025 Annual Meeting of Stockholders on Schedule 14A filed with the SEC on April 23, 2025, WBD’s Annual Report on Form 10-K for the year ended December 31, 2024, and any subsequent filings with the SEC. Information about Netflix’s directors and executive officers is set forth in Netflix’s proxy statement for its 2025 Annual Meeting of Stockholders on Schedule 14A filed with the SEC on April 15, 2025, and any subsequent filings with the SEC. Additional information regarding the direct and indirect interests of those persons and other persons who may be deemed participants in the Merger may be obtained by reading the Proxy Statement/Prospectus regarding the Merger when it becomes available. Free copies of these documents may be obtained as described above. No Offer or Solicitation This communication is for informational purposes only and does not constitute, or form a part of, an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended, and otherwise in accordance with applicable law. Cautionary Statement Regarding Forward-Looking Statements This document contains “forward-looking statements” within the meaning of the federal securities laws, including Section 27A of the U.S. Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on Netflix’s and WBD’s current expectations, estimates and projections about the expected date of closing of the Merger and the potential benefits thereof, their respective businesses and industries, management’s beliefs and certain assumptions made by Netflix and WBD, all of which are subject to change. All forward-looking statements by their nature address matters that involve risks and uncertainties, many of which are beyond our control and are not guarantees of future results, such as statements about 99.1 Press Release, dated December 5, 2025, jointly issued by Netflix, Inc. and Warner Bros. Discovery, Inc. 104.1 Cover Page Interactive Data File (embedded within the Inline XBRL document). Important Information and Where to Find It In connection with the Merger between WBD and Netflix, Netflix intends to file with the U.S. Securities and Exchange Commission (the “SEC”) the Registration Statement, which will include a prospectus with respect to the shares of Buyer Common Stock to be issued in the Merger and a proxy statement for WBD’s stockholders (the “Proxy Statement/Prospectus”), and WBD intends to file with the SEC the proxy statement. The definitive proxy statement (if and when available) will be mailed to stockholders of WBD. WBD also intends to file a registration statement for SpinCo. Each of Netflix and WBD may also file with or furnish to the SEC other relevant documents regarding the Merger. This communication is not a substitute for the Registration Statement, the Proxy Statement/Prospectus or any other document that Netflix or WBD may file with the SEC or mail to WBD’s stockholders in connection with the Merger. INVESTORS AND SECURITY HOLDERS OF NETFLIX AND WBD ARE URGED TO READ THE REGISTRATION STATEMENT AND THE PROXY STATEMENT/PROSPECTUS INCLUDED WITHIN THE REGISTRATION STATEMENT WHEN THEY BECOME AVAILABLE, AS WELL AS ANY OTHER RELEVANT DOCUMENTS FILED WITH THE SEC IN CONNECTION WITH THE MERGER OR INCORPORATED BY REFERENCE INTO THE REGISTRATION STATEMENT AND THE PROXY STATEMENT/PROSPECTUS (INCLUDING ANY AMENDMENTS OR SUPPLEMENTS THERETO), BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION REGARDING NETFLIX, WBD, THE MERGER AND RELATED MATTERS. The documents filed by Netflix with the SEC also may be obtained free of charge at Netflix’s website at https://ir.netflix.net/home/default.aspx. The documents filed by WBD with the SEC also may be obtained free of charge at WBD’s website at https://ir.wbd.com. Participants in the Solicitation Netflix, WBD and certain of their respective directors and executive officers may be deemed to be participants in the solicitation of proxies from the stockholders of WBD in connection with the Merger under the rules of the SEC. Information about the interests of the directors and executive officers of Netflix and WBD and other persons who may be deemed to be participants in the solicitation of stockholders of WBD in connection with the Merger and a description of their direct and indirect interests, by security holdings or otherwise, will be included in the Proxy Statement/Prospectus, which will be filed with the SEC. Information about WBD’s directors and executive officers is set forth in WBD’s proxy statement for its 2025 Annual Meeting of Stockholders on Schedule 14A filed with the SEC on April 23, 2025, WBD’s Annual Report on Form 10-K for the year ended December 31, 2024, and any subsequent filings with the SEC. Information about Netflix’s directors and executive officers is set forth in Netflix’s proxy statement for its 2025 Annual Meeting of Stockholders on Schedule 14A filed with the SEC on April 15, 2025, and any subsequent filings with the SEC. Additional information regarding the direct and indirect interests of those persons and other persons who may be deemed participants in the Merger may be obtained by reading the Proxy Statement/Prospectus regarding the Merger when it becomes available. Free copies of these documents may be obtained as described above. No Offer or Solicitation This communication is for informational purposes only and does not constitute, or form a part of, an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended, and otherwise in accordance with applicable law. Cautionary Statement Regarding Forward-Looking Statements This document contains “forward-looking statements” within the meaning of the federal securities laws, including Section 27A of the U.S. Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on Netflix’s and WBD’s current expectations, estimates and projections about the expected date of closing of the Merger and the potential benefits thereof, their respective businesses and industries, management’s beliefs and certain assumptions made by Netflix and WBD, all of which are subject to change. All forward-looking statements by their nature address matters that involve risks and uncertainties, many of which are beyond our control and are not guarantees of future results, such as statements about 99.1 Press Release, dated December 5, 2025, jointly issued by Netflix, Inc. and Warner Bros. Discovery, Inc. 104.1 Cover Page Interactive Data File (embedded within the Inline XBRL document). 99.1 Press Release, dated December 5, 2025, jointly issued by Netflix, Inc. and Warner Bros. Discovery, Inc. 104.1 Cover Page Interactive Data File (embedded within the Inline XBRL document). 99.1 Press Release, dated December 5, 2025, jointly issued by Netflix, Inc. and Warner Bros. Discovery, Inc. Press Release, dated December 5, 2025, jointly issued by Netflix, Inc. and Warner Bros. Discovery, Inc. Press Release, dated December 5, 2025, jointly issued by Netflix, Inc. and Warner Bros. Discovery, Inc. 104.1 Cover Page Interactive Data File (embedded within the Inline XBRL document). Cover Page Interactive Data File (embedded within the Inline XBRL document). Important Information and Where to Find It In connection with the Merger between WBD and Netflix, Netflix intends to file with the U.S. Securities and Exchange Commission (the “SEC”) the Registration Statement, which will include a prospectus with respect to the shares of Buyer Common Stock to be issued in the Merger and a proxy statement for WBD’s stockholders (the “Proxy Statement/Prospectus”), and WBD intends to file with the SEC the proxy statement. The definitive proxy statement (if and when available) will be mailed to stockholders of WBD. WBD also intends to file a registration statement for SpinCo. Each of Netflix and WBD may also file with or furnish to the SEC other relevant documents regarding the Merger. This communication is not a substitute for the Registration Statement, the Proxy Statement/Prospectus or any other document that Netflix or WBD may file with the SEC or mail to WBD’s stockholders in connection with the Merger. INVESTORS AND SECURITY HOLDERS OF NETFLIX AND WBD ARE URGED TO READ THE REGISTRATION STATEMENT AND THE PROXY STATEMENT/PROSPECTUS INCLUDED WITHIN THE REGISTRATION STATEMENT WHEN THEY BECOME AVAILABLE, AS WELL AS ANY OTHER RELEVANT DOCUMENTS FILED WITH THE SEC IN CONNECTION WITH THE MERGER OR INCORPORATED BY REFERENCE INTO THE REGISTRATION STATEMENT AND THE PROXY STATEMENT/PROSPECTUS (INCLUDING ANY AMENDMENTS OR SUPPLEMENTS THERETO), BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION REGARDING NETFLIX, WBD, THE MERGER AND RELATED MATTERS. The documents filed by Netflix with the SEC also may be obtained free of charge at Netflix’s website at https://ir.netflix.net/home/default.aspx. The documents filed by WBD with the SEC also may be obtained free of charge at WBD’s website at https://ir.wbd.com. Participants in the Solicitation Netflix, WBD and certain of their respective directors and executive officers may be deemed to be participants in the solicitation of proxies from the stockholders of WBD in connection with the Merger under the rules of the SEC. Information about the interests of the directors and executive officers of Netflix and WBD and other persons who may be deemed to be participants in the solicitation of stockholders of WBD in connection with the Merger and a description of their direct and indirect interests, by security holdings or otherwise, will be included in the Proxy Statement/Prospectus, which will be filed with the SEC. Information about WBD’s directors and executive officers is set forth in WBD’s proxy statement for its 2025 Annual Meeting of Stockholders on Schedule 14A filed with the SEC on April 23, 2025, WBD’s Annual Report on Form 10-K for the year ended December 31, 2024, and any subsequent filings with the SEC. Information about Netflix’s directors and executive officers is set forth in Netflix’s proxy statement for its 2025 Annual Meeting of Stockholders on Schedule 14A filed with the SEC on April 15, 2025, and any subsequent filings with the SEC. Additional information regarding the direct and indirect interests of those persons and other persons who may be deemed participants in the Merger may be obtained by reading the Proxy Statement/Prospectus regarding the Merger when it becomes available. Free copies of these documents may be obtained as described above. No Offer or Solicitation This communication is for informational purposes only and does not constitute, or form a part of, an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended, and otherwise in accordance with applicable law. Cautionary Statement Regarding Forward-Looking Statements This document contains “forward-looking statements” within the meaning of the federal securities laws, including Section 27A of the U.S. Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on Netflix’s and WBD’s current expectations, estimates and projections about the expected date of closing of the Merger and the potential benefits thereof, their respective businesses and industries, management’s beliefs and certain assumptions made by Netflix and WBD, all of which are subject to change. All forward-looking statements by their nature address matters that involve risks and uncertainties, many of which are beyond our control and are not guarantees of future results, such as statements about the consummation of the Merger and the anticipated benefits thereof. These and other forward-looking statements, including the failure to consummate the Merger or to make or take any filing or other action required to consummate the transaction on a timely matter or at all, are not guarantees of future results and are subject to risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed in any forward-looking statements. Accordingly, there are or will be important factors that could cause actual results to differ materially from those indicated in such statements and, therefore, you should not place undue reliance on any such statements and caution must be exercised in relying on forward-looking statements. Important risk factors that may cause such a difference include, but are not limited to: (i) the completion of the Merger on anticipated terms and timing, including obtaining stockholder and regulatory approvals, consummating the Separation and the Distribution, anticipated tax treatment, unforeseen liabilities, future capital expenditures, revenues, expenses, earnings, synergies, economic performance, indebtedness, financial condition, losses, future prospects, business and management strategies, expansion and growth of WBD’s and Netflix’s businesses and other conditions to the completion of the Merger; (ii) failure to realize the anticipated benefits of the Merger, including as a result of delay in completing the transaction or integrating the businesses of Netflix and WBD; (iii) Netflix’s and WBD’s ability to implement their business strategies; (iv) pricing trends; (v) potential litigation relating to the Merger that could be instituted against Netflix, WBD or their respective directors; (vi) the risk that disruptions from the Merger will harm Netflix’s or WBD’s business, including current plans and operations; (vii) the ability of Netflix or WBD to retain and hire key personnel; (viii) potential adverse reactions or changes to business relationships resulting from the announcement, pendency or completion of the Merger; (ix) uncertainty as to the long-term value of Netflix’s common stock; (x) legislative, regulatory and economic developments affecting Netflix’s and WBD’s businesses; (xi) general economic and market developments and conditions; (xii) the evolving legal, regulatory and tax regimes under which Netflix and WBD operate; (xiii) potential business uncertainty, including changes to existing business relationships, during the pendency of the Merger that could affect Netflix’s or WBD’s financial performance; (xiv) restrictions during the pendency of the Merger that may impact Netflix’s or WBD’s ability to pursue certain business opportunities or strategic transactions; (xv) unpredictability and severity of catastrophic events, including, but not limited to, acts of terrorism or outbreak of war or hostilities, as well as Netflix’s and WBD’s response to any of the aforementioned factors; and (xvi) failure to receive the approval of the stockholders of WBD. These risks, as well as other risks associated with the Merger, will be more fully discussed in the proxy statement/prospectus to be filed with the SEC in connection with the Merger. While the list of factors presented here is, and the list of factors presented in the proxy statement/prospectus will be, considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Unlisted factors may present significant additional obstacles to the realization of forward-looking statements. Consequences of material differences in results as compared with those anticipated in the forward-looking statements could include, among other things, business disruption, operational problems, financial loss, legal liability to third parties and similar risks, any of which could have a material adverse effect on Netflix’s or WBD’s consolidated financial condition, results of operations or liquidity. Neither Netflix nor WBD assumes any obligation to publicly provide revisions or updates to any forward-looking statements, whether as a result of new information, future developments or otherwise, should circumstances change, except as otherwise required by securities and other applicable laws. the consummation of the Merger and the anticipated benefits thereof. These and other forward-looking statements, including the failure to consummate the Merger or to make or take any filing or other action required to consummate the transaction on a timely matter or at all, are not guarantees of future results and are subject to risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed in any forward-looking statements. Accordingly, there are or will be important factors that could cause actual results to differ materially from those indicated in such statements and, therefore, you should not place undue reliance on any such statements and caution must be exercised in relying on forward-looking statements. Important risk factors that may cause such a difference include, but are not limited to: (i) the completion of the Merger on anticipated terms and timing, including obtaining stockholder and regulatory approvals, consummating the Separation and the Distribution, anticipated tax treatment, unforeseen liabilities, future capital expenditures, revenues, expenses, earnings, synergies, economic performance, indebtedness, financial condition, losses, future prospects, business and management strategies, expansion and growth of WBD’s and Netflix’s businesses and other conditions to the completion of the Merger; (ii) failure to realize the anticipated benefits of the Merger, including as a result of delay in completing the transaction or integrating the businesses of Netflix and WBD; (iii) Netflix’s and WBD’s ability to implement their business strategies; (iv) pricing trends; (v) potential litigation relating to the Merger that could be instituted against Netflix, WBD or their respective directors; (vi) the risk that disruptions from the Merger will harm Netflix’s or WBD’s business, including current plans and operations; (vii) the ability of Netflix or WBD to retain and hire key personnel; (viii) potential adverse reactions or changes to business relationships resulting from the announcement, pendency or completion of the Merger; (ix) uncertainty as to the long-term value of Netflix’s common stock; (x) legislative, regulatory and economic developments affecting Netflix’s and WBD’s businesses; (xi) general economic and market developments and conditions; (xii) the evolving legal, regulatory and tax regimes under which Netflix and WBD operate; (xiii) potential business uncertainty, including changes to existing business relationships, during the pendency of the Merger that could affect Netflix’s or WBD’s financial performance; (xiv) restrictions during the pendency of the Merger that may impact Netflix’s or WBD’s ability to pursue certain business opportunities or strategic transactions; (xv) unpredictability and severity of catastrophic events, including, but not limited to, acts of terrorism or outbreak of war or hostilities, as well as Netflix’s and WBD’s response to any of the aforementioned factors; and (xvi) failure to receive the approval of the stockholders of WBD. These risks, as well as other risks associated with the Merger, will be more fully discussed in the proxy statement/prospectus to be filed with the SEC in connection with the Merger. While the list of factors presented here is, and the list of factors presented in the proxy statement/prospectus will be, considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Unlisted factors may present significant additional obstacles to the realization of forward-looking statements. Consequences of material differences in results as compared with those anticipated in the forward-looking statements could include, among other things, business disruption, operational problems, financial loss, legal liability to third parties and similar risks, any of which could have a material adverse effect on Netflix’s or WBD’s consolidated financial condition, results of operations or liquidity. Neither Netflix nor WBD assumes any obligation to publicly provide revisions or updates to any forward-looking statements, whether as a result of new information, future developments or otherwise, should circumstances change, except as otherwise required by securities and other applicable laws. the consummation of the Merger and the anticipated benefits thereof. These and other forward-looking statements, including the failure to consummate the Merger or to make or take any filing or other action required to consummate the transaction on a timely matter or at all, are not guarantees of future results and are subject to risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed in any forward-looking statements. Accordingly, there are or will be important factors that could cause actual results to differ materially from those indicated in such statements and, therefore, you should not place undue reliance on any such statements and caution must be exercised in relying on forward-looking statements. Important risk factors that may cause such a difference include, but are not limited to: (i) the completion of the Merger on anticipated terms and timing, including obtaining stockholder and regulatory approvals, consummating the Separation and the Distribution, anticipated tax treatment, unforeseen liabilities, future capital expenditures, revenues, expenses, earnings, synergies, economic performance, indebtedness, financial condition, losses, future prospects, business and management strategies, expansion and growth of WBD’s and Netflix’s businesses and other conditions to the completion of the Merger; (ii) failure to realize the anticipated benefits of the Merger, including as a result of delay in completing the transaction or integrating the businesses of Netflix and WBD; (iii) Netflix’s and WBD’s ability to implement their business strategies; (iv) pricing trends; (v) potential litigation relating to the Merger that could be instituted against Netflix, WBD or their respective directors; (vi) the risk that disruptions from the Merger will harm Netflix’s or WBD’s business, including current plans and operations; (vii) the ability of Netflix or WBD to retain and hire key personnel; (viii) potential adverse reactions or changes to business relationships resulting from the announcement, pendency or completion of the Merger; (ix) uncertainty as to the long-term value of Netflix’s common stock; (x) legislative, regulatory and economic developments affecting Netflix’s and WBD’s businesses; (xi) general economic and market developments and conditions; (xii) the evolving legal, regulatory and tax regimes under which Netflix and WBD operate; (xiii) potential business uncertainty, including changes to existing business relationships, during the pendency of the Merger that could affect Netflix’s or WBD’s financial performance; (xiv) restrictions during the pendency of the Merger that may impact Netflix’s or WBD’s ability to pursue certain business opportunities or strategic transactions; (xv) unpredictability and severity of catastrophic events, including, but not limited to, acts of terrorism or outbreak of war or hostilities, as well as Netflix’s and WBD’s response to any of the aforementioned factors; and (xvi) failure to receive the approval of the stockholders of WBD. These risks, as well as other risks associated with the Merger, will be more fully discussed in the proxy statement/prospectus to be filed with the SEC in connection with the Merger. While the list of factors presented here is, and the list of factors presented in the proxy statement/prospectus will be, considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Unlisted factors may present significant additional obstacles to the realization of forward-looking statements. Consequences of material differences in results as compared with those anticipated in the forward-looking statements could include, among other things, business disruption, operational problems, financial loss, legal liability to third parties and similar risks, any of which could have a material adverse effect on Netflix’s or WBD’s consolidated financial condition, results of operations or liquidity. Neither Netflix nor WBD assumes any obligation to publicly provide revisions or updates to any forward-looking statements, whether as a result of new information, future developments or otherwise, should circumstances change, except as otherwise required by securities and other applicable laws.\n"
  }
]