{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nproducts, demand, supply, product, computing, data, center, architecture, revenue, increased\n\nTEXT: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nTEXT: The following discussion and analysis of our financial condition and results of operations should be read in conjunction with “Item 1A. Risk Factors,” our Consolidated Financial Statements and related Notes thereto, as well as other cautionary statements and risks described elsewhere in this Annual Report on Form 10-K, before deciding to purchase, hold, or sell shares of our common stock.\nTITLE: Overview\nTITLE: Our Company and Our Businesses\nTEXT: NVIDIA pioneered accelerated computing to help solve the most challenging computational problems. Since our original focus on PC graphics, we have expanded to several other large and important computationally intensive fields. Fueled by the sustained demand for exceptional 3D graphics and the scale of the gaming market, NVIDIA has leveraged its GPU architecture to create platforms for scientific computing, AI, data science, AV, robotics, and digital twin applications.\nTEXT: Our two operating segments are \"Compute & Networking\" and \"Graphics.\" Refer to Note 16 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for additional information.\nTEXT: Headquartered in Santa Clara, California, NVIDIA was incorporated in California in April 1993 and reincorporated in Delaware in April 1998.\nTITLE: Recent Developments, Future Objectives and Challenges\nTITLE: Demand and Supply\nTEXT: Revenue growth in fiscal year 2025 was driven by data center compute and networking platforms for accelerated computing and AI solutions. Demand for our Hopper architecture drove our significant growth for the full year. We began shipping production systems of the Blackwell architecture in the fourth quarter of fiscal year 2025.\nTEXT: Demand estimates for our products, applications, and services can be incorrect and create volatility in our revenue or supply levels. We may not be able to generate significant revenue from them. Advancements in accelerated computing and generative AI models, along with the growth in model complexity and scale, have driven increased demand for our Data Center systems.\nTEXT: We continue to increase our supply and capacity purchases with existing and new suppliers to support our demand projections and increasing complexity of our data center products. With these additions, we have also entered and may continue to enter into prepaid manufacturing and capacity agreements to supply both current and future products. The increased purchase volumes and integration of new suppliers and contract manufacturers into our supply chain creates more complexity in managing multiple suppliers with variations in production planning, execution and logistics. Our expanding product portfolio and varying component compatibility and quality may lead to increased inventory levels. We have incurred and may in the future incur inventory provisions or impairments if our inventory or supply or capacity commitments exceed demand for our products or demand declines.\nTITLE: Product Transitions and New Product Introductions\nTEXT: Product transitions are complex and we often ship both new and prior architecture products simultaneously as our channel partners prepare to ship and support new products. We are generally in various stages of transitioning the architectures of our Data Center, Gaming, Professional Visualization, and Automotive products. The computing industry is experiencing a broader and faster launch cadence of accelerated computing platforms to meet a growing and diverse set of AI opportunities. We have introduced a new product and architecture cadence of our Data Center solutions where we seek to complete new computing solutions each year and provide a greater variety of Data Center offerings. The increased frequency of these transitions and the larger number of products and product configurations may magnify the challenges associated with managing our supply and demand which may further create volatility in our revenue. The increased frequency and complexity of newly introduced products could result in quality or production issues that could increase inventory provisions, warranty, or other costs or result in product delays. We incur significant engineering development resources for new products, and changes to our product roadmap may impact our ability to develop other products or adequately manage our supply chain cost. Customers may delay purchasing existing products as we increase the frequency of new products or may not be able to adopt our new products as fast as forecasted, both impacting the timing of our revenue and supply chain cost. While we have managed prior product transitions and have sold multiple product architectures at the same time, these transitions are difficult, may impair our ability to predict demand and impact our supply mix, and may cause us to incur additional costs.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nproducts, licensing, export, china, requirements, license, certain, controls, will, impact\n\nTITLE: Global Trade\nTEXT: In August 2022, the USG announced licensing requirements that, with certain exceptions, impact exports to China (including Hong Kong and Macau) and Russia of our A100 and H100 integrated circuits, DGX or any other systems or boards which incorporate A100 or H100 integrated circuits.\nTEXT: In July 2023, the USG informed us of an additional licensing requirement for a subset of A100 and H100 products destined to certain customers and other regions, including some countries in the Middle East.\nTEXT: In October 2023, the USG announced new and updated licensing requirements that became effective in our fourth quarter of fiscal year 2024 for exports to China and Country Groups D1, D4, and D5 (including but not limited to Saudi Arabia, the United Arab Emirates, and Vietnam, but excluding Israel) of our products exceeding certain performance thresholds, including, but not limited to, the A100, A800, H100, H800, L4, L40, L40S and RTX 4090. The licensing requirements also apply to the export of products exceeding certain performance thresholds to a party headquartered in, or with an ultimate parent headquartered in, Country Group D5, including China. On October 23, 2023, the USG informed us that the licensing requirements were effective immediately for shipments of our A100, A800, H100, H800, and L40S products (removing the grace period granted by the official rule). Blackwell systems, such as GB200 NVL 72 and NVL 36 as well as B200 are also subject to these requirements and therefore require a license for any shipment to certain entities and to China and Country Groups D1, D4 and D5, excluding Israel. To date, we have not received licenses to ship these restricted products to China. Additionally, we understand that partners and customers have also not received a license to ship these restricted products.\nTEXT: We expanded our Data Center product portfolio to offer new solutions, including those for which the USG does not require a license or advance notice before each shipment. We ramped new products designed specifically for China that do not require an export control license. Our Data Center revenue in China grew in fiscal year 2025. As a percentage of total Data Center revenue, it remains well below levels seen prior to the onset of export controls in October 2023. The market in China for datacenter solutions remains competitive. We will continue to comply with export controls while serving our customers. To the extent that a customer requires products covered by the licensing requirements, we may seek a license for the customer but have no assurance that the USG will grant such a license, or that the USG will act on the license application in a timely manner or at all.\nTEXT: On January 15, 2025, the USG published the “AI Diffusion” IFR in the Federal Register. After a 120-day delayed compliance period, the IFR will, unless modified, impose a worldwide licensing requirement on all products classified under Export Control Classification Numbers, or ECCNs, 3A090.a, 4A090.a, or corresponding .z ECCNs, including all related software and technology. Any system that incorporates one or more of the covered integrated circuits, or ICs, (including but not limited to NVIDIA DGX, HGX, and MGX systems) will be covered by the new licensing requirement. The licensing requirement will include future NVIDIA ICs, boards, or systems classified with ECCN 3A090.a or 4A090.a, or corresponding .z ECCNs, achieving certain total processing performance and/or performance density.\nTEXT: Unless a license exception is available, the worldwide licensing requirements will apply to the following NVIDIA products, and any others we develop that meet the characteristics of 3A090.a or 4A090.a, including but not limited to: A100, A800, H100, H200, H800, B100, B200, GB200, L4, L40S, and RTX 6000 Ada.\nTEXT: Our competitive position has been harmed by the existing export controls, and our competitive position and future results may be further harmed, over the long term, if there are further changes in the USG’s export controls. Given the increasing strategic importance of AI and rising geopolitical tensions, the USG has changed and may again change the export control rules at any time and further subject a wider range of our products to export restrictions and licensing requirements, negatively impacting our business and financial results. In the event of such change, we may be unable to sell our inventory of such products and may be unable to develop replacement products not subject to the licensing requirements, effectively excluding us from all or part of the China market, as well as other impacted markets, including the Middle East and countries designated “Tier 2” by the AI Diffusion IFR. In addition to export controls, the USG may impose restrictions on the import and sale of products that incorporate technologies developed or manufactured in whole or in part in China. For example, the USG is considering restrictions on the import and sale of certain automotive products in the United States, which if adopted and interpreted broadly, could impact our ability to develop and supply solutions for our automotive customers.\nTEXT: While we work to enhance the resiliency and redundancy of our supply chain, which is currently concentrated in the Asia-Pacific region, new and existing export controls or changes to existing export controls could limit alternative manufacturing locations and negatively impact our business. Refer to “Item 1A. Risk Factors – Risks Related to Regulatory, Legal, Our Stock and Other Matters” for a discussion of this potential impact.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenue, fiscal, operations, impact, driven, costs, product, supply, chain, development\n\nTITLE: Macroeconomic Factors\nTEXT: Macroeconomic factors, including inflation, interest rate changes, capital market volatility, global supply chain constraints, tariffs, and global economic and geopolitical developments, may have direct and indirect impacts on our results of operations, particularly demand for our products. While difficult to isolate and quantify, these macroeconomic factors impact our supply chain and manufacturing costs, employee wages, costs for capital equipment and value of our investments. Our product and solution pricing generally does not fluctuate with short-term changes in our costs. Within our supply chain, we continuously manage product availability and costs with our vendors.\nTITLE: Israel and Regional Conflicts\nTEXT: We are monitoring the impact of the geopolitical conflict in and around Israel on our operations, including the health and safety of our approximately 4,700 employees in the region who primarily support the research and development, operations, and sales and marketing of our networking products. Our global supply chain for our networking products has not experienced any significant impact. Some of our employees in the region have been on active military duty for an extended period and may continue to be absent, which may cause disruption to our product development or operations. We have not experienced significant impact or expense to our business; however, if the conflict is further extended or expanded, it could impact future product development, operations, and revenue or create other uncertainty for our business.\nTITLE: Fiscal Year 2025 Summary\nTEXT: Year Ended Jan 26, 2025Jan 28, 2024Change($ in millions, except per share data)Revenue$130,497 $60,922 Up 114%Gross margin75.0 %72.7 %Up 2.3 ptsOperating expenses$16,405 $11,329 Up 45%Operating income$81,453 $32,972 Up 147%Net income$72,880 $29,760 Up 145%Net income per diluted share$2.94 $1.19 Up 147%\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024 Change; Revenue $ 130,497 $ 60,922 Up 114%; Gross margin 75.0 % 72.7 % Up 2.3 pts; Operating expenses $ 16,405 $ 11,329 Up 45%; Operating income $ 81,453 $ 32,972 Up 147%; Net income $ 72,880 $ 29,760 Up 145%; Net income per diluted share $ 2.94 $ 1.19 Up 147%.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024Change\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: Change\nTEXT: We specialize in markets where our computing platforms can provide tremendous acceleration for applications. These platforms incorporate processors, interconnects, software, algorithms, systems, and services to deliver unique value. Our platforms address four large markets where our expertise is critical: Data Center, Gaming, Professional Visualization, and Automotive.\nTEXT: Revenue for fiscal year 2025 was $130.5 billion, up 114% from a year ago.\nTEXT: Data Center revenue for fiscal year 2025 was up 142% from a year ago. The strong year-on-year growth was driven by demand for our Hopper architecture accelerated computing platform used for large language models, recommendation engines, and generative AI applications. We began shipping production systems of the Blackwell architecture in the fourth quarter of fiscal year 2025.\nTEXT: Gaming revenue for fiscal year 2025 was up 9% from a year ago, driven by sales of our GeForce RTX 40 Series GPUs.\nTEXT: Professional Visualization revenue for fiscal year 2025 was up 21% from a year ago, driven by the continued ramp of Ada RTX GPU workstations for use cases such as generative AI-powered design, simulation, and engineering.\nTEXT: Automotive revenue for fiscal year 2025 was up 55% from a year ago, driven by sales of our self-driving platforms.\nTEXT: Gross margin increased in fiscal year 2025 driven by a higher mix of Data Center revenue.\nTEXT: Operating expenses for fiscal year 2025 were up 45% from a year ago, driven by higher compensation and benefits expenses due to employee growth and compensation increases, and engineering development, compute and infrastructure costs for new product introductions.\nTITLE: Critical Accounting Estimates\nTEXT: Our consolidated financial statements are prepared in accordance with accounting principles generally accepted in the United States, or U.S. GAAP. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue, cost of revenue, expenses and related disclosure of contingencies. Critical accounting estimates are those estimates that involve a significant level of estimation uncertainty and could have a material impact on our financial condition or results of operations. We have critical accounting estimates in the areas of inventories, income taxes, and revenue recognition. Refer to Note 1 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for a summary of significant accounting policies.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nbased, inventory, product, products, demand, customer, which, income, return, cost\n\nTITLE: Inventories\nTEXT: We charge cost of sales for inventory provisions to write-down our inventory to the lower of cost or net realizable value or for obsolete or excess inventory, and for excess product purchase commitments. Most of our inventory provisions relate to excess quantities of products or components, based on our inventory levels and future product purchase\nTEXT: commitments compared to assumptions about future demand and market conditions, which requires management judgment.\nTEXT: Situations that may result in excess or obsolete inventory or excess product purchase commitments include changes in business and economic conditions, changes in market conditions, sudden and significant decreases in demand for our products, including potential cancellation or deferral of customer purchase orders, inventory obsolescence because of changing technology and customer requirements, new product introductions resulting in less demand for existing products or inconsistent spikes in demand, failure to estimate customer demand properly, ordering in advance of historical lead-times, government regulations and the impact of changes in future demand, or increase in demand for competitive products, including competitive actions.\nTEXT: The net effect on our gross margin from inventory provisions and sales of items previously written down was an unfavorable impact of 2.3% in fiscal year 2025 and 2.7% in fiscal year 2024. Our inventory and capacity purchase commitments are based on forecasts of future customer demand and consider our third-party manufacturers' lead times and constraints. Our manufacturing lead times can be and have been long, and in some cases, extended beyond twelve months for some products. We may place non-cancellable inventory orders for certain product components in advance of our historical lead times, pay premiums and provide deposits to secure future supply and capacity. We also adjust to other market factors, such as product offerings and pricing actions by our competitors, new product transitions, and macroeconomic conditions - all of which may impact demand for our products.\nTEXT: Refer to the Gross Profit and Gross Margin discussion below in this Management's Discussion and Analysis for further discussion.\nTITLE: Income Taxes\nTEXT: We are subject to income taxes in the U.S. and foreign jurisdictions. Our calculation of deferred tax assets and liabilities is based on certain estimates and judgments and involves dealing with uncertainties in the application of complex tax laws. Our estimates of deferred tax assets and liabilities may change based, in part, on added certainty or finality to an anticipated outcome, changes in accounting standards or tax laws in the U.S. or foreign jurisdictions where we operate, or changes in other facts or circumstances. In addition, we recognize liabilities for potential U.S. and foreign income tax contingencies based on our estimate of whether, and the extent to which, additional taxes may be due. If we determine that payment of these amounts is unnecessary or if the recorded tax liability is less than our current assessment, we may be required to recognize an income tax benefit or additional income tax expense in our financial statements accordingly.\nTEXT: We record a valuation allowance to reduce deferred tax assets to the amount that is believed more likely than not to be realized based on all available evidence. To the extent realization of the deferred tax assets becomes more-likely-than-not, we would recognize such deferred tax assets as income tax benefits during the period.\nTEXT: We recognize the benefit from a tax position only if it is more-likely-than-not that the position would be sustained upon audit based solely on the technical merits of the tax position. Our policy is to include interest and penalties related to unrecognized tax benefits as a component of income tax expense.\nTITLE: Revenue Recognition\nTITLE: Revenue Allowances\nTEXT: For products sold with a right of return, we record a reduction to revenue by establishing a sales return allowance for estimated product returns at the time revenue is recognized, based primarily on historical return rates. However, if product returns for a fiscal period are anticipated to exceed historical return rates, we may determine that additional sales return allowances are required to reflect our estimated exposure for product returns. Return rights for certain stocking distributors for specific products are contractually limited based on a percentage of prior quarter shipments. For shipments to other customers, we do not allow returns, although we may approve returns for credit or refund based on applicable facts and circumstances.\nTEXT: We account for customer programs, which involve rebates and marketing development funds, or MDFs, as a reduction in revenue and accrue for such programs based on the amount we expect to be claimed by customers. Certain customer programs include distributor price incentives or other channel programs for specific products and customer classes which require judgement as to whether the applicable incentives will be attained. Estimates for customer program accruals include a combination of historical attainment and claim rates and may be adjusted based on relevant internal and external factors.\nTITLE: License and Development Arrangements\nTEXT: Revenue from License and Development Arrangements is recognized over the period in which the development services are performed. Each fiscal reporting period, we measure progress to completion based on actual cost incurred to date as a percentage of the estimated total cost required to complete each project. Estimated total cost for each project includes a forecast of internal engineer personnel time expected to be incurred and other third-party costs as applicable.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenue, income, customers, operating, networking, performance, products, standalone, total, price\n\nTITLE: Contracts with Multiple Performance Obligations\nTEXT: Our contracts may contain more than one performance obligation. Judgement is required in determining whether each performance obligation within a customer contract is distinct. Except for License and Development Arrangements, NVIDIA products and services function on a standalone basis and do not require a significant amount of integration or interdependency. Therefore, multiple performance obligations contained within a customer contract are considered distinct and are not combined for revenue recognition purposes.\nTEXT: We allocate the total transaction price to each distinct performance obligation in an arrangement with multiple performance obligations on a relative standalone selling price basis. In certain cases, we can establish standalone selling price based on directly observable prices of products or services sold separately in comparable circumstances to similar customers. If standalone selling price is not directly observable, such as when we do not sell a product or service separately, we determine standalone selling price based on market data and other observable inputs.\nTITLE: Results of Operations\nTEXT: A discussion regarding our financial condition and results of operations for fiscal year 2025 compared to fiscal year 2024 is presented below. A discussion regarding our financial condition and results of operations for fiscal year 2024 compared to fiscal year 2023 can be found under Item 7 in our Annual Report on Form 10-K for the fiscal year ended January 28, 2024, filed with the SEC on February 21, 2024, which is available free of charge on the SEC’s website at http://www.sec.gov and at our investor relations website, http://investor.nvidia.com.\nTEXT: The following table sets forth, for the periods indicated, certain items in our Consolidated Statements of Income expressed as a percentage of revenue.\nTEXT: Year Ended Jan 26, 2025Jan 28, 2024Revenue100.0 %100.0 %Cost of revenue25.0 27.3 Gross profit75.0 72.7 Operating expenses Research and development9.9 14.2 Sales, general and administrative2.7 4.4 Total operating expenses12.6 18.6 Operating income62.4 54.1 Interest income1.4 1.4 Interest expense(0.2)(0.4)Other, net0.8 0.4 Other income (expense), net2.0 1.4 Income before income tax64.4 55.5 Income tax expense8.6 6.6 Net income55.8 %48.9 %\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024; Revenue 100.0 % 100.0 %; Cost of revenue 25.0 27.3; Gross profit 75.0 72.7; Research and development 9.9 14.2; Sales, general and administrative 2.7 4.4; Total operating expenses 12.6 18.6; Operating income 62.4 54.1; Interest income 1.4 1.4; Interest expense (0.2) (0.4); Other, net 0.8 0.4; Other income (expense), net 2.0 1.4; Income before income tax 64.4 55.5; Income tax expense 8.6 6.6; Net income 55.8 % 48.9 %.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: Reportable Segments\nTITLE: Revenue by Reportable Segments\nTEXT: Year EndedJan 26, 2025Jan 28, 2024$Change%Change($ in millions)Compute & Networking$116,193 $47,405 $68,788 145 %Graphics14,304 13,517 787 6 %Total$130,497 $60,922 $69,575 114 %\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024 $Change %Change; Compute & Networking $ 116,193 $ 47,405 $ 68,788 145 %; Graphics 14,304 13,517 787 6 %; Total $ 130,497 $ 60,922 $ 69,575 114 %.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024$Change%Change\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: $Change\nTITLE: %Change\nTITLE: Operating Income by Reportable Segments\nTEXT: Year EndedJan 26, 2025Jan 28, 2024$Change%Change($ in millions)Compute & Networking$82,875 $32,016 $50,859 159 %Graphics5,085 5,846 (761)(13)%All Other(6,507)(4,890)(1,617)33 %Total$81,453 $32,972 $48,481 147 %\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024 $Change %Change; Compute & Networking $ 82,875 $ 32,016 $ 50,859 159 %; Graphics 5,085 5,846 (761) (13) %; All Other (6,507) (4,890) (1,617) 33 %; Total $ 81,453 $ 32,972 $ 48,481 147 %.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024$Change%Change\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: $Change\nTITLE: %Change\nTEXT: Compute & Networking revenue – The year over year increase was due to strong demand for our accelerated computing and AI solutions. Revenue from Data Center computing grew 162% driven primarily by demand for our Hopper computing platform used for large language models, recommendation engines, and generative AI applications. Revenue from Data Center networking grew 51% driven by Ethernet for AI revenue, which includes Spectrum-X end-to-end ethernet platform.\nTEXT: Graphics revenue – The year over year increase was driven by sales of our GeForce RTX 40 Series GPUs.\nTEXT: Reportable segment operating income – The year over year increase in Compute & Networking segment operating income was driven by growth in revenue. The year over year decrease in Graphics segment operating income was driven by an increase of 44% in segment operating expenses, partially offset by growth in revenue.\nTEXT: All Other operating loss – The year over year increase was due to an increase in stock-based compensation expense reflecting employee growth and compensation increases.\nTITLE: Concentration of Revenue\nTEXT: We refer to customers who purchase products directly from NVIDIA as direct customers, such as AIBs, distributors, ODMs, OEMs, and system integrators. We have certain customers that may purchase products directly from NVIDIA and may use either internal resources or third-party system integrators to complete their build. We also have indirect customers, who purchase products through our direct customers; indirect customers include CSPs, consumer internet companies, enterprises, and public sector entities.\nTEXT: Direct Customers – Sales to direct customers which represented 10% or more of total revenue, all of which were primarily attributable to the Compute & Networking segment, are presented in the following table:\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenue, fiscal, costs, compensation, total, customer, primarily, securities, indirect, based\n\nTITLE: Year EndedJan 26, 2025Jan 28, 2024Direct Customer A12 %*Direct Customer B11 %13 %Direct Customer C11 %*\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024; Direct Customer A 12 % *; Direct Customer B 11 % 13 %; Direct Customer C 11 % *.\nTITLE: Year EndedJan 26, 2025Jan 28, 2024Direct Customer A12 %*Direct Customer B11 %13 %Direct Customer C11 %*\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTEXT: * Less than 10% of total revenue.\nTEXT: No customer represented 10% or more of total revenue for fiscal year 2023.\nTEXT: Indirect Customers – Indirect customer revenue is an estimation based upon multiple factors including customer purchase order information, product specifications, internal sales data, and other sources. Actual indirect customer revenue may differ from our estimates. For fiscal year 2025, an indirect customer which primarily purchases our products through system integrators and distributors, including through Direct Customer B, is estimated to represent 10% or more of total revenue, attributable to the Compute & Networking segment.\nTEXT: We have experienced periods where we receive a significant amount of our revenue from a limited number of customers, and this trend may continue.\nTEXT: Revenue by geographic region is designated based on the billing location even if the revenue may be attributable to indirect customers in a different location. Revenue from sales to customers outside of the United States accounted for 53% and 56% of total revenue for fiscal years 2025 and 2024, respectively.\nTITLE: Gross Profit and Gross Margin\nTEXT: Gross profit consists of total net revenue less cost of revenue. Cost of revenue consists primarily of the cost of semiconductors, including wafer fabrication, assembly, testing and packaging, board and device costs, manufacturing support costs, including labor and overhead associated with such purchases, final test yield fallout, inventory and warranty provisions, memory and component costs, tariffs, and shipping costs. Cost of revenue also includes acquisition-related intangible amortization expense, costs for license and development and service arrangements, IP-related costs, and stock-based compensation related to personnel associated with manufacturing operations.\nTEXT: Gross margins increased to 75.0% in fiscal year 2025 from 72.7% in fiscal year 2024. The year over year increase was primarily driven by a higher mix of Data Center revenue.\nTEXT: Provisions for inventory and excess inventory purchase obligations totaled $3.7 billion and $2.2 billion for fiscal years 2025 and 2024, respectively. Sales of previously reserved inventory and settlements of excess inventory purchase obligations resulted in a provision release of $689 million and $540 million for fiscal years 2025 and 2024, respectively. The net effect on our gross margin was an unfavorable impact of 2.3% and 2.7% in fiscal years 2025 and 2024, respectively.\nTITLE: Operating Expenses\nTEXT: Year Ended Jan 26, 2025Jan 28, 2024$Change%Change ($ in millions)Research and development expenses$12,914 $8,675 $4,239 49 %% of net revenue9.9 %14.2 % Sales, general and administrative expenses3,491 2,654 837 32 %% of net revenue2.7 %4.4 % Total operating expenses$16,405 $11,329 $5,076 45 %% of net revenue12.6 %18.6 %\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024 $Change %Change; Research and development expenses $ 12,914 $ 8,675 $ 4,239 49 %; % of net revenue 9.9 % 14.2 %; Sales, general and administrative expenses 3,491 2,654 837 32 %; % of net revenue 2.7 % 4.4 %; Total operating expenses $ 16,405 $ 11,329 $ 5,076 45 %; % of net revenue 12.6 % 18.6 %.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024$Change%Change\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: $Change\nTITLE: %Change\nTEXT: The increases in research and development expenses for fiscal year 2025 were driven by a 32% increase in compensation and benefits, including stock-based compensation, reflecting employee growth and compensation increases, a 100% increase in compute and infrastructure, and a 234% increase in engineering development costs for new product introductions.\nTEXT: The increases in sales, general and administrative expenses for fiscal year 2025 were primarily driven by compensation and benefits, including stock-based compensation, reflecting employee growth and compensation increases.\nTITLE: Other Income (Expense), Net\nTEXT: Year Ended Jan 26, 2025Jan 28, 2024$Change ($ in millions)Interest income$1,786 $866 $920 Interest expense(247)(257)10 Other, net1,034 237 797 Other income (expense), net$2,573 $846 $1,727\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024 $Change; Interest income $ 1,786 $ 866 $ 920; Interest expense (247) (257) 10; Other, net 1,034 237 797; Other income (expense), net $ 2,573 $ 846 $ 1,727.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024$Change\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: $Change\nTEXT: The increase in interest income was primarily due to growth in cash, cash equivalents, and marketable securities.\nTEXT: Interest expense is comprised of coupon interest and debt discount amortization related to our notes.\nTEXT: Other, net consists of realized or unrealized gains and losses from investments in non-marketable equity securities, publicly-held equity securities, and the impact of changes in foreign currency rates. The change in Other, net, compared to fiscal year 2024, was primarily driven by an increase in fair value of our non-marketable equity securities and publicly-held equity securities. Refer to Note 8 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for additional information regarding our non-marketable equity securities.\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, securities, fiscal, income, marketable, equivalents, activities, rate, increased, primarily\n\nTITLE: Income Taxes\nTEXT: Income tax expense was $11.1 billion and $4.1 billion for fiscal years 2025 and 2024, respectively. Income tax as a percentage of income before income tax was an expense of 13.3% and 12.0% for fiscal years 2025 and 2024, respectively.\nTEXT: The effective tax rate increased primarily due to higher pre-tax income and a prior year discrete benefit due to an audit resolution.\nTEXT: Our effective tax rates for fiscal years 2025 and 2024 were lower than the U.S. federal statutory rate of 21% due primarily to tax benefits from the FDII deduction, stock-based compensation, the U.S. federal research tax credit, and income earned in jurisdictions that are subject to taxes at rates lower than the U.S. federal statutory tax rate. Our effective tax rate for fiscal year 2024 was additionally benefited by the audit resolution.\nTEXT: Given our current and possible future earnings, we believe that we may release the valuation allowance associated with certain state deferred tax assets in the near term, which would decrease our income tax expense for the period the release is recorded. The timing and amount of the valuation allowance release could vary based on our assessment of all available information.\nTEXT: Refer to Note 13 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for additional information.\nTITLE: Liquidity and Capital Resources\nTEXT: Jan 26, 2025Jan 28, 2024 (In millions)Cash and cash equivalents$8,589 $7,280 Marketable securities34,621 18,704 Cash, cash equivalents, and marketable securities$43,210 $25,984\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024; Cash and cash equivalents $ 8,589 $ 7,280; Marketable securities 34,621 18,704; Cash, cash equivalents, and marketable securities $ 43,210 $ 25,984.\nTITLE: Jan 26, 2025Jan 28, 2024\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTEXT: Year EndedJan 26, 2025Jan 28, 2024 (In millions)Net cash provided by operating activities$64,089 $28,090 Net cash used in investing activities$(20,421)$(10,566)Net cash used in financing activities$(42,359)$(13,633)\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024; Net cash provided by operating activities $ 64,089 $ 28,090; Net cash used in investing activities $ (20,421) $ (10,566); Net cash used in financing activities $ (42,359) $ (13,633).\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTEXT: Our investment policy requires the purchase of highly-rated fixed income securities, the diversification of investment types and credit exposures, and certain maturity limits on our portfolio.\nTEXT: Cash provided by operating activities increased in fiscal year 2025 compared to fiscal year 2024, due to growth in revenue.\nTEXT: Cash used in investing activities increased in fiscal year 2025 compared to fiscal year 2024, primarily driven by net purchases of marketable securities, and purchase of land, property and equipment.\nTEXT: Cash used in financing activities increased in fiscal year 2025 compared to fiscal year 2024, mainly due to higher share repurchases and higher tax payments related to RSUs.\nTITLE: Liquidity\nTEXT: Our primary sources of liquidity include cash, cash equivalents, marketable securities, and cash generated by our operations. As of January 26, 2025, we had $43.2 billion in cash, cash equivalents, and marketable securities. We believe that we have sufficient liquidity to meet our operating requirements for at least the next twelve months and thereafter for the foreseeable future, including our future supply obligations and share purchases. We continuously evaluate our liquidity and capital resources, including our access to external capital, to ensure we can finance future capital requirements.\nTEXT: Our marketable securities consist of publicly-held equity securities, debt securities issued by the U.S. government and its agencies, highly rated corporations and financial institutions, and foreign government entities, as well as certificates of deposit issued by highly rated financial institutions. These marketable securities are primarily denominated in U.S. dollars. Refer to Note 7 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for additional information.\nTEXT: Except for approximately $1.7 billion of cash, cash equivalents, and marketable securities held outside the U.S. for which we have not accrued any related foreign or state taxes if we repatriate these amounts to the U.S., substantially all of our cash, cash equivalents and marketable securities held outside the U.S. at the end of fiscal year 2025 are available for use in the U.S. without incurring additional U.S. federal income taxes.\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, note, share, repurchase, shares, january, refer, notes, consolidated, financial\n\nTITLE: Capital Return to Shareholders\nTEXT: On August 26, 2024, our Board of Directors approved an additional $50 billion to our share repurchase authorization, without expiration. In fiscal year 2025, we repurchased 310 million shares of our common stock for $34.0 billion. As of January 26, 2025, we were authorized, subject to certain specifications, to repurchase up to $38.7 billion of our common stock.\nTEXT: From January 27, 2025 through February 21, 2025, we repurchased 29 million shares for $3.7 billion pursuant to a pre-established trading plan. Our share repurchase program aims to offset dilution from shares issued to employees while maintaining adequate liquidity to meet our operating requirements. We may pursue additional share repurchases as we weigh market factors and other investment opportunities.\nTEXT: In fiscal year 2025, we paid cash dividends to our shareholders of $834 million. The payment of future cash dividends is subject to our Board of Directors' continuing determination that the declaration of dividends is in the best interests of our shareholders.\nTEXT: The U.S. Inflation Reduction Act of 2022 requires a 1% excise tax on certain share repurchases in excess of shares issued for employee compensation made after December 31, 2022. The excise tax is included in our share repurchase cost and was not material for fiscal years 2025 and 2024.\nTITLE: Outstanding Indebtedness and Commercial Paper Program\nTEXT: Our aggregate debt maturities as of January 26, 2025, by year payable, are as follows:\nTEXT: Jan 26, 2025 (In millions)Due in one year$— Due in one to five years2,250 Due in five to ten years2,750 Due in greater than ten years3,500 Unamortized debt discount and issuance costs(37)Net long-term carrying amount$8,463\nTABLE: TABLE: Due in one year $ —; Due in one to five years 2,250; Due in five to ten years 2,750; Due in greater than ten years 3,500; Unamortized debt discount and issuance costs (37); Net long-term carrying amount $ 8,463.\nTITLE: Jan 26, 2025\nTEXT: We have a $575 million commercial paper program to support general corporate purposes. As of January 26, 2025, we had no commercial paper outstanding.\nTEXT: Refer to Note 11 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for further discussion.\nTITLE: Material Cash Requirements and Other Obligations\nTEXT: For a description of our long-term debt, purchase obligations, and operating lease obligations, refer to Note 11, Note 12, and Note 17 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K, respectively.\nTEXT: During fiscal year 2025 and fiscal year 2024, we spent $3.4 billion and $1.1 billion on capital expenditures, respectively. We expect to increase capital expenditures in fiscal year 2026 relative to fiscal year 2025 to support the future growth of our business.\nTEXT: Unrecognized tax benefits of $2.2 billion, which includes related interest and penalties of $251 million, were recorded in non-current income tax payable at the end of fiscal year 2025. We are unable to estimate the timing of any potential tax liability, interest payments, or penalties in individual years due to uncertainties in the underlying income tax positions and the timing of the effective settlement of such tax positions. Refer to Note 13 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for further information.\nTITLE: Climate Change\nTEXT: To date, there has been no material impact to our results of operations associated with global sustainability regulations, compliance, costs from sourcing renewable energy or climate-related business trends.\nTITLE: Adoption of New and Recently Issued Accounting Pronouncements\nTEXT: Refer to Note 1 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for a discussion of adoption of new and recently issued accounting pronouncements.\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, loss, other, change, unrealized, gain, operating, expense, comprehensive, endedjan\n\nTITLE: NVIDIA Corporation and Subsidiaries\nTITLE: Consolidated Statements of Income\nTITLE: (In millions, except per share data)\nTEXT: Year EndedJan 26, 2025Jan 28, 2024Jan 29, 2023Revenue$130,497 $60,922 $26,974 Cost of revenue32,639 16,621 11,618 Gross profit97,858 44,301 15,356 Operating expensesResearch and development12,914 8,675 7,339 Sales, general and administrative3,491 2,654 2,440 Acquisition termination cost— — 1,353 Total operating expenses16,405 11,329 11,132 Operating income81,453 32,972 4,224 Interest income1,786 866 267 Interest expense(247)(257)(262)Other, net1,034 237 (48)Other income (expense), net2,573 846 (43)Income before income tax84,026 33,818 4,181 Income tax expense (benefit)11,146 4,058 (187)Net income$72,880 $29,760 $4,368 Net income per share:Basic$2.97 $1.21 $0.18 Diluted$2.94 $1.19 $0.17 Weighted average shares used in per share computation:Basic24,555 24,690 24,870 Diluted24,804 24,940 25,070\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024 Jan 29, 2023; Revenue $ 130,497 $ 60,922 $ 26,974; Cost of revenue 32,639 16,621 11,618; Gross profit 97,858 44,301 15,356; Research and development 12,914 8,675 7,339; Sales, general and administrative 3,491 2,654 2,440; Acquisition termination cost — — 1,353; Total operating expenses 16,405 11,329 11,132; Operating income 81,453 32,972 4,224; Interest income 1,786 866 267; Interest expense (247) (257) (262); Other, net 1,034 237 (48); Other income (expense), net 2,573 846 (43); Income before income tax 84,026 33,818 4,181; Income tax expense (benefit) 11,146 4,058 (187); Net income $ 72,880 $ 29,760 $ 4,368; Basic $ 2.97 $ 1.21 $ 0.18; Diluted $ 2.94 $ 1.19 $ 0.17; Basic 24,555 24,690 24,870; Diluted 24,804 24,940 25,070.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024Jan 29, 2023\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTEXT: See accompanying Notes to the Consolidated Financial Statements.\nTITLE: NVIDIA Corporation and Subsidiaries\nTITLE: Consolidated Statements of Comprehensive Income\nTITLE: (In millions)\nTEXT: Year EndedJan 26, 2025Jan 28, 2024Jan 29, 2023Net income$72,880 $29,760 $4,368 Other comprehensive income (loss), net of taxAvailable-for-sale securities:Net change in unrealized gain (loss)1 80 (31)Reclassification adjustments for net realized gain included in net income— — 1 Net change in unrealized gain (loss)1 80 (30)Cash flow hedges:Net change in unrealized gain21 38 47 Reclassification adjustments for net realized loss included in net income(21)(48)(49)Net change in unrealized loss— (10)(2)Other comprehensive income (loss), net of tax1 70 (32)Total comprehensive income$72,881 $29,830 $4,336\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024 Jan 29, 2023; Net income $ 72,880 $ 29,760 $ 4,368; Net change in unrealized gain (loss) 1 80 (31); Reclassification adjustments for net realized gain included in net income — — 1; Net change in unrealized gain (loss) 1 80 (30); Net change in unrealized gain 21 38 47; Reclassification adjustments for net realized loss included in net income (21) (48) (49); Net change in unrealized loss — (10) (2); Other comprehensive income (loss), net of tax 1 70 (32); Total comprehensive income $ 72,881 $ 29,830 $ 4,336.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024Jan 29, 2023\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTEXT: See accompanying Notes to the Consolidated Financial Statements.\nTITLE: NVIDIA Corporation and Subsidiaries\nTITLE: Consolidated Balance Sheets\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nassets, liabilities, shares, total, issued, current, other, shareholders, term, stock\n\nTITLE: (In millions, except par value)\nTEXT: Jan 26, 2025Jan 28, 2024Assets Current assets: Cash and cash equivalents$8,589 $7,280 Marketable securities34,621 18,704 Accounts receivable, net23,065 9,999 Inventories10,080 5,282 Prepaid expenses and other current assets3,771 3,080 Total current assets80,126 44,345 Property and equipment, net6,283 3,914 Operating lease assets1,793 1,346 Goodwill5,188 4,430 Intangible assets, net807 1,112 Deferred income tax assets10,979 6,081 Other assets6,425 4,500 Total assets$111,601 $65,728 Liabilities and Shareholders' EquityCurrent liabilities:Accounts payable$6,310 $2,699 Accrued and other current liabilities11,737 6,682 Short-term debt— 1,250 Total current liabilities18,047 10,631 Long-term debt8,463 8,459 Long-term operating lease liabilities 1,519 1,119 Other long-term liabilities4,245 2,541 Total liabilities32,274 22,750 Commitments and contingencies - see Note 12— — Shareholders’ equity:Preferred stock, $0.001 par value; 20 shares authorized; none issued— — Common stock, $0.001 par value; 80,000 shares authorized; 24,477 shares issued and outstanding as of January 26, 2025; 24,643 shares issued and outstanding as of January 28, 202424 25 Additional paid-in capital11,237 13,109 Accumulated other comprehensive income28 27 Retained earnings68,038 29,817 Total shareholders' equity79,327 42,978 Total liabilities and shareholders' equity$111,601 $65,728\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024; Cash and cash equivalents $ 8,589 $ 7,280; Marketable securities 34,621 18,704; Accounts receivable, net 23,065 9,999; Inventories 10,080 5,282; Prepaid expenses and other current assets 3,771 3,080; Total current assets 80,126 44,345; Property and equipment, net 6,283 3,914; Operating lease assets 1,793 1,346; Goodwill 5,188 4,430; Intangible assets, net 807 1,112; Deferred income tax assets 10,979 6,081; Other assets 6,425 4,500; Total assets $ 111,601 $ 65,728; Accounts payable $ 6,310 $ 2,699; Accrued and other current liabilities 11,737 6,682; Short-term debt — 1,250; Total current liabilities 18,047 10,631; Long-term debt 8,463 8,459; Long-term operating lease liabilities 1,519 1,119; Other long-term liabilities 4,245 2,541; Total liabilities 32,274 22,750; Commitments and contingencies - see Note 12 — —; Preferred stock, $0.001 par value; 20 shares authorized; none issued — —; Common stock, $0.001 par value; 80,000 shares authorized; 24,477 shares issued and outstanding as of January 26, 2025; 24,643 shares issued and outstanding as of January 28, 2024 24 25; Additional paid-in capital 11,237 13,109; Accumulated other comprehensive income 28 27; Retained earnings 68,038 29,817; Total shareholders' equity 79,327 42,978; Total liabilities and shareholders' equity $ 111,601 $ 65,728.\nTITLE: Jan 26, 2025Jan 28, 2024\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: Assets\nTITLE: Liabilities and Shareholders' Equity\nTEXT: Commitments and contingencies - see Note 12\nTEXT: Preferred stock, $0.001 par value; 20 shares authorized; none issued\nTEXT: Common stock, $0.001 par value; 80,000 shares authorized; 24,477 shares issued and outstanding as of January 26, 2025; 24,643 shares issued and outstanding as of January 28, 2024\nTEXT: See accompanying Notes to the Consolidated Financial Statements.\nTITLE: NVIDIA Corporation and Subsidiaries\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstock, common, paid, income, share, cash, dividends, declared, other, balances\n\nTITLE: Consolidated Statements of Shareholders' Equity\nTEXT: Common StockOutstandingAdditional Paid-inAccumulated Other ComprehensiveRetainedTotal Shareholders'SharesAmountCapital Income (Loss) Earnings Equity(In millions, except per share data)Balances as of Jan 30, 202225,064 $26 $10,362 $(11)$16,235 $26,612 Net income— — — — 4,368 4,368 Other comprehensive loss— — — (32)— (32)Issuance of common stock from stock plans312 — 355 — — 355 Tax withholding related to vesting of restricted stock units(82)— (1,475)— — (1,475)Shares repurchased(633)(1)(4)— (10,034)(10,039)Cash dividends declared and paid ($0.016 per common share)— — — — (398)(398)Stock-based compensation— — 2,710 — — 2,710 Balances as of Jan 29, 202324,661 25 11,948 (43)10,171 22,101 Net income— — — — 29,760 29,760 Other comprehensive income— — — 70 — 70 Issuance of common stock from stock plans265 — 403 — — 403 Tax withholding related to vesting of restricted stock units(72)— (2,783)— — (2,783)Shares repurchased(211)— (27)— (9,719)(9,746)Cash dividends declared and paid ($0.016 per common share)— — — — (395)(395)Stock-based compensation— — 3,568 — — 3,568 Balances as of Jan 28, 202424,643 25 13,109 27 29,817 42,978 Net income— — — — 72,880 72,880 Other comprehensive income— — — 1 — 1 Issuance of common stock from stock plans203 — 490 — — 490 Tax withholding related to vesting of restricted stock units(59)— (6,930)— — (6,930)Shares repurchased(310)(1)(189)— (33,825)(34,015)Cash dividends declared and paid ($0.034 per common share)— — — — (834)(834)Stock-based compensation— — 4,757 — — 4,757 Balances as of Jan 26, 202524,477 $24 $11,237 $28 $68,038 $79,327\nTABLE: TABLE: Common StockOutstanding Additional Paid-in Accumulated Other Comprehensive Retained Total Shareholders'; Shares Amount Capital Income (Loss) Earnings Equity; Balances as of Jan 30, 2022 25,064 $ 26 $ 10,362 $ (11) $ 16,235 $ 26,612; Net income — — — — 4,368 4,368; Other comprehensive loss — — — (32) — (32); Issuance of common stock from stock plans 312 — 355 — — 355; Tax withholding related to vesting of restricted stock units (82) — (1,475) — — (1,475); Shares repurchased (633) (1) (4) — (10,034) (10,039); Cash dividends declared and paid ($0.016 per common share) — — — — (398) (398); Stock-based compensation — — 2,710 — — 2,710; Balances as of Jan 29, 2023 24,661 25 11,948 (43) 10,171 22,101; Net income — — — — 29,760 29,760; Other comprehensive income — — — 70 — 70; Issuance of common stock from stock plans 265 — 403 — — 403; Tax withholding related to vesting of restricted stock units (72) — (2,783) — — (2,783); Shares repurchased (211) — (27) — (9,719) (9,746); Cash dividends declared and paid ($0.016 per common share) — — — — (395) (395); Stock-based compensation — — 3,568 — — 3,568; Balances as of Jan 28, 2024 24,643 25 13,109 27 29,817 42,978; Net income — — — — 72,880 72,880; Other comprehensive income — — — 1 — 1; Issuance of common stock from stock plans 203 — 490 — — 490; Tax withholding related to vesting of restricted stock units (59) — (6,930) — — (6,930); Shares repurchased (310) (1) (189) — (33,825) (34,015); Cash dividends declared and paid ($0.034 per common share) — — — — (834) (834); Stock-based compensation — — 4,757 — — 4,757; Balances as of Jan 26, 2025 24,477 $ 24 $ 11,237 $ 28 $ 68,038 $ 79,327.\nTITLE: Common StockOutstandingAdditional Paid-inAccumulated Other ComprehensiveRetainedTotal Shareholders'\nTITLE: Common StockOutstanding\nTITLE: Additional Paid-in\nTITLE: Accumulated Other Comprehensive\nTITLE: Retained\nTITLE: Total Shareholders'\nTITLE: SharesAmountCapital Income (Loss) Earnings Equity\nTITLE: Shares\nTITLE: Amount\nTITLE: Capital\nTITLE: Income (Loss)\nTITLE: Earnings\nTITLE: Equity\nTITLE: (In millions, except per share data)\nTEXT: Cash dividends declared and paid ($0.016 per common share)\nTEXT: Cash dividends declared and paid ($0.034 per common share)\nTEXT: See accompanying Notes to the Consolidated Financial Statements.\nTITLE: NVIDIA Corporation and Subsidiaries\nTITLE: Consolidated Statements of Cash Flows\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, activities, securities, marketable, other, stock, related, operating, income, equity\n\nTITLE: (In millions)\nTEXT: Year Ended Jan 26, 2025Jan 28, 2024Jan 29, 2023Cash flows from operating activities: Net income$72,880 $29,760 $4,368 Adjustments to reconcile net income to net cash provided by operating activities:Stock-based compensation expense4,737 3,549 2,709 Depreciation and amortization1,864 1,508 1,544 Deferred income taxes(4,477)(2,489)(2,164)(Gains) losses on non-marketable equity securities and publicly-held equity securities, net(1,030)(238)45 Acquisition termination cost— — 1,353 Other(502)(278)(7)Changes in operating assets and liabilities, net of acquisitions:Accounts receivable(13,063)(6,172)822 Inventories(4,781)(98)(2,554)Prepaid expenses and other assets(395)(1,522)(1,517)Accounts payable3,357 1,531 (551)Accrued and other current liabilities4,278 2,025 1,341 Other long-term liabilities1,221 514 252 Net cash provided by operating activities64,089 28,090 5,641 Cash flows from investing activities:Proceeds from maturities of marketable securities11,195 9,732 19,425 Proceeds from sales of marketable securities495 50 1,806 Proceeds from sales of non-marketable equity securities171 1 8 Purchases of marketable securities(26,575)(18,211)(11,897)Purchases related to property and equipment and intangible assets(3,236)(1,069)(1,833)Purchases of non-marketable equity securities(1,486)(862)(85)Acquisitions, net of cash acquired(1,007)(83)(49)Other22 (124)— Net cash provided by (used in) investing activities(20,421)(10,566)7,375 Cash flows from financing activities:Proceeds related to employee stock plans490 403 355 Payments related to repurchases of common stock(33,706)(9,533)(10,039)Payments related to tax on restricted stock units(6,930)(2,783)(1,475)Repayment of debt(1,250)(1,250)— Dividends paid(834)(395)(398)Principal payments on property and equipment and intangible assets(129)(74)(58)Other— (1)(2)Net cash used in financing activities(42,359)(13,633)(11,617)Change in cash and cash equivalents1,309 3,891 1,399 Cash and cash equivalents at beginning of period7,280 3,389 1,990 Cash and cash equivalents at end of period$8,589 $7,280 $3,389 Supplemental disclosures of cash flow information:Cash paid for income taxes, net$15,118 $6,549 $1,404 Cash paid for interest$246 $252 $254\nTABLE: TABLE: Jan 26, 2025 Jan 28, 2024 Jan 29, 2023; Net income $ 72,880 $ 29,760 $ 4,368; Stock-based compensation expense 4,737 3,549 2,709; Depreciation and amortization 1,864 1,508 1,544; Deferred income taxes (4,477) (2,489) (2,164); (Gains) losses on non-marketable equity securities and publicly-held equity securities, net (1,030) (238) 45; Acquisition termination cost — — 1,353; Other (502) (278) (7); Accounts receivable (13,063) (6,172) 822; Inventories (4,781) (98) (2,554); Prepaid expenses and other assets (395) (1,522) (1,517); Accounts payable 3,357 1,531 (551); Accrued and other current liabilities 4,278 2,025 1,341; Other long-term liabilities 1,221 514 252; Net cash provided by operating activities 64,089 28,090 5,641; Proceeds from maturities of marketable securities 11,195 9,732 19,425; Proceeds from sales of marketable securities 495 50 1,806; Proceeds from sales of non-marketable equity securities 171 1 8; Purchases of marketable securities (26,575) (18,211) (11,897); Purchases related to property and equipment and intangible assets (3,236) (1,069) (1,833); Purchases of non-marketable equity securities (1,486) (862) (85); Acquisitions, net of cash acquired (1,007) (83) (49); Other 22 (124) —; Net cash provided by (used in) investing activities (20,421) (10,566) 7,375; Proceeds related to employee stock plans 490 403 355; Payments related to repurchases of common stock (33,706) (9,533) (10,039); Payments related to tax on restricted stock units (6,930) (2,783) (1,475); Repayment of debt (1,250) (1,250) —; Dividends paid (834) (395) (398); Principal payments on property and equipment and intangible assets (129) (74) (58); Other — (1) (2); Net cash used in financing activities (42,359) (13,633) (11,617); Change in cash and cash equivalents 1,309 3,891 1,399; Cash and cash equivalents at beginning of period 7,280 3,389 1,990; Cash and cash equivalents at end of period $ 8,589 $ 7,280 $ 3,389; Cash paid for income taxes, net $ 15,118 $ 6,549 $ 1,404; Cash paid for interest $ 246 $ 252 $ 254.\nTITLE: Year Ended\nTITLE: Jan 26, 2025Jan 28, 2024Jan 29, 2023\nTITLE: Jan 26, 2025\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTEXT: Payments related to repurchases of common stock\nTITLE: Supplemental disclosures of cash flow information:\nTEXT: See accompanying Notes to the Consolidated Financial Statements.\nTITLE: Table of ContentsNVIDIA Corporation and SubsidiariesNotes to the Consolidated Financial Statements\nTITLE: Table of Contents\nTITLE: NVIDIA Corporation and Subsidiaries\n"
    }
  ]
}