{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ndemand, products, supply, product, capacity, data, transitions, inventory, center, these\n\nTEXT: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nTEXT: The following discussion and analysis of our financial condition and results of operations should be read in conjunction with “Item 1A. Risk Factors”, our Consolidated Financial Statements and related Notes thereto, as well as other cautionary statements and risks described elsewhere in this Annual Report on Form 10-K, before deciding to purchase, hold or sell shares of our common stock.\nTITLE: Overview\nTITLE: Our Company and Our Businesses\nTEXT: NVIDIA pioneered accelerated computing to help solve the most challenging computational problems. Since our original focus on PC graphics, we have expanded to several other large and important computationally intensive fields. NVIDIA has leveraged its GPU architecture to create platforms for accelerated computing, AI solutions, scientific computing, data science, AV, robotics, metaverse and 3D internet applications.\nTEXT: Our two operating segments are \"Compute & Networking\" and \"Graphics.\" Refer to Note 17 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for additional information.\nTEXT: Headquartered in Santa Clara, California, NVIDIA was incorporated in California in April 1993 and reincorporated in Delaware in April 1998.\nTITLE: Recent Developments, Future Objectives and Challenges\nTITLE: Demand and Supply, Product Transitions, and New Products and Business Models\nTEXT: Demand for our data center systems and products surged in fiscal year 2024. Entering fiscal year 2025, we are gathering customer demand indications across several product transitions. We have demand visibility for our new data center products ramping later in fiscal year 2025. We have increased our supply and capacity purchases with existing suppliers, added new vendors and entered into prepaid manufacturing and capacity agreements. These increased purchase volumes, the number of suppliers, and the integration of new vendors into our supply chain may create more complexity and execution risk. Our purchase commitments and obligations for inventory and manufacturing capacity at the end of fiscal year 2024 were impacted by shortening lead times for certain components. We may continue to enter into new supplier and capacity arrangements. Supply of Hopper architecture products is improving, and demand remains very strong. We expect our next-generation products to be supply-constrained based upon demand indications. We may incur inventory provisions or impairments if our inventory or supply or capacity commitments exceed demand for our products or demand declines.\nTEXT: We build finished products and maintain inventory in advance of anticipated demand. While we have entered into long-term supply and capacity commitments, we may not be able to secure sufficient commitments for capacity to address our business needs, or our long-term demand expectations may change. These risks may increase as we shorten our product development cycles, enter new lines of business, or integrate new suppliers or components into our supply chain, creating additional supply chain complexity.\nTEXT: Product transitions are complex as we often ship both new and prior architecture products simultaneously and we and our channel partners prepare to ship and support new products. Due to our product introduction cycles, we are almost always in various stages of transitioning the architecture of our Data Center, Professional Visualization, and Gaming products. We will have a broader and faster Data Center product launch cadence to meet a growing and diverse set of AI opportunities. The increased frequency of these transitions may magnify the challenges associated with managing our supply and demand due to manufacturing lead times. Qualification time for new products, customers anticipating product transitions and channel partners reducing channel inventory of prior architectures ahead of new product introductions can create reductions or volatility in our revenue. The increasing frequency and complexity of newly introduced products could result in quality or production issues that could increase inventory provisions, warranty or other costs or result in product delays. Deployment of new products to customers creates additional challenges due to the complexity of our technologies, which has impacted and may in the future impact the timing of customer purchases or otherwise impact our demand. While we have managed prior product transitions and have previously sold multiple product architectures at the same time, these transitions are difficult, may impair our ability to predict demand and impact our supply mix, and we may incur additional costs.\nTEXT: We build technology and introduce products for new and innovative use cases and applications such as our NVIDIA DGX Cloud services, Omniverse platform, LLMs, and generative AI models. Our demand estimates for new use cases, applications, and services can be incorrect and create volatility in our revenue or supply levels, and we may not be able to generate significant revenue from these use cases, applications, and services. Recent technologies, such as generative AI models, have emerged, and while they have driven increased demand for Data Center, the long-term trajectory is unknown.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nproducts, licensing, china, requirements, impact, fiscal, export, other, product, further\n\nTITLE: Global Trade\nTEXT: During the third quarter of fiscal year 2023, the USG, announced licensing requirements that, with certain exceptions, impact exports to China (including Hong Kong and Macau) and Russia of our A100 and H100 integrated circuits, DGX or any other systems or boards which incorporate A100 or H100 integrated circuits.\nTEXT: In July 2023, the USG informed us of an additional licensing requirement for a subset of A100 and H100 products destined to certain customers and other regions, including some countries in the Middle East.\nTEXT: In October 2023, the USG announced new and updated licensing requirements that became effective in our fourth quarter of fiscal year 2024 for exports to China and Country Groups D1, D4, and D5 (including but not limited to Saudi Arabia, the United Arab Emirates, and Vietnam, but excluding Israel) of our products exceeding certain performance thresholds, including A100, A800, H100, H800, L4, L40, L40S and RTX 4090. The licensing requirements also apply to the export of products exceeding certain performance thresholds to a party headquartered in, or with an ultimate parent headquartered in, Country Group D5, including China. On October 23, 2023, the USG informed us the licensing requirements were effective immediately for shipments of our A100, A800, H100, H800, and L40S products. Our sales to China decreased as a percentage of total Data Center revenue from 19% in fiscal year 2023 to 14% in fiscal year 2024.\nTEXT: We have not received licenses to ship these restricted products to China. We are working to expand our Data Center product portfolio to offer new solutions, including those for which the USG does not require a license or advance notice before each shipment. We have started to ship alternatives to the China market in small volumes. China represented a mid-single digit percentage of our Data Center revenue in the fourth quarter of fiscal year 2024 due to USG licensing requirements and we expect China to be in a similar range in the first quarter of fiscal year 2025. To the extent that a customer requires products covered by the licensing requirements, we may seek a license for the customer but have no assurance that the USG will grant such a license, or that the USG will act on the license application in a timely manner or at all.\nTEXT: Our competitive position has been harmed, and our competitive position and future results may be further harmed in the long term, if there are further changes in the USG’s export controls. Given the increasing strategic importance of AI and rising geopolitical tensions, the USG has changed and may again change the export control rules at any time and further subject a wider range of our products to export restrictions and licensing requirements, negatively impacting our business and financial results. In the event of such change, we may be unable to sell our inventory of such products and may be unable to develop replacement products not subject to the licensing requirements, effectively excluding us from all or part of the China market, as well as other impacted markets, including the Middle East.\nTEXT: While we work to enhance the resiliency and redundancy of our supply chain, which is currently concentrated in the Asia-Pacific region, new and existing export controls or changes to existing export controls could limit alternative manufacturing locations and negatively impact our business. Refer to “Item 1A. Risk Factors – Risks Related to Regulatory, Legal, Our Stock and Other Matters” for a discussion of this potential impact.\nTITLE: Macroeconomic Factors\nTEXT: Macroeconomic factors, including inflation, increased interest rates, capital market volatility, global supply chain constraints and global economic and geopolitical developments, may have direct and indirect impacts on our results of operations, particularly demand for our products. While difficult to isolate and quantify, these macroeconomic factors can also impact our supply chain and manufacturing costs, employee wages, costs for capital equipment and value of our investments. Our product and solution pricing generally does not fluctuate with short-term changes in our costs. Within our supply chain, we continuously manage product availability and costs with our vendors.\nTITLE: Israel and Hamas Conflict\nTEXT: We are monitoring the impact of the geopolitical conflict in and around Israel on our operations, including the health and safety of our approximately 3,700 employees in the region who primarily support the research and development, operations, and sales and marketing of our networking products. Our operating expenses in fiscal year 2024 include expenses for financial support to impacted employees and charitable activity. We believe our global supply chain for our networking products has not experienced any significant impact. Further, in connection with the conflict, a substantial number of our employees in the region have been called-up for active military duty in Israel. Accordingly, some of our employees in Israel have been absent for an extended period and they or others may continue to be absent, which may cause disruption to our product development or operations. We did not experience any significant impact or expense to our business; however, if the conflict is further extended, it could impact future product development, operations, and revenue or create other uncertainty for our business.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, revenue, nvidia, data, center, automotive, announced, platforms, gaming, financial\n\nTITLE: Fiscal Year 2024 Summary\nTEXT: Year Ended Jan 28, 2024Jan 29, 2023Change($ in millions, except per share data)Revenue$60,922 $26,974 Up 126%Gross margin72.7 %56.9 %Up 15.8 ptsOperating expenses$11,329 $11,132 Up 2%Operating income$32,972 $4,224 Up 681%Net income$29,760 $4,368 Up 581%Net income per diluted share$11.93 $1.74 Up 586%\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023 Change; Revenue $ 60,922 $ 26,974 Up 126%; Gross margin 72.7 % 56.9 % Up 15.8 pts; Operating expenses $ 11,329 $ 11,132 Up 2%; Operating income $ 32,972 $ 4,224 Up 681%; Net income $ 29,760 $ 4,368 Up 581%; Net income per diluted share $ 11.93 $ 1.74 Up 586%.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023Change\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: Change\nTEXT: We specialize in markets where our computing platforms can provide tremendous acceleration for applications. These platforms incorporate processors, interconnects, software, algorithms, systems, and services to deliver unique value. Our platforms address four large markets where our expertise is critical: Data Center, Gaming, Professional Visualization, and Automotive.\nTEXT: Revenue for fiscal year 2024 was $60.9 billion, up 126% from a year ago.\nTEXT: Data Center revenue for fiscal year 2024 was up 217%. Strong demand was driven by enterprise software and consumer internet applications, and multiple industry verticals including automotive, financial services, and healthcare. Customers across industry verticals access NVIDIA AI infrastructure both through the cloud and on-premises. Data Center compute revenue was up 244% in the fiscal year. Networking revenue was up 133% in the fiscal year.\nTEXT: Gaming revenue for fiscal year 2024 was up 15%. The increase reflects higher sell-in to partners following the normalization of channel inventory levels and growing demand.\nTEXT: Professional Visualization revenue for fiscal year 2024 was up 1%.\nTEXT: Automotive revenue for the fiscal year 2024 was up 21%. The increase primarily reflected growth in self-driving platforms.\nTEXT: Gross margin increased in fiscal year 2024, primarily driven by Data Center revenue growth and lower net inventory provisions as a percentage of revenue.\nTEXT: Operating expenses increased for fiscal year 2024, driven by growth in employees and compensation increases. Fiscal year 2023 also included a $1.4 billion acquisition termination charge related to the proposed Arm transaction.\nTITLE: Market Platform Highlights\nTEXT: Data Center revenue for fiscal year 2024 was $47.5 billion, up 217% from fiscal year 2023. In Data Center, we launched AI inference platforms that combine our full-stack inference software with NVIDIA Ada, NVIDIA Hopper and NVIDIA Grace Hopper processors optimized for generative AI, LLMs and other AI workloads. We introduced NVIDIA DGX Cloud and AI Foundations to help businesses create and operate custom large language models and generative AI models. As AV algorithms move to video transformers, and more cars are equipped with cameras, we expect NVIDIA’s automotive data center processing demand to grow significantly. We estimate that in fiscal year 2024, approximately 40% of Data Center revenue was for AI inference. In the fourth quarter of fiscal year 2024, large cloud providers represented more than half of our Data Center revenue, supporting both internal workloads and external customers. We announced NVIDIA Spectrum-X, an accelerated networking platform for AI.\nTEXT: Gaming revenue for fiscal year 2024 was $10.4 billion, up 15% from fiscal year 2023. In Gaming, we launched the GeForce RTX 4060 and 4070 GPUs based on the NVIDIA Ada Lovelace architecture. We announced NVIDIA Avatar Cloud Engine for Games, a custom AI model foundry service using AI-powered natural language interactions to transform games and launched DLSS 3.5 Ray Reconstruction. Additionally, we released TensorRT-LLM for Windows and launched GeForce RTX 40-Series SUPER GPUs. Gaming reached a milestone of 500 AI-powered RTX games and applications utilizing NVIDIA DLSS, ray tracing and other NVIDIA RTX technologies.\nTEXT: Professional Visualization revenue for fiscal year 2024 was $1.6 billion, up 1% from fiscal year 2023. In Professional Visualization, we announced new GPUs based on the NVIDIA RTX Ada Lovelace architecture, and announced NVIDIA Omniverse Cloud, a fully managed service running in Microsoft Azure, for the development and deployment of industrial metaverse applications.\nTEXT: Automotive revenue for fiscal year 2024 was $1.1 billion, up 21% from fiscal year 2023. In Automotive, we announced a partnership with MediaTek, which will develop mainstream automotive systems on chips for global OEMs integrating a new NVIDIA GPU chiplet IP for AI and graphics. We furthered our collaboration with Foxconn to develop next-generation\nTEXT: electric vehicles, and announced further adoption of NVIDIA DRIVE platform with BYD, XPENG, GWM, Li Auto, ZEEKR and Xiaomi.\nTITLE: Critical Accounting Estimates\nTEXT: Our consolidated financial statements are prepared in accordance with accounting principles generally accepted in the United States, or U.S. GAAP. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue, cost of revenue, expenses and related disclosure of contingencies. Critical accounting estimates are those estimates that involve a significant level of estimation uncertainty and could have a material impact on our financial condition or results of operations. We have critical accounting estimates in the areas of inventories, revenue recognition, and income taxes. Refer to Note 1 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for a summary of significant accounting policies.\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ninventory, based, product, products, demand, customer, income, excess, future, return\n\nTITLE: Inventories\nTEXT: We charge cost of sales for inventory provisions to write-down our inventory to the lower of cost or net realizable value or for obsolete or excess inventory, and for excess product purchase commitments. Most of our inventory provisions relate to excess quantities of products or components, based on our inventory levels and future product purchase commitments compared to assumptions about future demand and market conditions, which requires management judgment.\nTEXT: Situations that may result in excess or obsolete inventory or excess product purchase commitments include changes in business and economic conditions, changes in market conditions, sudden and significant decreases in demand for our products, inventory obsolescence because of changing technology and customer requirements, new product introductions resulting in less demand for existing products or inconsistent spikes in demand, failure to estimate customer demand properly, ordering in advance of historical lead-times, government regulations and the impact of changes in future demand, or increase in demand for competitive products, including competitive actions. Cancellation or deferral of customer purchase orders could result in our holding excess inventory.\nTEXT: The net effect on our gross margin from inventory provisions and sales of items previously written down was an unfavorable impact of 2.7% in fiscal year 2024 and 7.5% in fiscal year 2023. Our inventory and capacity purchase commitments are based on forecasts of future customer demand. We account for our third-party manufacturers' lead times and constraints. Our manufacturing lead times can be and have been long, and in some cases, extended beyond twelve months for some products. We may place non-cancellable inventory orders for certain product components in advance of our historical lead times, pay premiums and provide deposits to secure future supply and capacity. We also adjust to other market factors, such as product offerings and pricing actions by our competitors, new product transitions, and macroeconomic conditions - all of which may impact demand for our products.\nTEXT: Refer to the Gross Profit and Gross Margin discussion below in this Management's Discussion and Analysis for further discussion.\nTITLE: Income Taxes\nTEXT: We are subject to income taxes in the U.S. and foreign jurisdictions. Our calculation of deferred tax assets and liabilities is based on certain estimates and judgments and involves dealing with uncertainties in the application of complex tax laws. Our estimates of deferred tax assets and liabilities may change based, in part, on added certainty or finality to an anticipated outcome, changes in accounting standards or tax laws in the U.S. or foreign jurisdictions where we operate, or changes in other facts or circumstances. In addition, we recognize liabilities for potential U.S. and foreign income tax contingencies based on our estimate of whether, and the extent to which, additional taxes may be due. If we determine that payment of these amounts is unnecessary or if the recorded tax liability is less than our current assessment, we may be required to recognize an income tax benefit or additional income tax expense in our financial statements accordingly.\nTEXT: As of the end of fiscal years 2024 and 2023, we had a valuation allowance of $1.6 billion and $1.5 billion, respectively, related to capital loss carryforwards, and certain state and other deferred tax assets that management determined are not likely to be realized due, in part, to jurisdictional projections of future taxable income, including capital gains. To the extent realization of the deferred tax assets becomes more-likely-than-not, we would recognize such deferred tax assets as income tax benefits during the period.\nTEXT: We recognize the benefit from a tax position only if it is more-likely-than-not that the position would be sustained upon audit based solely on the technical merits of the tax position. Our policy is to include interest and penalties related to unrecognized tax benefits as a component of income tax expense.\nTITLE: Revenue Recognition\nTITLE: Revenue Allowances\nTEXT: For products sold with a right of return, we record a reduction to revenue by establishing a sales return allowance for estimated product returns at the time revenue is recognized, based primarily on historical return rates. However, if product returns for a fiscal period are anticipated to exceed historical return rates, we may determine that additional sales return allowances are required to reflect our estimated exposure for product returns. Return rights for certain stocking distributors for specific products are contractually limited based on a percentage of prior quarter shipments. For shipments to other customers, we do not allow returns, although we may approve returns for credit or refund based on applicable facts and circumstances.\nTEXT: We account for customer programs, which involve rebates and marketing development funds, as a reduction in revenue and accrue for such programs based on the amount we expect to be claimed by customers. Certain customer programs include distributor price incentives or other channel programs for specific products and customer classes which require judgement as to whether the applicable incentives will be attained. Estimates for customer program accruals include a combination of historical attainment and claim rates and may be adjusted based on relevant internal and external factors.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nincome, fiscal, revenue, cost, total, each, other, performance, standalone, price\n\nTITLE: License and Development Arrangements\nTEXT: Revenue from License and Development Arrangements is recognized over the period in which the development services are performed. Each fiscal reporting period, we measure progress to completion based on actual cost incurred to date as a percentage of the estimated total cost required to complete each project. Estimated total cost for each project includes a forecast of internal engineer personnel time expected to be incurred and other third-party costs as applicable.\nTITLE: Contracts with Multiple Performance Obligations\nTEXT: Our contracts may contain more than one performance obligation. Judgement is required in determining whether each performance obligation within a customer contract is distinct. Except for License and Development Arrangements, NVIDIA products and services function on a standalone basis and do not require a significant amount of integration or interdependency. Therefore, multiple performance obligations contained within a customer contract are considered distinct and are not combined for revenue recognition purposes.\nTEXT: We allocate the total transaction price to each distinct performance obligation in a multiple performance obligations arrangement on a relative standalone selling price basis. In certain cases, we can establish standalone selling price based on directly observable prices of products or services sold separately in comparable circumstances to similar customers. If standalone selling price is not directly observable, such as when we do not sell a product or service separately, we determine standalone selling price based on market data and other observable inputs.\nTITLE: Change in Accounting Estimate\nTEXT: In February 2023, we assessed the useful lives of our property, plant, and equipment. Based on advances in technology and usage rate, we increased the estimated useful life of a majority of the server, storage, and network equipment from three years to a range of four to five years, and assembly and test equipment from five years to seven years. The estimated effect of this change for fiscal year 2024 was a benefit of $33 million and $102 million for cost of revenue and operating expenses, respectively, which resulted in an increase in operating income of $135 million and net income of $114 million after tax, or $0.05 per both basic and diluted share.\nTITLE: Results of Operations\nTEXT: A discussion regarding our financial condition and results of operations for fiscal year 2024 compared to fiscal year 2023 is presented below. A discussion regarding our financial condition and results of operations for fiscal year 2023 compared to fiscal year 2022 can be found under Item 7 in our Annual Report on Form 10-K for the fiscal year ended January 29, 2023, filed with the SEC on February 24, 2023, which is available free of charge on the SEC’s website at http://www.sec.gov and at our investor relations website, http://investor.nvidia.com.\nTEXT: The following table sets forth, for the periods indicated, certain items in our Consolidated Statements of Income expressed as a percentage of revenue.\nTEXT: Year Ended Jan 28, 2024Jan 29, 2023Revenue100.0 %100.0 %Cost of revenue27.3 43.1 Gross profit72.7 56.9 Operating expenses Research and development14.2 27.2 Sales, general and administrative4.4 9.1 Acquisition termination cost— 5.0 Total operating expenses18.6 41.3 Operating income54.1 15.6 Interest income1.4 1.0 Interest expense(0.4)(1.0)Other, net0.4 (0.1)Other income (expense), net1.4 (0.1)Income before income tax55.5 15.5 Income tax expense (benefit)6.6 (0.7)Net income48.9 %16.2 %\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023; Revenue 100.0 % 100.0 %; Cost of revenue 27.3 43.1; Gross profit 72.7 56.9; Research and development 14.2 27.2; Sales, general and administrative 4.4 9.1; Acquisition termination cost — 5.0; Total operating expenses 18.6 41.3; Operating income 54.1 15.6; Interest income 1.4 1.0; Interest expense (0.4) (1.0); Other, net 0.4 (0.1); Other income (expense), net 1.4 (0.1); Income before income tax 55.5 15.5; Income tax expense (benefit) 6.6 (0.7); Net income 48.9 % 16.2 %.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: Reportable Segments\nTITLE: Revenue by Reportable Segments\nTEXT: Year EndedJan 28, 2024Jan 29, 2023$Change%Change($ in millions)Compute & Networking$47,405 $15,068 $32,337 215 %Graphics13,517 11,906 1,611 14 %Total$60,922 $26,974 $33,948 126 %\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023 $Change %Change; Compute & Networking $ 47,405 $ 15,068 $ 32,337 215 %; Graphics 13,517 11,906 1,611 14 %; Total $ 60,922 $ 26,974 $ 33,948 126 %.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023$Change%Change\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: $Change\nTITLE: %Change\nTITLE: Operating Income by Reportable Segments\nTEXT: Year EndedJan 28, 2024Jan 29, 2023$Change%Change($ in millions)Compute & Networking$32,016 $5,083 $26,933 530 %Graphics5,846 4,552 1,294 28 %All Other(4,890)(5,411)521 (10)%Total$32,972 $4,224 $28,748 681 %\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023 $Change %Change; Compute & Networking $ 32,016 $ 5,083 $ 26,933 530 %; Graphics 5,846 4,552 1,294 28 %; All Other (4,890) (5,411) 521 (10) %; Total $ 32,972 $ 4,224 $ 28,748 681 %.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023$Change%Change\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: $Change\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nrevenue, fiscal, inventory, cost, costs, compute, networking, total, higher, compensation\n\nTITLE: %Change\nTEXT: Compute & Networking revenue – The year-on-year increase was due to higher Data Center revenue. Compute grew 266% due to higher shipments of the NVIDIA Hopper GPU computing platform for the training and inference of LLMs, recommendation engines and generative AI applications. Networking was up 133% due to higher shipments of InfiniBand.\nTEXT: Graphics revenue – The year-on-year increase was led by growth in Gaming of 15% driven by higher sell-in to partners following the normalization of channel inventory levels.\nTEXT: Reportable segment operating income – The year-on-year increase in Compute & Networking and Graphics operating income was driven by higher revenue.\nTEXT: All Other operating loss - The year-on-year decrease was due to the $1.4 billion Arm acquisition termination cost in fiscal year 2023, partially offset by a $839 million increase in stock-based compensation expense in fiscal year 2024.\nTITLE: Concentration of Revenue\nTEXT: Revenue by geographic region is designated based on the billing location even if the revenue may be attributable to end customers, such as enterprises and gamers in a different location. Revenue from sales to customers outside of the United States accounted for 56% and 69% of total revenue for fiscal years 2024 and 2023, respectively.\nTEXT: Our direct and indirect customers include public cloud, consumer internet companies, enterprises, startups, public sector entities, OEMs, ODMs, system integrators, AIB, and distributors.\nTEXT: Sales to one customer, Customer A, represented 13% of total revenue for fiscal year 2024, which was attributable to the Compute & Networking segment.\nTEXT: One indirect customer which primarily purchases our products through system integrators and distributors, including through Customer A, is estimated to have represented approximately 19% of total revenue for fiscal year 2024, attributable to the Compute & Networking segment.\nTEXT: Our estimated Compute & Networking demand is expected to remain concentrated.\nTEXT: There were no customers with 10% or more of total revenue for fiscal years 2023 and 2022.\nTITLE: Gross Profit and Gross Margin\nTEXT: Gross profit consists of total revenue, net of allowances, less cost of revenue. Cost of revenue consists primarily of the cost of semiconductors, including wafer fabrication, assembly, testing and packaging, board and device costs, manufacturing support costs, including labor and overhead associated with such purchases, final test yield fallout, inventory and warranty provisions, memory and component costs, tariffs, and shipping costs. Cost of revenue also includes acquisition-related costs, development costs for license and service arrangements, IP-related costs, and stock-based compensation related to personnel associated with manufacturing operations.\nTEXT: Our overall gross margin increased to 72.7% in fiscal year 2024 from 56.9% in fiscal year 2023. The year over year increase was primarily due to strong Data Center revenue growth of 217% and lower net inventory provisions as a percentage of revenue.\nTEXT: Provisions for inventory and excess inventory purchase obligations totaled $2.2 billion for both fiscal years 2024 and 2023. Sales of previously reserved inventory or settlements of excess inventory purchase obligations resulted in a provision release of $540 million and $137 million for fiscal years 2024 and 2023, respectively. The net effect on our gross margin was an unfavorable impact of 2.7% and 7.5% in fiscal years 2024 and 2023, respectively.\nTITLE: Operating Expenses\nTEXT: Year Ended Jan 28, 2024Jan 29, 2023$Change%Change ($ in millions)Research and development expenses$8,675 $7,339 $1,336 18 %% of net revenue14.2 %27.2 % Sales, general and administrative expenses2,654 2,440 214 9 %% of net revenue4.4 %9.1 % Acquisition termination cost— 1,353 (1,353)(100)%% of net revenue— %5.0 %Total operating expenses$11,329 $11,132 $197 2 %% of net revenue18.6 %41.3 %\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023 $Change %Change; Research and development expenses $ 8,675 $ 7,339 $ 1,336 18 %; % of net revenue 14.2 % 27.2 %; Sales, general and administrative expenses 2,654 2,440 214 9 %; % of net revenue 4.4 % 9.1 %; Acquisition termination cost — 1,353 (1,353) (100) %; % of net revenue — % 5.0 %; Total operating expenses $ 11,329 $ 11,132 $ 197 2 %; % of net revenue 18.6 % 41.3 %.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023$Change%Change\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: $Change\nTITLE: %Change\nTEXT: The increase in research and development expenses and sales, general and administrative expenses for fiscal year 2024 was primarily driven by compensation and benefits, including stock-based compensation, reflecting employee growth and compensation increases.\nTITLE: Acquisition Termination Cost\nTEXT: We recorded an acquisition termination cost related to the Arm transaction of $1.4 billion in fiscal year 2023 reflecting the write-off of the prepayment provided at signing.\nTITLE: Other Income (Expense), Net\nTEXT: Year Ended Jan 28, 2024Jan 29, 2023$Change ($ in millions)Interest income$866 $267 $599 Interest expense(257)(262)5 Other, net237 (48)285 Other income (expense), net$846 $(43)$889\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023 $Change; Interest income $ 866 $ 267 $ 599; Interest expense (257) (262) 5; Other, net 237 (48) 285; Other income (expense), net $ 846 $ (43) $ 889.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023$Change\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfiscal, cash, income, interest, securities, benefit, effective, activities, marketable, federal\n\nTITLE: $Change\nTEXT: Interest income consists of interest earned on cash, cash equivalents and marketable securities. The increase in interest income was due to higher yields on higher cash balances.\nTEXT: Interest expense is comprised of coupon interest and debt discount amortization related to our notes.\nTEXT: Other, net, consists of realized or unrealized gains and losses from investments in non-affiliated entities and the impact of changes in foreign currency rates. Change in Other, net, compared to fiscal year 2023 was driven by changes in value from our non-affiliated investments. Refer to Note 9 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for additional information regarding our investments in non-affiliated entities.\nTITLE: Income Taxes\nTEXT: We recognized income tax expense of $4.1 billion for fiscal year 2024 and income tax benefit of $187 million for fiscal year 2023. Income tax as a percentage of income before income tax was an expense of 12.0% for fiscal year 2024 and a benefit of 4.5% for fiscal year 2023.\nTEXT: During the third quarter of fiscal year 2024, the Internal Revenue Service, or IRS, audit of our federal income tax returns for fiscal years 2018 and 2019 was resolved. We recognized a non-cash net benefit of $145 million, related to this IRS audit resolution, for effectively settled positions. This benefit consists of a reduction in unrecognized tax benefits of $236 million and related accrued interest of $17 million, net of federal benefit, partially offset by additional cash tax payments and reductions in tax attribute carryforwards of $108 million.\nTEXT: The effective tax rate increased due to a decreased impact of tax benefits from the FDII deduction, stock-based compensation, and the U.S. federal research tax credit, relative to the increase in income before income tax. The increase in the effective tax rate was partially offset by a benefit due to the IRS audit resolution.\nTEXT: Our effective tax rates for fiscal years 2024 and 2023 were lower than the U.S. federal statutory rate of 21% due primarily to tax benefits from the FDII deduction, stock-based compensation and the U.S. federal research tax credit. Our effective tax rate for fiscal year 2024 was additionally benefited by the IRS audit resolution.\nTEXT: The OECD has announced an Inclusive Framework on Base Erosion and Profit Shifting including Pillar Two Model Rules for a new 15% global minimum tax applicable to large multinational corporations. Certain jurisdictions, including European Union member states and the United Kingdom, have enacted Pillar Two legislation that will start to become effective for our fiscal year 2025. The OECD, and its member countries, continue to release new guidance and legislation on Pillar Two and we continue to evaluate the impact on our financial position of the global implementation of these rules. Based on enacted laws, Pillar Two is not expected to materially impact our effective tax rate or cash flows in the next fiscal year. New legislation or guidance could change our current assessment.\nTEXT: Refer to Note 14 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for additional information.\nTITLE: Liquidity and Capital Resources\nTEXT: Jan 28, 2024Jan 29, 2023 (In millions)Cash and cash equivalents$7,280 $3,389 Marketable securities18,704 9,907 Cash, cash equivalents, and marketable securities$25,984 $13,296\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023; Cash and cash equivalents $ 7,280 $ 3,389; Marketable securities 18,704 9,907; Cash, cash equivalents, and marketable securities $ 25,984 $ 13,296.\nTITLE: Jan 28, 2024Jan 29, 2023\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTEXT: Year EndedJan 28, 2024Jan 29, 2023 (In millions)Net cash provided by operating activities$28,090 $5,641 Net cash provided by (used in) investing activities$(10,566)$7,375 Net cash used in financing activities$(13,633)$(11,617)\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023; Net cash provided by operating activities $ 28,090 $ 5,641; Net cash provided by (used in) investing activities $ (10,566) $ 7,375; Net cash used in financing activities $ (13,633) $ (11,617).\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTEXT: Our investment policy requires the purchase of highly rated fixed income securities, the diversification of investment types and credit exposures, and certain maturity limits on our portfolio.\nTEXT: Cash provided by operating activities increased in fiscal year 2024 compared to fiscal year 2023, due to growth in revenue. Accounts receivable balance in fiscal year 2024 reflected $557 million from customer payments received ahead of the invoice due date.\nTEXT: Cash provided by investing activities decreased in fiscal year 2024 compared to fiscal year 2023, primarily driven by lower marketable securities maturities and higher purchases of marketable securities.\nTEXT: Cash used in financing activities increased in fiscal year 2024 compared to fiscal year 2023, due to a debt repayment and higher tax payments related to RSUs, partially offset by lower share repurchases.\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, fiscal, securities, marketable, financial, note, share, program, equivalents, debt\n\nTITLE: Liquidity\nTEXT: Our primary sources of liquidity are our cash, cash equivalents, and marketable securities, and the cash generated by our operations. At the end of fiscal year 2024, we had $26.0 billion in cash, cash equivalents and marketable securities. We believe that we have sufficient liquidity to meet our operating requirements for at least the next twelve months, and for the foreseeable future, including our future supply obligations and $1.3 billion of debt repayment due in fiscal year 2025 and share purchases. We continuously evaluate our liquidity and capital resources, including our access to external capital, to ensure we can finance future capital requirements.\nTEXT: Our marketable securities consist of debt securities issued by the U.S. government and its agencies, highly rated corporations and financial institutions, and foreign government entities, as well as certificates of deposit issued by highly rated financial institutions. These marketable securities are primarily denominated in U.S. dollars. Refer to Note 8 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for additional information.\nTEXT: During fiscal year 2025, we expect to use our existing cash, cash equivalents, and marketable securities, and the cash generated by our operations to fund our capital investments of approximately $3.5 billion to $4.0 billion related to property and equipment.\nTEXT: Except for approximately $1.4 billion of cash, cash equivalents, and marketable securities held outside the U.S. for which we have not accrued any related foreign or state taxes if we repatriate these amounts to the U.S., substantially all of our cash, cash equivalents and marketable securities held outside of the U.S. at the end of fiscal year 2024 are available for use in the U.S. without incurring additional U.S. federal income taxes.\nTITLE: Capital Return to Shareholders\nTEXT: During fiscal year 2024, we paid $395 million in quarterly cash dividends.\nTEXT: Our cash dividend program and the payment of future cash dividends under that program are subject to our Board of Directors' continuing determination that the dividend program and the declaration of dividends thereunder are in the best interests of our shareholders.\nTEXT: In August 2023, our Board of Directors approved an increase to our share repurchase program of an additional $25.0 billion, without expiration. During fiscal year 2024, we repurchased 21 million shares of our common stock for $9.7 billion. As of January 28, 2024, we were authorized, subject to certain specifications, to repurchase additional shares of our\nTEXT: common stock up to $22.5 billion. From January 29, 2024 through February 16, 2024, we repurchased 2.8 million shares for $1.9 billion pursuant to a Rule 10b5-1 trading plan. Our share repurchase program aims to offset dilution from shares issued to employees. We may pursue additional share repurchases as we weigh market factors and other investment opportunities. We plan to continue share repurchases this fiscal year.\nTEXT: The U.S. Inflation Reduction Act of 2022 requires a 1% excise tax on certain share repurchases in excess of shares issued for employee compensation made after December 31, 2022 which was not material for fiscal year 2024.\nTITLE: Outstanding Indebtedness and Commercial Paper Program\nTEXT: Our aggregate debt maturities as of January 28, 2024, by year payable, are as follows:\nTEXT: Jan 28, 2024 (In millions)Due in one year$1,250 Due in one to five years2,250 Due in five to ten years2,750 Due in greater than ten years3,500 Unamortized debt discount and issuance costs(41)Net carrying amount9,709 Less short-term portion(1,250)Total long-term portion$8,459\nTABLE: TABLE: Due in one year $ 1,250; Due in one to five years 2,250; Due in five to ten years 2,750; Due in greater than ten years 3,500; Unamortized debt discount and issuance costs (41); Net carrying amount 9,709; Less short-term portion (1,250); Total long-term portion $ 8,459.\nTITLE: Jan 28, 2024\nTEXT: We have a $575 million commercial paper program to support general corporate purposes. As of the end of fiscal year 2024, we had no commercial paper outstanding.\nTEXT: Refer to Note 12 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for further discussion.\nTITLE: Material Cash Requirements and Other Obligations\nTEXT: For a description of our long-term debt, purchase obligations, and operating lease obligations, refer to Note 12, Note 13, and Note 3 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K, respectively.\nTEXT: We have unrecognized tax benefits of $1.3 billion, which includes related interest and penalties of $140 million, recorded in non-current income tax payable at the end of fiscal year 2024. We are unable to estimate the timing of any potential tax liability, interest payments, or penalties in individual years due to uncertainties in the underlying income tax positions and the timing of the effective settlement of such tax positions. Refer to Note 14 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for further information.\nTITLE: Climate Change\nTEXT: To date, there has been no material impact to our results of operations associated with global sustainability regulations, compliance, costs from sourcing renewable energy or climate-related business trends.\nTITLE: Adoption of New and Recently Issued Accounting Pronouncements\nTEXT: Refer to Note 1 of the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Annual Report on Form 10-K for a discussion of adoption of new and recently issued accounting pronouncements.\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, loss, gain, other, change, unrealized, share, operating, expense, comprehensive\n\nTITLE: NVIDIA Corporation and Subsidiaries\nTITLE: Consolidated Statements of Income\nTEXT: (In millions, except per share data)Year EndedJan 28, 2024Jan 29, 2023Jan 30, 2022Revenue$60,922 $26,974 $26,914 Cost of revenue16,621 11,618 9,439 Gross profit44,301 15,356 17,475 Operating expenses Research and development8,675 7,339 5,268 Sales, general and administrative2,654 2,440 2,166 Acquisition termination cost— 1,353 — Total operating expenses11,329 11,132 7,434 Operating income32,972 4,224 10,041 Interest income866 267 29 Interest expense(257)(262)(236)Other, net237 (48)107 Other income (expense), net846 (43)(100)Income before income tax33,818 4,181 9,941 Income tax expense (benefit)4,058 (187)189 Net income$29,760 $4,368 $9,752 Net income per share:Basic$12.05 $1.76 $3.91 Diluted$11.93 $1.74 $3.85 Weighted average shares used in per share computation:Basic2,469 2,487 2,496 Diluted2,494 2,507 2,535\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023 Jan 30, 2022; Revenue $ 60,922 $ 26,974 $ 26,914; Cost of revenue 16,621 11,618 9,439; Gross profit 44,301 15,356 17,475; Research and development 8,675 7,339 5,268; Sales, general and administrative 2,654 2,440 2,166; Acquisition termination cost — 1,353 —; Total operating expenses 11,329 11,132 7,434; Operating income 32,972 4,224 10,041; Interest income 866 267 29; Interest expense (257) (262) (236); Other, net 237 (48) 107; Other income (expense), net 846 (43) (100); Income before income tax 33,818 4,181 9,941; Income tax expense (benefit) 4,058 (187) 189; Net income $ 29,760 $ 4,368 $ 9,752; Basic $ 12.05 $ 1.76 $ 3.91; Diluted $ 11.93 $ 1.74 $ 3.85; Basic 2,469 2,487 2,496; Diluted 2,494 2,507 2,535.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023Jan 30, 2022\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: Jan 30, 2022\nTEXT: See accompanying notes to the consolidated financial statements.\nTITLE: NVIDIA Corporation and Subsidiaries\nTITLE: Consolidated Statements of Comprehensive Income\nTEXT: (In millions)Year EndedJan 28, 2024Jan 29, 2023Jan 30, 2022Net income$29,760 $4,368 $9,752 Other comprehensive income (loss), net of taxAvailable-for-sale securities:Net change in unrealized gain (loss)80 (31)(16)Reclassification adjustments for net realized gain included in net income— 1 — Net change in unrealized gain (loss)80 (30)(16)Cash flow hedges:Net change in unrealized gain (loss)38 47 (43)Reclassification adjustments for net realized gain (loss) included in net income(48)(49)29 Net change in unrealized loss(10)(2)(14)Other comprehensive income (loss), net of tax70 (32)(30)Total comprehensive income$29,830 $4,336 $9,722\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023 Jan 30, 2022; Net income $ 29,760 $ 4,368 $ 9,752; Net change in unrealized gain (loss) 80 (31) (16); Reclassification adjustments for net realized gain included in net income — 1 —; Net change in unrealized gain (loss) 80 (30) (16); Net change in unrealized gain (loss) 38 47 (43); Reclassification adjustments for net realized gain (loss) included in net income (48) (49) 29; Net change in unrealized loss (10) (2) (14); Other comprehensive income (loss), net of tax 70 (32) (30); Total comprehensive income $ 29,830 $ 4,336 $ 9,722.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023Jan 30, 2022\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: Jan 30, 2022\nTEXT: See accompanying notes to the consolidated financial statements.\nTITLE: NVIDIA Corporation and Subsidiaries\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nassets, liabilities, shares, total, issued, value, current, other, shareholders, term\n\nTITLE: Consolidated Balance Sheets\nTEXT: (In millions, except par value) Jan 28, 2024Jan 29, 2023Assets Current assets: Cash and cash equivalents$7,280 $3,389 Marketable securities18,704 9,907 Accounts receivable, net9,999 3,827 Inventories5,282 5,159 Prepaid expenses and other current assets3,080 791 Total current assets44,345 23,073 Property and equipment, net3,914 3,807 Operating lease assets1,346 1,038 Goodwill4,430 4,372 Intangible assets, net1,112 1,676 Deferred income tax assets6,081 3,396 Other assets4,500 3,820 Total assets$65,728 $41,182 Liabilities and Shareholders' EquityCurrent liabilities: Accounts payable$2,699 $1,193 Accrued and other current liabilities6,682 4,120 Short-term debt1,250 1,250 Total current liabilities10,631 6,563 Long-term debt8,459 9,703 Long-term operating lease liabilities 1,119 902 Other long-term liabilities2,541 1,913 Total liabilities22,750 19,081 Commitments and contingencies - see Note 13Shareholders’ equity: Preferred stock, $0.001 par value; 2 shares authorized; none issued— — Common stock, $0.001 par value; 8,000 shares authorized; 2,464 shares issued and outstanding as of January 28, 2024; 2,466 shares issued and outstanding as of January 29, 20232 2 Additional paid-in capital13,132 11,971 Accumulated other comprehensive income (loss)27 (43)Retained earnings29,817 10,171 Total shareholders' equity42,978 22,101 Total liabilities and shareholders' equity$65,728 $41,182\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023; Cash and cash equivalents $ 7,280 $ 3,389; Marketable securities 18,704 9,907; Accounts receivable, net 9,999 3,827; Inventories 5,282 5,159; Prepaid expenses and other current assets 3,080 791; Total current assets 44,345 23,073; Property and equipment, net 3,914 3,807; Operating lease assets 1,346 1,038; Goodwill 4,430 4,372; Intangible assets, net 1,112 1,676; Deferred income tax assets 6,081 3,396; Other assets 4,500 3,820; Total assets $ 65,728 $ 41,182; Accounts payable $ 2,699 $ 1,193; Accrued and other current liabilities 6,682 4,120; Short-term debt 1,250 1,250; Total current liabilities 10,631 6,563; Long-term debt 8,459 9,703; Long-term operating lease liabilities 1,119 902; Other long-term liabilities 2,541 1,913; Total liabilities 22,750 19,081; Preferred stock, $0.001 par value; 2 shares authorized; none issued — —; Common stock, $0.001 par value; 8,000 shares authorized; 2,464 shares issued and outstanding as of January 28, 2024; 2,466 shares issued and outstanding as of January 29, 2023 2 2; Additional paid-in capital 13,132 11,971; Accumulated other comprehensive income (loss) 27 (43); Retained earnings 29,817 10,171; Total shareholders' equity 42,978 22,101; Total liabilities and shareholders' equity $ 65,728 $ 41,182.\nTITLE: Jan 28, 2024Jan 29, 2023\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: Assets\nTITLE: Liabilities and Shareholders' Equity\nTEXT: Commitments and contingencies - see Note 13\nTEXT: Preferred stock, $0.001 par value; 2 shares authorized; none issued\nTEXT: Common stock, $0.001 par value; 8,000 shares authorized; 2,464 shares issued and outstanding as of January 28, 2024; 2,466 shares issued and outstanding as of January 29, 2023\nTEXT: See accompanying notes to the consolidated financial statements.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstock, common, paid, income, share, other, balances, cash, dividends, declared\n\nTITLE: NVIDIA Corporation and Subsidiaries\nTEXT: Consolidated Statements of Shareholders' EquityCommon StockOutstandingAdditional Paid-inTreasuryAccumulated Other ComprehensiveRetainedTotal Shareholders'SharesAmountCapital Stock Income (Loss) Earnings Equity(In millions, except per share data)Balances, Jan 31, 20212,479 $3 $8,719 $(10,756)$19 $18,908 $16,893 Net income— — — — — 9,752 9,752 Other comprehensive loss— — — — (30)— (30)Issuance of common stock from stock plans35 — 281 — — — 281 Tax withholding related to vesting of restricted stock units(8)— (614)(1,290)— — (1,904)Cash dividends declared and paid ($0.16 per common share)— — — — — (399)(399)Fair value of partially vested equity awards assumed in connection with acquisitions— — 18 — — — 18 Stock-based compensation— — 2,001 — — — 2,001 Retirement of Treasury Stock— — (20)12,046 — (12,026)— Balances, Jan 30, 20222,506 3 10,385 — (11)16,235 26,612 Net income— — — — — 4,368 4,368 Other comprehensive loss— — — — (32)— (32)Issuance of common stock from stock plans31 — 355 — — — 355 Tax withholding related to vesting of restricted stock units(8)— (1,475)— — — (1,475)Shares repurchased(63)(1)(4)— — (10,034)(10,039)Cash dividends declared and paid ($0.16 per common share)— — — — — (398)(398)Stock-based compensation— — 2,710 — — — 2,710 Balances, Jan 29, 20232,466 2 11,971 — (43)10,171 22,101 Net income— — — — — 29,760 29,760 Other comprehensive income— — — — 70 70 Issuance of common stock from stock plans26 — 403 — — — 403 Tax withholding related to vesting of restricted stock units(7)— (2,783)— — — (2,783)Shares repurchased(21)— (27)— — (9,719)(9,746)Cash dividends declared and paid ($0.16 per common share)— — — — — (395)(395)Stock-based compensation— — 3,568 — — — 3,568 Balances, Jan 28, 20242,464 $2 $13,132 $— $27 $29,817 $42,978\nTABLE: TABLE: Common StockOutstanding Additional Paid-in Treasury Accumulated Other Comprehensive Retained Total Shareholders'; Shares Amount Capital Stock Income (Loss) Earnings Equity; Balances, Jan 31, 2021 2,479 $ 3 $ 8,719 $ (10,756) $ 19 $ 18,908 $ 16,893; Net income — — — — — 9,752 9,752; Other comprehensive loss — — — — (30) — (30); Issuance of common stock from stock plans 35 — 281 — — — 281; Tax withholding related to vesting of restricted stock units (8) — (614) (1,290) — — (1,904); Cash dividends declared and paid ($0.16 per common share) — — — — — (399) (399); Fair value of partially vested equity awards assumed in connection with acquisitions — — 18 — — — 18; Stock-based compensation — — 2,001 — — — 2,001; Retirement of Treasury Stock — — (20) 12,046 — (12,026) —; Balances, Jan 30, 2022 2,506 3 10,385 — (11) 16,235 26,612; Net income — — — — — 4,368 4,368; Other comprehensive loss — — — — (32) — (32); Issuance of common stock from stock plans 31 — 355 — — — 355; Tax withholding related to vesting of restricted stock units (8) — (1,475) — — — (1,475); Shares repurchased (63) (1) (4) — — (10,034) (10,039); Cash dividends declared and paid ($0.16 per common share) — — — — — (398) (398); Stock-based compensation — — 2,710 — — — 2,710; Balances, Jan 29, 2023 2,466 2 11,971 — (43) 10,171 22,101; Net income — — — — — 29,760 29,760; Other comprehensive income — — — — 70 70; Issuance of common stock from stock plans 26 — 403 — — — 403; Tax withholding related to vesting of restricted stock units (7) — (2,783) — — — (2,783); Shares repurchased (21) — (27) — — (9,719) (9,746); Cash dividends declared and paid ($0.16 per common share) — — — — — (395) (395); Stock-based compensation — — 3,568 — — — 3,568; Balances, Jan 28, 2024 2,464 $ 2 $ 13,132 $ — $ 27 $ 29,817 $ 42,978.\nTITLE: Common StockOutstandingAdditional Paid-inTreasuryAccumulated Other ComprehensiveRetainedTotal Shareholders'\nTITLE: Common StockOutstanding\nTITLE: Additional Paid-in\nTITLE: Treasury\nTITLE: Accumulated Other Comprehensive\nTITLE: Retained\nTITLE: Total Shareholders'\nTITLE: SharesAmountCapital Stock Income (Loss) Earnings Equity\nTITLE: Shares\nTITLE: Amount\nTITLE: Capital\nTITLE: Stock\nTITLE: Income (Loss)\nTITLE: Earnings\nTITLE: Equity\nTITLE: (In millions, except per share data)\nTEXT: Cash dividends declared and paid ($0.16 per common share)\nTEXT: See accompanying notes to the consolidated financial statements.\nTITLE: NVIDIA Corporation and Subsidiaries\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, activities, other, stock, related, operating, income, provided, assets, payments\n\nTITLE: Consolidated Statements of Cash Flows\nTEXT: (In millions)Year Ended Jan 28, 2024Jan 29, 2023Jan 30, 2022Cash flows from operating activities: Net income$29,760 $4,368 $9,752 Adjustments to reconcile net income to net cash provided by operating activities: Stock-based compensation expense3,549 2,709 2,004 Depreciation and amortization1,508 1,544 1,174 Deferred income taxes(2,489)(2,164)(406)(Gains) losses on investments in non-affiliated entities, net(238)45 (100)Acquisition termination cost— 1,353 — Other(278)(7)47 Changes in operating assets and liabilities, net of acquisitions: Accounts receivable(6,172)822 (2,215)Inventories(98)(2,554)(774)Prepaid expenses and other assets(1,522)(1,517)(1,715)Accounts payable1,531 (551)568 Accrued and other current liabilities2,025 1,341 581 Other long-term liabilities514 252 192 Net cash provided by operating activities28,090 5,641 9,108 Cash flows from investing activities: Proceeds from maturities of marketable securities9,732 19,425 15,197 Proceeds from sales of marketable securities50 1,806 1,023 Purchases of marketable securities(18,211)(11,897)(24,787)Purchases related to property and equipment and intangible assets(1,069)(1,833)(976)Acquisitions, net of cash acquired(83)(49)(263)Investments in non-affiliated entities and other, net(985)(77)(24)Net cash provided by (used in) investing activities(10,566)7,375 (9,830)Cash flows from financing activities: Proceeds related to employee stock plans403 355 281 Payments related to repurchases of common stock(9,533)(10,039)— Payments related to tax on restricted stock units(2,783)(1,475)(1,904)Repayment of debt(1,250)— (1,000)Dividends paid(395)(398)(399)Principal payments on property and equipment and intangible assets(74)(58)(83)Issuance of debt, net of issuance costs— — 4,977 Other(1)(2)(7)Net cash provided by (used in) financing activities(13,633)(11,617)1,865 Change in cash and cash equivalents3,891 1,399 1,143 Cash and cash equivalents at beginning of period3,389 1,990 847 Cash and cash equivalents at end of period$7,280 $3,389 $1,990 Supplemental disclosures of cash flow information:Cash paid for income taxes, net$6,549 $1,404 $396 Cash paid for interest$252 $254 $246\nTABLE: TABLE: Jan 28, 2024 Jan 29, 2023 Jan 30, 2022; Net income $ 29,760 $ 4,368 $ 9,752; Stock-based compensation expense 3,549 2,709 2,004; Depreciation and amortization 1,508 1,544 1,174; Deferred income taxes (2,489) (2,164) (406); (Gains) losses on investments in non-affiliated entities, net (238) 45 (100); Acquisition termination cost — 1,353 —; Other (278) (7) 47; Accounts receivable (6,172) 822 (2,215); Inventories (98) (2,554) (774); Prepaid expenses and other assets (1,522) (1,517) (1,715); Accounts payable 1,531 (551) 568; Accrued and other current liabilities 2,025 1,341 581; Other long-term liabilities 514 252 192; Net cash provided by operating activities 28,090 5,641 9,108; Proceeds from maturities of marketable securities 9,732 19,425 15,197; Proceeds from sales of marketable securities 50 1,806 1,023; Purchases of marketable securities (18,211) (11,897) (24,787); Purchases related to property and equipment and intangible assets (1,069) (1,833) (976); Acquisitions, net of cash acquired (83) (49) (263); Investments in non-affiliated entities and other, net (985) (77) (24); Net cash provided by (used in) investing activities (10,566) 7,375 (9,830); Proceeds related to employee stock plans 403 355 281; Payments related to repurchases of common stock (9,533) (10,039) —; Payments related to tax on restricted stock units (2,783) (1,475) (1,904); Repayment of debt (1,250) — (1,000); Dividends paid (395) (398) (399); Principal payments on property and equipment and intangible assets (74) (58) (83); Issuance of debt, net of issuance costs — — 4,977; Other (1) (2) (7); Net cash provided by (used in) financing activities (13,633) (11,617) 1,865; Change in cash and cash equivalents 3,891 1,399 1,143; Cash and cash equivalents at beginning of period 3,389 1,990 847; Cash and cash equivalents at end of period $ 7,280 $ 3,389 $ 1,990; Cash paid for income taxes, net $ 6,549 $ 1,404 $ 396; Cash paid for interest $ 252 $ 254 $ 246.\nTITLE: Year Ended\nTITLE: Jan 28, 2024Jan 29, 2023Jan 30, 2022\nTITLE: Jan 28, 2024\nTITLE: Jan 29, 2023\nTITLE: Jan 30, 2022\nTEXT: Payments related to repurchases of common stock\nTITLE: Supplemental disclosures of cash flow information:\nTEXT: See accompanying notes to the consolidated financial statements.\nTITLE: Table of ContentsNVIDIA Corporation and SubsidiariesNotes to the Consolidated Financial Statements\nTITLE: Table of Contents\nTITLE: NVIDIA Corporation and Subsidiaries\n"
    }
  ]
}