[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.02\nTEXT: ITEM 2.02 RESULTS OF OPERATIONS AND FINANCIAL CONDITIONOn October 24, 2025, The Procter & Gamble Company (the \"Company\") issued a news release with respect to earnings for the quarter ended September 30, 2025. The Company is furnishing this 8-K pursuant to\nTEXT: ITEM 2.02 RESULTS OF OPERATIONS AND FINANCIAL CONDITION RESULTS OF OPERATIONS AND FINANCIAL CONDITION RESULTS OF OPERATIONS AND FINANCIAL CONDITION On October 24, 2025, The Procter & Gamble Company (the \"Company\") issued a news release with respect to earnings for the quarter ended September 30, 2025. The Company is furnishing this 8-K pursuant to\nTEXT: Item 2.02, \"Results of Operations and Financial Condition.\" On October 24, 2025, The Procter & Gamble Company (the \"Company\") issued a news release with respect to earnings for the quarter ended September 30, 2025. The Company is furnishing this 8-K pursuant to\nTITLE: Item 9.01\nTEXT: ITEM 9.01 FINANCIAL STATEMENTS AND EXHIBITSExhibit NumberDescription99.1News Release by The Procter & Gamble Company dated October 24, 2025.104Cover Page Interactive Data File (embedded within the Inline XBRL document).\nTEXT: ITEM 9.01 FINANCIAL STATEMENTS AND EXHIBITS FINANCIAL STATEMENTS AND EXHIBITS FINANCIAL STATEMENTS AND EXHIBITS Exhibit NumberDescription 99.1News Release by The Procter & Gamble Company dated October 24, 2025. News Release by The Procter & Gamble Company dated October 24, 2025. News Release by The Procter & Gamble Company dated October 24, 2025. News Release by The Procter & Gamble Company dated October 24, 2025. 104Cover Page Interactive Data File (embedded within the Inline XBRL document). Cover Page Interactive Data File (embedded within the Inline XBRL document). Cover Page Interactive Data File (embedded within the Inline XBRL document). Cover Page Interactive Data File (embedded within the Inline XBRL document). Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned hereunto duly authorized. THE PROCTER & GAMBLE COMPANYBy/s/ SANDRA T. LANESandra T. Lane, Assistant Secretary10/24/2025 THE PROCTER & GAMBLE COMPANYBy/s/ SANDRA T. LANESandra T. Lane, Assistant Secretary10/24/2025 THE PROCTER & GAMBLE COMPANYBy/s/ SANDRA T. LANESandra T. Lane, Assistant Secretary10/24/2025 THE PROCTER & GAMBLE COMPANY THE PROCTER & GAMBLE COMPANY THE PROCTER & GAMBLE COMPANY Sandra T. Lane, Assistant Secretary Sandra T. Lane, Assistant Secretary Sandra T. Lane, Assistant Secretary 99.1 News Release by The Procter & Gamble Company dated October 24, 2025. News Release by The Procter & Gamble Company dated October 24, 2025 News Release by The Procter & Gamble Company dated October 24, 2025\n"
  }
]