[
  {
    "cluster": 1,
    "content": "TITLE: Item 5.02\nTEXT: Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. A&R 2019 Equity Incentive Plan A&R 2019 Equity Incentive Plan On November 6, 2025, the shareholders of Tesla, Inc. (“Tesla”) approved the amended and restated Tesla, Inc. 2019 Equity Incentive Plan (the “A&R 2019 Equity Incentive Plan”) at Tesla’s 2025 Annual Meeting of Shareholders (the “Annual Meeting”) as described below in\n"
  },
  {
    "cluster": 2,
    "content": "TITLE: Item 5.07\nTEXT: Item 5.07 to this Current Report. A&R 2019 Equity Incentive Plan The material terms of the A&R 2019 Equity Incentive Plan were previously described in the section titled “Tesla Proposal for Approval of the A&R 2019 Equity Incentive Plan - Summary of the A&R 2019 Equity Incentive Plan” in Tesla’s Proxy Statement on Schedule 14A filed with the Securities and Exchange Commission (the “SEC”) on September 17, 2025 (the “Proxy Statement”). Such disclosure is hereby incorporated by reference into this Current Report on Form 8-K and is filed as Exhibit 99.1 hereto. Tesla Proposal for Approval of the A&R 2019 Equity Incentive Plan - Summary of the A&R 2019 Equity Incentive Plan The foregoing description of the A&R 2019 Equity Incentive Plan is qualified by reference to the A&R 2019 Equity Incentive Plan, which is filed as Exhibit 10.1 hereto and incorporated herein by reference. 2025 CEO Performance Award 2025 CEO Performance Award As previously disclosed, on September 3, 2025, Tesla granted Elon Musk, Tesla’s Chief Executive Officer, a performance-based restricted stock award (the “2025 CEO Performance Award”), subject to receipt of certain approvals. On November 6, 2025, Tesla’s shareholders approved the 2025 CEO Performance Award at the Annual Meeting as described below in\nTEXT: Item 5.07 to this Current Report. 2025 CEO Performance Award The material terms of the 2025 CEO Performance Award were previously described in the section titled “Tesla Proposal for Approval of the 2025 CEO Performance Award - Summary of the Proposed 2025 CEO Performance Award - Overview” in the Proxy Statement. Such disclosure is hereby incorporated by reference into this Current Report on Form 8-K and is filed as Exhibit 99.2 hereto. Tesla Proposal for Approval of the 2025 CEO Performance Award - Summary of the Proposed 2025 CEO Performance Award - Overview The foregoing description of the 2025 CEO Performance Award is qualified by reference to the 2025 CEO Performance Award, which is filed as Exhibit 10.2 hereto and incorporated herein by reference.\nTEXT: Item 5.07 Submission of Matters to a Vote of Security Holders. Submission of Matters to a Vote of Security Holders. Submission of Matters to a Vote of Security Holders. At the Annual Meeting held on November 6, 2025, Tesla’s shareholders voted on the following 14 proposals and Tesla’s inspector of election certified the vote tabulations indicated below. The individuals listed below were elected as Class III directors at the Annual Meeting to serve on the Board for a term of three years or until their respective successors are duly elected and qualified. For Against Abstained Broker Non-Votes Ira Ehrenpreis 1,594,744,259 858,829,029 15,831,288 302,456,274 Joe Gebbia 2,141,079,061 310,503,173 17,822,342 302,456,274 Kathleen Wilson-Thompson 1,924,321,801 529,031,020 16,051,755 302,456,274 For Against Abstained Broker Non-Votes Ira Ehrenpreis 1,594,744,259 858,829,029 15,831,288 302,456,274 Joe Gebbia 2,141,079,061 310,503,173 17,822,342 302,456,274 Kathleen Wilson-Thompson 1,924,321,801 529,031,020 16,051,755 302,456,274 For Against Abstained Broker Non-Votes Ira Ehrenpreis 1,594,744,259 858,829,029 15,831,288 302,456,274 Joe Gebbia 2,141,079,061 310,503,173 17,822,342 302,456,274 Kathleen Wilson-Thompson 1,924,321,801 529,031,020 16,051,755 302,456,274 Kathleen Wilson-Thompson Proposal 2 was a management proposal to approve executive compensation on a non-binding advisory basis. This proposal was approved. For Against Abstained Broker Non-Votes 1,931,965,361 523,895,380 13,543,835 302,456,274 For Against Abstained Broker Non-Votes 1,931,965,361 523,895,380 13,543,835 302,456,274 For Against Abstained Broker Non-Votes 1,931,965,361 523,895,380 13,543,835 302,456,274 Proposal 3 was a management proposal to approve the A&R 2019 Equity Incentive Plan. This proposal was approved. For Against Abstained Broker Non-Votes 1,942,926,670 514,568,170 11,909,736 302,456,274 For Against Abstained Broker Non-Votes 1,942,926,670 514,568,170 11,909,736 302,456,274 For Against Abstained Broker Non-Votes 1,942,926,670 514,568,170 11,909,736 302,456,274 Proposal 4 was a management proposal to approve the 2025 CEO Performance Award. This proposal was approved. For Against Abstained Broker Non-Votes 1,892,235,822 564,940,908 12,227,846 302,456,274 For Against Abstained Broker Non-Votes 1,892,235,822 564,940,908 12,227,846 302,456,274 For Against Abstained Broker Non-Votes 1,892,235,822 564,940,908 12,227,846 302,456,274 Proposal 5 was a management proposal for the ratification of the appointment of PricewaterhouseCoopers LLP as Tesla’s independent registered public accounting firm for the fiscal year ending December 31, 2025. This proposal was approved. For Against Abstained Broker Non-Votes 2,689,221,182 66,780,222 15,859,446 - For Against Abstained Broker Non-Votes 2,689,221,182 66,780,222 15,859,446 - For Against Abstained Broker Non-Votes 2,689,221,182 66,780,222 15,859,446 - Proposal 6 was a management proposal for adoption of amendments to our certificate of formation and bylaws to eliminate applicable supermajority voting requirements. This proposal was not approved. For Against Abstained Broker Non-Votes 1,309,549,644 955,682,310 181,764,443 302,456,274 For Against Abstained Broker Non-Votes 1,309,549,644 955,682,310 181,764,443 302,456,274 For Against Abstained Broker Non-Votes 1,309,549,644 955,682,310 181,764,443 302,456,274 Proposal 7 was a shareholder proposal regarding Board authorization of an investment in x.AI Corp. While more votes were cast in favor of the proposal than against, a significant number of shareholders abstained. Since our bylaws generally consider abstention as votes against, this was not approved under the bylaw standard. As a result, given that this is an advisory vote, the Board will examine next steps in light of these voting results (including the high number of abstentions). For Against Abstained Broker Non-Votes 1,058,999,435 916,321,296 473,073,200 302,456,274 For Against Abstained Broker Non-Votes 1,058,999,435 916,321,296 473,073,200 302,456,274 For Against Abstained Broker Non-Votes 1,058,999,435 916,321,296 473,073,200 302,456,274 Proposal 8 was a shareholder proposal regarding adopting targets and reporting on metrics to assess the feasibility of integrating sustainability metrics into senior executive compensation plans. This proposal was not approved. For Against Abstained Broker Non-Votes 216,413,542 2,223,974,663 29,016,371 302,456,274 For Against Abstained Broker Non-Votes 216,413,542 2,223,974,663 29,016,371 302,456,274 For Against Abstained Broker Non-Votes 216,413,542 2,223,974,663 29,016,371 302,456,274 Proposal 9 was a shareholder proposal requesting a child labor audit. This proposal was not approved. For Against Abstained Broker Non-Votes 188,709,041 2,238,338,124 42,357,411 302,456,274 For Against Abstained Broker Non-Votes 188,709,041 2,238,338,124 42,357,411 302,456,274 For Against Abstained Broker Non-Votes 188,709,041 2,238,338,124 42,357,411 302,456,274 Proposal 10 was a shareholder proposal to amend the bylaws to repeal the 3% derivative suit ownership threshold. This proposal was not approved. For Against Abstained Broker Non-Votes 611,152,245 1,821,038,859 37,213,472 302,456,274 For Against Abstained Broker Non-Votes 611,152,245 1,821,038,859 37,213,472 302,456,274 For Against Abstained Broker Non-Votes 611,152,245 1,821,038,859 37,213,472 302,456,274 Proposal 11 was a shareholder proposal to amend Article X of the bylaws. This proposal was not approved. For Against Abstained Broker Non-Votes 378,933,020 2,049,407,756 41,063,800 302,456,274 For Against Abstained Broker Non-Votes 378,933,020 2,049,407,756 41,063,800 302,456,274 For Against Abstained Broker Non-Votes 378,933,020 2,049,407,756 41,063,800 302,456,274 Proposal 12 was a shareholder proposal to elect each director annually. This proposal was approved. For Against Abstained Broker Non-Votes 1,328,135,664 1,118,920,427 22,348,485 302,456,274 For Against Abstained Broker Non-Votes 1,328,135,664 1,118,920,427 22,348,485 302,456,274 For Against Abstained Broker Non-Votes 1,328,135,664 1,118,920,427 22,348,485 302,456,274 Proposal 13 was a shareholder proposal regarding a proposal, which won 54% support at our 2024 annual meeting. This proposal was not approved. For Against Abstained Broker Non-Votes 787,399,596 1,648,698,264 33,306,716 302,456,274 For Against Abstained Broker Non-Votes 787,399,596 1,648,698,264 33,306,716 302,456,274 For Against Abstained Broker Non-Votes 787,399,596 1,648,698,264 33,306,716 302,456,274 Proposal 14 was a shareholder proposal to seek shareholder approval before adopting an amendment to the bylaws pursuant to Section 21.373 of the TBOC. This proposal was not approved. For Against Abstained Broker Non-Votes 1,205,163,451 1,234,433,868 29,807,257 302,456,274 For Against Abstained Broker Non-Votes 1,205,163,451 1,234,433,868 29,807,257 302,456,274 For Against Abstained Broker Non-Votes 1,205,163,451 1,234,433,868 29,807,257 302,456,274\n"
  },
  {
    "cluster": 3,
    "content": "TITLE: Item 9.01\nTEXT: Item 9.01Financial Statements and Exhibits. Financial Statements and Exhibits. Financial Statements and Exhibits. Exhibit No. Description 10.1 Tesla, Inc. Amended and Restated 2019 Equity Incentive Plan 10.2 Tesla, Inc. 2025 CEO Performance Award Agreement, dated as of September 3, 2025 10.3 Voting Agreement, dated as of September 3, 2025 99.1 Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. 99.2 Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. 104 Cover Page Interactive Data File (embedded within the Inline XBRL document). Exhibit No. Description 10.1 Tesla, Inc. Amended and Restated 2019 Equity Incentive Plan 10.2 Tesla, Inc. 2025 CEO Performance Award Agreement, dated as of September 3, 2025 10.3 Voting Agreement, dated as of September 3, 2025 99.1 Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. 99.2 Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. 104 Cover Page Interactive Data File (embedded within the Inline XBRL document). Exhibit No. Description 10.1 Tesla, Inc. Amended and Restated 2019 Equity Incentive Plan Tesla, Inc. Amended and Restated 2019 Equity Incentive Plan Tesla, Inc. Amended and Restated 2019 Equity Incentive Plan 10.2 Tesla, Inc. 2025 CEO Performance Award Agreement, dated as of September 3, 2025 Tesla, Inc. 2025 CEO Performance Award Agreement, dated as of September 3, 2025 Tesla, Inc. 2025 CEO Performance Award Agreement, dated as of September 3, 2025 10.3 Voting Agreement, dated as of September 3, 2025 Voting Agreement, dated as of September 3, 2025 Voting Agreement, dated as of September 3, 2025 99.1 Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. 99.2 Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. Excerpt from Proxy Statement on Schedule 14A dated September 17, 2025 of Tesla, Inc. 104 Cover Page Interactive Data File (embedded within the Inline XBRL document). Cover Page Interactive Data File (embedded within the Inline XBRL document). Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. TESLA, INC. By: /s/ Brandon Ehrhart Brandon Ehrhart General Counsel and Corporate Secretary TESLA, INC. By: /s/ Brandon Ehrhart Brandon Ehrhart General Counsel and Corporate Secretary By: /s/ Brandon Ehrhart Brandon Ehrhart General Counsel and Corporate Secretary Brandon Ehrhart General Counsel and Corporate Secretary Brandon Ehrhart General Counsel and Corporate Secretary Brandon Ehrhart General Counsel and Corporate Secretary Date: November 7, 2025\n"
  }
]