[
  {
    "cluster": 1,
    "content": "TITLE: Item 7.01\nTEXT: Item 7.01. Regulation FD Disclosure. Senior leaders from UnitedHealth Group Incorporated (the \"Company\") will respond to questions in an interview format, including discussion of the Company’s strategy, market positions, recent results and expectations for its end markets, at the UBS Global Healthcare Conference 2025 on Monday, November 10, 2025, beginning at 8:45 a.m., Eastern Time. Senior leaders from UnitedHealth Group Incorporated (the \"Company\") will respond to questions in an interview format, including discussion of the Company’s strategy, market positions, recent results and expectations for its end markets, at the UBS Global Healthcare Conference 2025 on Monday, November 10, 2025, beginning at 8:45 a.m., Eastern Time. A live audio webcast of the presentation will be made available through the Investor Relations page of the Company’s website at www.unitedhealthgroup.com. A live audio webcast of the presentation will be made available through the Investor Relations page of the Company’s website at www.unitedhealthgroup.com The information in this\nTEXT: Item 7.01 shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference in any Company filing under the Securities Act of 1933 or the Securities Exchange Act of 1934, except as shall be expressly set forth by specific reference in such filing. The information in this\nTEXT: Item 7.01 shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference in any Company filing under the Securities Act of 1933 or the Securities Exchange Act of 1934, except as shall be expressly set forth by specific reference in such filing. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Date: November 7, 2025 Date: November 7, 2025 UNITEDHEALTH GROUP INCORPORATEDBy: /s/ Kuai H. LeongKuai H. LeongSenior Deputy General Counsel and Deputy Corporate Secretary UNITEDHEALTH GROUP INCORPORATEDBy: /s/ Kuai H. LeongKuai H. LeongSenior Deputy General Counsel and Deputy Corporate Secretary UNITEDHEALTH GROUP INCORPORATEDBy: /s/ Kuai H. LeongKuai H. LeongSenior Deputy General Counsel and Deputy Corporate Secretary UNITEDHEALTH GROUP INCORPORATED UNITEDHEALTH GROUP INCORPORATED UNITEDHEALTH GROUP INCORPORATED UNITEDHEALTH GROUP INCORPORATED By: /s/ Kuai H. Leong Senior Deputy General Counsel and Deputy Corporate Secretary Senior Deputy General Counsel and Deputy Corporate Secretary Senior Deputy General Counsel and Deputy Corporate Secretary\n"
  }
]