[
  {
    "cluster": 1,
    "content": "TITLE: Item 2.02\nTEXT: Item 2.02 Results of Operations and Financial Condition. Results of Operations and Financial Condition. On October 28, 2025, UnitedHealth Group Incorporated (the “Company”) issued a press release announcing its third quarter 2025 results. A copy of the press release is furnished herewith as Exhibit 99.1 and incorporated herein by reference. On October 28, 2025, UnitedHealth Group Incorporated (the “Company”) issued a press release announcing its third quarter 2025 results. A copy of the press release is furnished herewith as Exhibit 99.1 and incorporated herein by reference. The information in this\nTEXT: Item 2.02 shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference in any Company filing under the Securities Act of 1933 or the Securities Exchange Act of 1934, except as shall be expressly set forth by specific reference in such filing. The information in this\nTITLE: Item 9.01\nTEXT: Item 9.01. Financial Statements and Exhibits. Financial Statements and Exhibits. ExhibitDescription99.1Press Release dated October 28, 2025104Cover Page Interactive Data File (formatted as Inline XBRL). ExhibitDescription99.1Press Release dated October 28, 2025104Cover Page Interactive Data File (formatted as Inline XBRL). ExhibitDescription99.1Press Release dated October 28, 2025104Cover Page Interactive Data File (formatted as Inline XBRL). 99.1Press Release dated October 28, 2025 Press Release dated October 28, 2025 Press Release dated October 28, 2025 Press Release dated October 28, 2025 104Cover Page Interactive Data File (formatted as Inline XBRL). Cover Page Interactive Data File (formatted as Inline XBRL). Cover Page Interactive Data File (formatted as Inline XBRL). Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Date: October 28, 2025 Date: October 28, 2025 UNITEDHEALTH GROUP INCORPORATEDBy: /s/ Kuai H. LeongKuai H. LeongSenior Deputy General Counsel and Deputy Corporate Secretary UNITEDHEALTH GROUP INCORPORATEDBy: /s/ Kuai H. LeongKuai H. LeongSenior Deputy General Counsel and Deputy Corporate Secretary UNITEDHEALTH GROUP INCORPORATEDBy: /s/ Kuai H. LeongKuai H. LeongSenior Deputy General Counsel and Deputy Corporate Secretary UNITEDHEALTH GROUP INCORPORATED UNITEDHEALTH GROUP INCORPORATED UNITEDHEALTH GROUP INCORPORATED UNITEDHEALTH GROUP INCORPORATED By: /s/ Kuai H. Leong Senior Deputy General Counsel and Deputy Corporate Secretary Senior Deputy General Counsel and Deputy Corporate Secretary Senior Deputy General Counsel and Deputy Corporate Secretary\n"
  }
]