{
  "item7": [
    {
      "cluster": 1,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nfinancial, statements, item, care, change, healthcare, part, unitedhealthcare, business, results\n\nTEXT: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nTEXT: The following discussion should be read together with the accompanying Consolidated Financial Statements and Notes to the Consolidated Financial Statements thereto included in Part II Item 8, “Financial Statements and Supplementary Data.” Readers are cautioned the statements, estimates, projections or outlook contained in this report, including discussions regarding financial prospects, economic conditions, trends and uncertainties contained in this Item 7, may constitute forward-looking statements within the meaning of the PSLRA. These forward-looking statements involve risks and uncertainties which may cause our actual results to differ materially from the expectations expressed or implied in the forward-looking statements. A description of some of the risks and uncertainties can be found further below in this Item 7 and in Part I, Item 1A, “Risk Factors.”\nTEXT: Discussions of year-over-year comparisons between 2023 and 2022 are not included in this Form 10-K and can be found in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of the Company’s Form 10-K for the fiscal year ended December 31, 2023.\nTITLE: EXECUTIVE OVERVIEW\nTITLE: General\nTEXT: UnitedHealth Group is a health care and well-being company with a mission to help people live healthier lives and help make the health system work better for everyone. Our two distinct, yet complementary businesses — Optum and UnitedHealthcare — are working to help build a modern, high-performing health system through improved access, affordability, outcomes and experiences for the individuals and organizations we are privileged to serve.\nTEXT: We have four reportable segments across our two businesses:\nTEXT: •UnitedHealthcare, which includes UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement and UnitedHealthcare Community & State.\nTEXT: Further information on our business and reportable segments is presented in Part I, Item 1, “Business” and in Note 14 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nTITLE: Change Healthcare Cyberattack\nTEXT: As previously announced, on February 21, 2024, we identified that cybercrime threat actors had gained access to certain Change Healthcare information technology systems. Upon detection of this outside threat, we isolated the impacted systems to protect our partners and customers.\nTEXT: We have substantially mitigated the impact to consumers and care providers of the unprecedented cyberattack on the U.S. health system and restored or replaced the majority of the affected Change Healthcare services. To support care providers we provided interest-free loans of more than $9 billion through December 31, 2024. For the year ended December 31, 2024, we incurred $2.2 billion of direct response costs, including costs associated with providing interest-free loans; increased medical care expenditures, as we suspended some care management activities to help care providers with their workflow processes; network restoration; and notifications of impacted persons. Optum Insight also experienced estimated business disruption impacts of $867 million for the year ended December 31, 2024, reflecting lost revenue while maintaining full readiness of the affected Change Healthcare services. We expect to continue to incur direct response costs and experience business disruption impacts at a lesser extent in 2025 as we work to bring transaction volumes back to pre-event levels and win new business.\nTEXT: We have determined the estimated total number of individuals impacted by the Change Healthcare cyberattack is approximately 190 million. The vast majority of those people have already been provided individual or substitute notice. The final number will be confirmed and filed with the Office for Civil Rights. Change Healthcare is not aware of any misuse of individuals’ information as a result of this incident and has not seen electronic medical record databases appear in the data during the analysis. It is possible that future risks and uncertainties resulting from the Change Healthcare cyberattack, including risks related to impacted data, litigation, reputational harm, and regulatory actions could adversely affect our financial condition or results of operations.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncare, health, medical, costs, continue, trends, medicaid, cost, people, future\n\nTITLE: Business Trends\nTEXT: Our businesses participate in the United States and certain other international health markets. In the United States, health care spending has grown consistently for many years and comprises 18% of gross domestic product (GDP). We expect overall spending on health care to continue to grow in the future, due to inflation, medical technology and pharmaceutical advancement, regulatory requirements, demographic trends in the population and national interest in health and well-being. The rate of market growth may be affected by a variety of factors, including macroeconomic conditions, which could impact our results of operations, including our continued efforts to control health care costs.\nTEXT: Pricing Trends. To price our health care benefits, products and services, we start with our view of expected future costs, including medical care patterns, inflation and labor market dynamics. We frequently evaluate and adjust our approach in each of the local markets we serve, considering relevant factors, such as product positioning, price competitiveness and environmental, competitive, legislative and regulatory considerations, including minimum medical loss ratio (MLR) thresholds and similar revenue adjustments. We will continue seeking to balance growth and profitability across all these dimensions.\nTEXT: The commercial risk market remains highly competitive in the small group, large group and individual segments. We expect broad-based competition to continue as the industry adapts to individual and employer needs.\nTEXT: Medicare Advantage funding continues to be pressured, as discussed below in “Regulatory Trends and Uncertainties” and we have observed increased care patterns as discussed below in “Medical Cost Trends.” Our 2025 benefit design approach contemplates these trends.\nTEXT: In Medicaid, we believe the payment rate environment creates the risk of continued downward pressure on Medicaid margin percentages. We continue to take a prudent, market-sustainable posture for both new business and maintenance of existing relationships. We continue to advocate for actuarially sound rates commensurate with our medical cost trends and we remain dedicated to partnering with those states that are committed to the long-term viability of their programs.\nTEXT: Medical Cost Trends. Our medical cost trends primarily relate to changes in unit costs, care activity and prescription drug costs. As expected and contemplated in our benefits design, we have continued to observe increased care patterns, which may continue in future periods. We also observed an upshift in hospital coding intensity and an acceleration in the prescribing of certain high-cost medications in early response to the Inflation Reduction Act (IRA). We expect these additional factors to continue into future periods. We endeavor to mitigate those increases by engaging hospitals, physicians and consumers with information and helping them make clinically sound choices, with the objective of helping them achieve high-quality, affordable care.\nTEXT: As a result of the Change Healthcare cyberattack, we incurred medical costs related to the impact of the temporary suspension of some care management activities, impacting our UnitedHealthcare and Optum Health businesses, to help care providers with their workflow processes. Early in the second quarter we resumed these activities. For the year ended December 31, 2024, medical costs related to the temporary suspension of some care management activities were approximately $640 million.\nTEXT: Medicaid Redeterminations. Medicaid redeterminations have impacted the number of people served through our Medicaid offerings, partially offset by an increase in consumers served through our commercial offerings as we endeavor to ensure that people and families have continued access to care. The Medicaid redetermination process has also caused a timing mismatch between the current health status of people served through Medicaid and state rate updates, which remained well short of current care activity. We expect this gap between people’s health status and rates will narrow in 2025.\nTEXT: Delivery System and Payment Modernization. The health care market continues to change based on demographic shifts, new regulations, political forces and both payer and patient expectations. Health plans and care providers are being called upon to work together to close gaps in care and improve overall care quality and patient experience, improve the health of populations and reduce costs. We are working to accelerate this vision through the innovation and integration of our care delivery models including in-clinic, in-home, behavioral and virtual care, and by using our data and analytics to provide clinicians with the necessary information in order to provide the best possible care in the most cost efficient setting. We continue to see a greater number of people enrolled in fully accountable value-based plans rewarding high-quality, affordable care and fostering collaboration.\nTEXT: This trend is creating needs for health management services which can coordinate care around the primary care physician, including new primary care channels, and for investments in new clinical and administrative information and management systems, which we believe provide growth opportunities for our Optum business platform. A key focus of our future growth is to accelerate the transition from fee-for-service care delivery and payment models to fully accountable value-based care. This transition requires initial costs such as system enhancements, integrated care coordination technology, physician training and clinical engagement. Enhanced clinical engagement is a critical step to improving the experience and health outcomes of the people we serve and should result in lower costs to the overall health system over time.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nearnings, operating, medical, medicare, rates, rate, industry, cost, revenues, advantage\n\nTITLE: Regulatory Trends and Uncertainties\nTEXT: Following is a summary of management’s view of the trends and uncertainties related to regulatory matters. For additional information regarding regulatory trends and uncertainties, see Part I, Item 1 “Business - Government Regulation” and Item 1A, “Risk Factors.”\nTEXT: Medicare Advantage Rates. Medicare Advantage rate notices over the years have at times resulted in industry base rates well below industry forward medical trend. For example, the Final Notice for 2024 and 2025 rates resulted in an industry base rate decrease, both of which are well short of what is an increasing industry forward medical cost trend. The Advance Notice for 2026 rates proposes an industry base rate increase also well short of forward medical cost trend, creating continued pressure in the Medicare Advantage program. Further, substantial revisions to the risk adjustment model, which serves to adjust rates to reflect a patient’s health status and care resource needs, will result in reduced funding and potentially benefits for people, especially those with some of the greatest health and social challenges.\nTEXT: As a result of ongoing Medicare funding pressures, there are adjustments we can make to partially offset these rate pressures and reductions for a particular period. For example, we can seek to intensify our medical and operating cost management, make changes to the size and composition of our care provider networks, adjust member benefits and implement or increase the member premiums supplementing the monthly payments we receive from the government. Additionally, we decide annually on a county-by-county basis where we will offer Medicare Advantage plans.\nTITLE: SELECTED OPERATING PERFORMANCE ITEMS\nTEXT: The following summarizes select 2024 year-over-year operating comparisons to 2023 and other financial results.\nTEXT: •Consolidated revenues grew 8%, UnitedHealthcare revenues grew 6% and Optum revenues grew 12%.\nTEXT: •UnitedHealthcare served 2.1 million more people domestically, driven by growth in commercial offerings, partially offset by the impact of Medicaid redeterminations.\nTEXT: •Earnings from operations of $32.3 billion compared to $32.4 billion last year.\nTEXT: •Diluted earnings per common share was $15.51, impacted by the loss on sale of subsidiary and subsidiaries held for sale.\nTEXT: •Cash flows from operations were $24.2 billion.\nTITLE: RESULTS SUMMARY\nTEXT: The following table summarizes our consolidated results of operations and other financial information:(in millions, except percentages and per share data)For the Years Ended December 31,Change2024202320222024 vs. 2023Revenues:Premiums$308,810 $290,827 $257,157 $17,983 6 %Products50,226 42,583 37,424 7,643 18 Services36,040 34,123 27,551 1,917 6 Investment and other income5,202 4,089 2,030 1,113 27 Total revenues400,278 371,622 324,162 28,656 8 Operating costs:Medical costs264,185 241,894 210,842 22,291 9 Operating costs53,013 54,628 47,782 (1,615)(3)Cost of products sold46,694 38,770 33,703 7,924 20 Depreciation and amortization4,099 3,972 3,400 127 3 Total operating costs367,991 339,264 295,727 28,727 8 Earnings from operations32,287 32,358 28,435 (71)— Interest expense(3,906)(3,246)(2,092)(660)20 Loss on sale of subsidiary and subsidiaries held for sale(8,310)— — (8,310)nmEarnings before income taxes20,071 29,112 26,343 (9,041)(31)Provision for income taxes(4,829)(5,968)(5,704)1,139 (19)Net earnings15,242 23,144 20,639 (7,902)(34)Earnings attributable to noncontrolling interests(837)(763)(519)(74)10 Net earnings attributable to UnitedHealth Group common shareholders$14,405 $22,381 $20,120 $(7,976)(36)%Diluted earnings per share attributable to UnitedHealth Group common shareholders$15.51 $23.86 $21.18 $(8.35)(35)%Medical care ratio (a)85.5 %83.2 %82.0 %2.3 %Operating cost ratio13.2 14.7 14.7 (1.5)Operating margin8.1 8.7 8.8 (0.6)Tax rate24.1 20.5 21.7 3.6 Net earnings margin (b)3.6 6.0 6.2 (2.4)Return on equity (c)15.9 %27.0 %27.2 %(11.1)%\nTABLE: TABLE: (in millions, except percentages and per share data) For the Years Ended December 31, Change; 2024 2023 2022 2024 vs. 2023; Premiums $ 308,810 $ 290,827 $ 257,157 $ 17,983 6 %; Products 50,226 42,583 37,424 7,643 18; Services 36,040 34,123 27,551 1,917 6; Investment and other income 5,202 4,089 2,030 1,113 27; Total revenues 400,278 371,622 324,162 28,656 8; Medical costs 264,185 241,894 210,842 22,291 9; Operating costs 53,013 54,628 47,782 (1,615) (3); Cost of products sold 46,694 38,770 33,703 7,924 20; Depreciation and amortization 4,099 3,972 3,400 127 3; Total operating costs 367,991 339,264 295,727 28,727 8; Earnings from operations 32,287 32,358 28,435 (71) —; Interest expense (3,906) (3,246) (2,092) (660) 20; Loss on sale of subsidiary and subsidiaries held for sale (8,310) — — (8,310) nm; Earnings before income taxes 20,071 29,112 26,343 (9,041) (31); Provision for income taxes (4,829) (5,968) (5,704) 1,139 (19); Net earnings 15,242 23,144 20,639 (7,902) (34); Earnings attributable to noncontrolling interests (837) (763) (519) (74) 10; Net earnings attributable to UnitedHealth Group common shareholders $ 14,405 $ 22,381 $ 20,120 $ (7,976) (36) %; Diluted earnings per share attributable to UnitedHealth Group common shareholders $ 15.51 $ 23.86 $ 21.18 $ (8.35) (35) %; Medical care ratio (a) 85.5 % 83.2 % 82.0 % 2.3 %; Operating cost ratio 13.2 14.7 14.7 (1.5); Operating margin 8.1 8.7 8.8 (0.6); Tax rate 24.1 20.5 21.7 3.6; Net earnings margin (b) 3.6 6.0 6.2 (2.4); Return on equity (c) 15.9 % 27.0 % 27.2 % (11.1) %.\nTITLE: (in millions, except percentages and per share data)For the Years Ended December 31,Change\nTITLE: (in millions, except percentages and per share data)\nTITLE: For the Years Ended December 31,\nTITLE: Change\nTITLE: 2024202320222024 vs. 2023\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\noptum, earnings, shareholders, health, equity, operations, consolidated, medical, revenue, people\n\nTITLE: 2024 vs. 2023\nTEXT: (a)Medical care ratio (MCR) is calculated as medical costs divided by premium revenue.\nTEXT: (b)Net earnings margin attributable to UnitedHealth Group common shareholders.\nTEXT: (c)Return on equity is calculated as net earnings attributable to UnitedHealth Group common shareholders divided by average shareholders’ equity. Average shareholders’ equity is calculated using the shareholders’ equity balance at the end of the preceding year and the shareholders’ equity balances at the end of each of the four quarters of the year presented.\nTITLE: 2024 RESULTS OF OPERATIONS COMPARED TO 2023 RESULTS\nTITLE: Consolidated Financial Results\nTITLE: Revenues\nTEXT: The increases in revenues were primarily driven by growth in Optum Rx, UnitedHealthcare’s domestic offerings and Optum Health, partially offset by the sale of UnitedHealthcare’s Brazil operations.\nTITLE: Medical Costs and MCR\nTEXT: Medical costs increased primarily due to growth in people served through Medicare Advantage and domestic commercial offerings and member mix. The MCR increased as a result of the revenue effects of the Medicare funding reductions, Medicaid timing mismatch between people’s health status and rates, upshift in hospital coding intensity, specialty pharmaceutical prescribing patterns, member mix and due to incremental medical costs for accommodations made to care providers as a result of the Change Healthcare cyberattack.\nTITLE: Operating Cost Ratio\nTEXT: The operating cost ratio decreased primarily due to operating cost management and gains related to business portfolio refinement, including strategic transactions, partially offset by the impact of our direct response efforts to the Change Healthcare cyberattack and investments to support future growth.\nTITLE: Loss on Sale of Subsidiary and Subsidiaries Held for Sale\nTEXT: On February 6, 2024, the Company completed the sale of its Brazil operations. During the year ended December 31, 2024, we recorded a loss of $7.1 billion, of which $4.1 billion related to the impact of cumulative foreign currency translation losses previously included in accumulated other comprehensive loss.\nTEXT: In the second quarter of 2024, the Company initiated a plan to sell its remaining South American operations, which were classified as held for sale as of December 31, 2024. During the year ended December 31, 2024, we recorded a loss of $1.2 billion, of which $855 million related to the impact of cumulative foreign currency translation losses.\nTITLE: Reportable Segments\nTEXT: See Note 14 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” for more information on our segments. We utilize various metrics to evaluate and manage our reportable segments, including individuals served by UnitedHealthcare by major market segment and funding arrangement, people served by Optum Health and adjusted scripts for Optum Rx. These metrics are the main drivers of revenue, earnings and cash flows at each business. The metrics also allow management and investors to evaluate and understand business mix, including the level and scope of services provided to people and pricing trends when comparing the metrics to revenue by segment.\nTEXT: The following table presents a summary of the reportable segment financial information: For the Years Ended December 31,Change(in millions, except percentages)2024202320222024 vs. 2023RevenuesUnitedHealthcare$298,208 $281,360 $249,741 $16,848 6 %Optum Health105,358 95,319 71,174 10,039 11 Optum Insight18,757 18,932 14,581 (175)(1)Optum Rx133,231 116,087 99,773 17,144 15 Optum eliminations(4,389)(3,703)(2,760)(686)19 Optum252,957 226,635 182,768 26,322 12 Eliminations(150,887)(136,373)(108,347)(14,514)11 Consolidated revenues$400,278 $371,622 $324,162 $28,656 8 %Earnings from operationsUnitedHealthcare$15,584 $16,415 $14,379 $(831)(5)%Optum Health7,770 6,560 6,032 1,210 18 Optum Insight3,097 4,268 3,588 (1,171)(27)Optum Rx5,836 5,115 4,436 721 14 Optum16,703 15,943 14,056 760 5 Consolidated earnings from operations$32,287 $32,358 $28,435 $(71)— %Operating marginUnitedHealthcare5.2 %5.8 %5.8 %(0.6)%Optum Health7.4 6.9 8.5 0.5 Optum Insight16.5 22.5 24.6 (6.0)Optum Rx4.4 4.4 4.4 — Optum6.6 7.0 7.7 (0.4)Consolidated operating margin8.1 %8.7 %8.8 %(0.6)%\nTABLE: TABLE: For the Years Ended December 31, Change; (in millions, except percentages) 2024 2023 2022 2024 vs. 2023; UnitedHealthcare $ 298,208 $ 281,360 $ 249,741 $ 16,848 6 %; Optum Health 105,358 95,319 71,174 10,039 11; Optum Insight 18,757 18,932 14,581 (175) (1); Optum Rx 133,231 116,087 99,773 17,144 15; Optum eliminations (4,389) (3,703) (2,760) (686) 19; Optum 252,957 226,635 182,768 26,322 12; Eliminations (150,887) (136,373) (108,347) (14,514) 11; Consolidated revenues $ 400,278 $ 371,622 $ 324,162 $ 28,656 8 %; UnitedHealthcare $ 15,584 $ 16,415 $ 14,379 $ (831) (5) %; Optum Health 7,770 6,560 6,032 1,210 18; Optum Insight 3,097 4,268 3,588 (1,171) (27); Optum Rx 5,836 5,115 4,436 721 14; Optum 16,703 15,943 14,056 760 5; Consolidated earnings from operations $ 32,287 $ 32,358 $ 28,435 $ (71) — %; UnitedHealthcare 5.2 % 5.8 % 5.8 % (0.6) %; Optum Health 7.4 6.9 8.5 0.5; Optum Insight 16.5 22.5 24.6 (6.0); Optum Rx 4.4 4.4 4.4 —; Optum 6.6 7.0 7.7 (0.4); Consolidated operating margin 8.1 % 8.7 % 8.8 % (0.6) %.\nTITLE: For the Years Ended December 31,Change\nTITLE: For the Years Ended December 31,\nTITLE: Change\nTITLE: (in millions, except percentages)2024202320222024 vs. 2023\nTITLE: (in millions, except percentages)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: 2024 vs. 2023\nTITLE: Revenues\nTITLE: Earnings from operations\nTEXT: Consolidated earnings from operations\nTITLE: Operating margin\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nunitedhealthcare, optum, medicare, increased, growth, operations, revenues, total, earnings, business\n\nTITLE: UnitedHealthcare\nTEXT: The following table summarizes UnitedHealthcare revenues by business: For the Years Ended December 31,Change(in millions, except percentages)2024202320222024 vs. 2023UnitedHealthcare Employer & Individual - Domestic$74,489 $67,187 $63,599 $7,302 11 %UnitedHealthcare Employer & Individual - Global3,667 9,307 8,668 (5,640)(61)UnitedHealthcare Employer & Individual - Total78,156 76,494 72,267 1,662 2 UnitedHealthcare Medicare & Retirement139,482 129,862 113,671 9,620 7 UnitedHealthcare Community & State80,570 75,004 63,803 5,566 7 Total UnitedHealthcare revenues$298,208 $281,360 $249,741 $16,848 6 %\nTABLE: TABLE: For the Years Ended December 31, Change; (in millions, except percentages) 2024 2023 2022 2024 vs. 2023; UnitedHealthcare Employer & Individual - Domestic $ 74,489 $ 67,187 $ 63,599 $ 7,302 11 %; UnitedHealthcare Employer & Individual - Global 3,667 9,307 8,668 (5,640) (61); UnitedHealthcare Employer & Individual - Total 78,156 76,494 72,267 1,662 2; UnitedHealthcare Medicare & Retirement 139,482 129,862 113,671 9,620 7; UnitedHealthcare Community & State 80,570 75,004 63,803 5,566 7; Total UnitedHealthcare revenues $ 298,208 $ 281,360 $ 249,741 $ 16,848 6 %.\nTITLE: For the Years Ended December 31,Change\nTITLE: For the Years Ended December 31,\nTITLE: Change\nTITLE: (in millions, except percentages)2024202320222024 vs. 2023\nTITLE: (in millions, except percentages)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: 2024 vs. 2023\nTEXT: UnitedHealthcare Medicare & Retirement\nTEXT: UnitedHealthcare Community & State\nTEXT: The following table summarizes the number of individuals served by our UnitedHealthcare businesses, by major market segment and funding arrangement: December 31,Change(in thousands, except percentages)2024202320222024 vs. 2023Commercial - domestic:Risk-based8,845 8,115 8,045 730 9 %Fee-based20,885 19,200 18,640 1,685 9 Total commercial - domestic29,730 27,315 26,685 2,415 9 Medicare Advantage7,845 7,695 7,105 150 2 Medicaid7,435 7,845 8,170 (410)(5)Medicare Supplement (Standardized)4,335 4,355 4,375 (20)— Total community and senior19,615 19,895 19,650 (280)(1)Total UnitedHealthcare - domestic medical49,345 47,210 46,335 2,135 5 Commercial - global1,330 5,540 5,360 (4,210)(76)Total UnitedHealthcare - medical50,675 52,750 51,695 (2,075)(4)%Supplemental Data:Medicare Part D stand-alone3,050 3,315 3,295 (265)(8)%\nTABLE: TABLE: December 31, Change; (in thousands, except percentages) 2024 2023 2022 2024 vs. 2023; Risk-based 8,845 8,115 8,045 730 9 %; Fee-based 20,885 19,200 18,640 1,685 9; Total commercial - domestic 29,730 27,315 26,685 2,415 9; Medicare Advantage 7,845 7,695 7,105 150 2; Medicaid 7,435 7,845 8,170 (410) (5); Medicare Supplement (Standardized) 4,335 4,355 4,375 (20) —; Total community and senior 19,615 19,895 19,650 (280) (1); Total UnitedHealthcare - domestic medical 49,345 47,210 46,335 2,135 5; Commercial - global 1,330 5,540 5,360 (4,210) (76); Total UnitedHealthcare - medical 50,675 52,750 51,695 (2,075) (4) %; Medicare Part D stand-alone 3,050 3,315 3,295 (265) (8) %.\nTITLE: December 31,Change\nTITLE: December 31,\nTITLE: Change\nTITLE: (in thousands, except percentages)2024202320222024 vs. 2023\nTITLE: (in thousands, except percentages)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: 2024 vs. 2023\nTEXT: UnitedHealthcare’s revenues increased due to growth in the number of people served through Medicare Advantage and domestic commercial offerings, partially offset by decreased people served globally due to the sale of the Brazil operations and in Medicaid offerings due to redeterminations. Earnings from operations decreased due to Medicare Advantage funding reductions, the impacts of Medicaid redeterminations, member mix and incremental medical costs for accommodations to support care providers as a result of the Change Healthcare cyberattack, partially offset by gains related to business portfolio refinement, including strategic transactions, and the growth in the number of people served through Medicare Advantage and domestic commercial offerings.\nTITLE: Optum\nTEXT: Total revenues increased due to growth at Optum Rx and Optum Health. Earnings from operations increased with growth at Optum Health and Optum Rx, partially offset by decreased earnings from operations at Optum Insight. The results by segment were as follows:\nTITLE: Optum Health\nTEXT: Revenues at Optum Health increased primarily due to organic growth in patients served under value-based care arrangements. Earnings from operations increased due to gains related to business portfolio refinement, including strategic transactions, increased investment income and cost management initiatives, partially offset by Medicare Advantage funding reductions, costs associated with serving newly added patients under value-based care arrangements and medical care activity. Optum Health served approximately 100 million people as of December 31, 2024 compared to 103 million people as of December 31, 2023.\nTITLE: Optum Insight\nTEXT: Revenues at Optum Insight decreased primarily due the business disruption impacts from the Change Healthcare cyberattack, partially offset by growth in technology services. Earnings from operations decreased primarily due to direct response costs and business disruption impacts related to the Change Healthcare cyberattack, partially offset by gains related to business portfolio refinement, including strategic transactions.\nTITLE: Optum Rx\nTEXT: Revenues and earnings from operations at Optum Rx increased due to higher script volumes from both new clients and growth in existing clients and growth in pharmacy services. Earnings from operations also increased due to operating cost efficiencies and supply chain initiatives. Optum Rx fulfilled 1,623 million and 1,542 million adjusted scripts in 2024 and 2023, respectively.\nTITLE: LIQUIDITY, FINANCIAL CONDITION AND CAPITAL RESOURCES\nTITLE: Liquidity\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, businesses, dividends, financial, capital, term, flows, equivalents, purchases, regulated\n\nTITLE: Introduction\nTEXT: We manage our liquidity and financial position in the context of our overall business strategy. We continually forecast and manage our cash, investments, working capital balances and capital structure to meet the short-term and long-term obligations of our businesses while seeking to maintain liquidity and financial flexibility. Cash flows generated from operating activities are principally derived from earnings before noncash expenses.\nTEXT: Our regulated subsidiaries generate significant cash flows from operations and are subject to, among other things, minimum levels of statutory capital, as defined by their respective jurisdictions, and restrictions on the timing and amount of dividends paid to their parent companies.\nTEXT: Our U.S. regulated subsidiaries paid their parent companies dividends of $9.2 billion and $8.0 billion in 2024 and 2023, respectively. See Note 10 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” for further detail concerning our regulated subsidiary dividends.\nTEXT: Our nonregulated businesses also generate significant cash flows from operations available for general corporate use. Cash flows generated by these entities, combined with dividends from our regulated entities and financing through the issuance of long-term debt as well as issuance of commercial paper or the ability to draw under our committed credit facilities, further strengthen our operating and financial flexibility. We use these cash flows to expand our businesses through acquisitions, reinvest in our businesses through capital expenditures, repay debt and return capital to our shareholders through dividends and repurchases of our common stock.\nTEXT: Summary of our Major Sources and Uses of Cash and Cash Equivalents For the Years Ended December 31,Change(in millions)2024202320222024 vs. 2023Sources of cash:Cash provided by operating activities$24,204 $29,068 $26,206 $(4,864)Issuances of long-term debt and short-term borrowings, net of repayments14,660 4,280 12,536 10,380 Proceeds from common share issuances1,846 1,353 1,253 493 Customer funds administered— — 5,548 — Cash received for dispositions2,041 685 3,414 1,356 Sales and maturities of investments, net of purchases525 — — 525 Total sources of cash43,276 35,386 48,957 7,890 Uses of cash:Cash paid for acquisitions and other transactions, net of cash assumed(13,408)(10,136)(21,458)(3,272)Common share repurchases(9,000)(8,000)(7,000)(1,000)Cash dividends paid(7,533)(6,761)(5,991)(772)Purchases of property, equipment and capitalized software(3,499)(3,386)(2,802)(113)Purchases of investments, net of sales and maturities — (1,777)(6,837)1,777 Purchases of redeemable noncontrolling interests(280)(730)(176)450 Loans to care providers - cyberattack, net of repayments(4,519)— — (4,519)Customer funds administered(1,560)(521)— (1,039)Other(3,312)(2,110)(2,737)(1,202)Total uses of cash(43,111)(33,421)(47,001)(9,690)Effect of exchange rate changes on cash and cash equivalents(61)97 34 (158)Net increase in cash and cash equivalents, including cash within businesses held for sale $104 $2,062 $1,990 $(1,958)Less: cash within businesses held for sale(219)— — (219)Net (decrease) increase in cash and cash equivalents$(115)$2,062 $1,990 $(2,177)\nTABLE: TABLE: For the Years Ended December 31, Change; (in millions) 2024 2023 2022 2024 vs. 2023; Cash provided by operating activities $ 24,204 $ 29,068 $ 26,206 $ (4,864); Issuances of long-term debt and short-term borrowings, net of repayments 14,660 4,280 12,536 10,380; Proceeds from common share issuances 1,846 1,353 1,253 493; Customer funds administered — — 5,548 —; Cash received for dispositions 2,041 685 3,414 1,356; Sales and maturities of investments, net of purchases 525 — — 525; Total sources of cash 43,276 35,386 48,957 7,890; Cash paid for acquisitions and other transactions, net of cash assumed (13,408) (10,136) (21,458) (3,272); Common share repurchases (9,000) (8,000) (7,000) (1,000); Cash dividends paid (7,533) (6,761) (5,991) (772); Purchases of property, equipment and capitalized software (3,499) (3,386) (2,802) (113); Purchases of investments, net of sales and maturities — (1,777) (6,837) 1,777; Purchases of redeemable noncontrolling interests (280) (730) (176) 450; Loans to care providers - cyberattack, net of repayments (4,519) — — (4,519); Customer funds administered (1,560) (521) — (1,039); Other (3,312) (2,110) (2,737) (1,202); Total uses of cash (43,111) (33,421) (47,001) (9,690); Effect of exchange rate changes on cash and cash equivalents (61) 97 34 (158); Net increase in cash and cash equivalents, including cash within businesses held for sale $ 104 $ 2,062 $ 1,990 $ (1,958); Less: cash within businesses held for sale (219) — — (219); Net (decrease) increase in cash and cash equivalents $ (115) $ 2,062 $ 1,990 $ (2,177).\nTITLE: For the Years Ended December 31,Change\nTITLE: For the Years Ended December 31,\nTITLE: Change\nTITLE: (in millions)2024202320222024 vs. 2023\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: 2024 vs. 2023\nTEXT: Proceeds from common share issuances\nTEXT: Purchases of property, equipment and capitalized software\nTEXT: Effect of exchange rate changes on cash and cash equivalents\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\ncash, available, increased, debt, securities, credit, average, other, included, financial\n\nTITLE: 2024 Cash Flows Compared to 2023 Cash Flows\nTEXT: Decreased cash flows provided by operating activities were primarily driven by CMS Medicare funding reductions, Change Healthcare cyberattack response actions, increased medical costs and changes in working capital accounts. Other significant changes in sources or uses of cash year-over-year included increased net issuances of short-term borrowings and long-term debt, net sales and maturities of investments and cash received from dispositions, offset by loans to care providers in response to the Change Healthcare cyberattack, increased cash paid for acquisitions and other transactions, decreased customer funds administered and increased share repurchases.\nTITLE: Financial Condition\nTEXT: As of December 31, 2024, our cash, cash equivalent, available-for-sale debt securities and equity securities balances of $77.1 billion included $25.3 billion of cash and cash equivalents (of which approximately $800 million was available for general corporate use), $46.9 billion of debt securities and $4.9 billion of equity securities. Given the significant portion of our portfolio held in cash equivalents, we do not anticipate fluctuations in the aggregate fair value of our financial assets to have a material impact on our liquidity or capital position. Other sources of liquidity, primarily from operating cash flows and our commercial paper program, which is fully supported by our bank credit facilities, reduce the need to sell investments during adverse market conditions. See Note 4 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” for further detail concerning our fair value measurements.\nTEXT: Our available-for-sale debt portfolio had a weighted-average duration of 4.2 years and a weighted-average credit rating of “Double A” as of December 31, 2024. When multiple credit ratings are available for an individual security, the average of the available ratings is used to determine the weighted-average credit rating.\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nterm, long, financial, statements, cash, debt, obligations, consolidated, liabilities, other\n\nTITLE: Capital Resources and Uses of Liquidity\nTEXT: Cash Requirements. The Company’s cash requirements within the next twelve months include medical costs payable, accounts payable and accrued liabilities, short-term borrowings and current maturities of long-term debt, other current liabilities, and purchase commitments and other obligations. We expect the cash required to meet these obligations to be primarily generated through cash flows from current operations; cash available for general corporate use; and the realization of current assets, such as accounts receivable.\nTEXT: Our long-term cash requirements under our various contractual obligations and commitments include:\nTEXT: •Debt obligations. See Note 8 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” for further detail of our long-term debt and the timing of expected future payments. Interest coupon payments are typically paid semi-annually.\nTEXT: •Operating leases. See Note 12 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” for further detail of our obligations and the timing of expected future payments.\nTEXT: •Purchase and other obligations. These include $11.5 billion, $2.4 billion of which is expected to be paid within the next twelve months, of fixed or minimum commitments under existing purchase obligations for goods and services, including agreements cancelable with the payment of an early termination penalty, and remaining capital commitments for venture capital funds, strategic transactions and other funding commitments. These amounts exclude agreements cancelable without penalty and liabilities to the extent recorded in our Consolidated Balance Sheets as of December 31, 2024.\nTEXT: •Other liabilities. These include other long-term liabilities reflected in our Consolidated Balance Sheets as of December 31, 2024, including obligations associated with certain employee benefit programs, unrecognized tax benefits and various long-term liabilities, which have some inherent uncertainty in the timing of these payments.\nTEXT: •Redeemable noncontrolling interests. See Note 2 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” for further detail. We do not have any material potential required redemptions in the next twelve months.\nTEXT: We expect the cash required to meet our long-term obligations to be primarily generated through future cash flows from operations. However, we also have the ability to generate cash to satisfy both our current and long-term requirements through the issuance of commercial paper, issuance of long-term debt, or drawing under our committed credit facilities or the ability to sell investments. We believe our capital resources are sufficient to meet future, short-term and long-term, liquidity needs.\nTEXT: Short-Term Borrowings. Our revolving bank credit facilities provide liquidity support for our commercial paper borrowing program, which facilitates the private placement of senior unsecured debt through independent broker-dealers, and are available for general corporate purposes. For more information on our commercial paper and bank credit facilities, see Note 8 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nTEXT: As of December 31, 2024, we were in compliance with the various covenants under our bank credit facilities.\nTEXT: Long-Term Debt. Periodically, we access capital markets to issue long-term debt for general corporate purposes, such as to meet our working capital requirements, to refinance debt, to finance acquisitions or for share repurchases. For more information on our debt, see Note 8 of the Notes to the Consolidated Financial Statements included in Part II, Item 8 “Financial Statements and Supplementary Data.”\nTEXT: Credit Ratings. Our credit ratings as of December 31, 2024 were as follows: Moody’sS&P GlobalFitchA.M. Best RatingsOutlookRatingsOutlookRatingsOutlookRatingsOutlookSenior unsecured debtA2StableA+StableAStableAStableCommercial paperP-1n/aA-1n/aF1n/aAMB-1+n/a\nTABLE: TABLE: Moody’s S&P Global Fitch A.M. Best; Ratings Outlook Ratings Outlook Ratings Outlook Ratings Outlook; Senior unsecured debt A2 Stable A+ Stable A Stable A Stable; Commercial paper P-1 n/a A-1 n/a F1 n/a AMB-1+ n/a.\nTITLE: Moody’sS&P GlobalFitchA.M. Best\nTITLE: Moody’s\nTITLE: S&P Global\nTITLE: Fitch\nTITLE: A.M. Best\nTITLE: RatingsOutlookRatingsOutlookRatingsOutlookRatingsOutlook\nTITLE: Ratings\nTITLE: Outlook\nTITLE: Ratings\nTITLE: Outlook\nTITLE: Ratings\nTITLE: Outlook\nTITLE: Ratings\n"
    },
    {
      "cluster": 9,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nmedical, costs, factors, estimates, which, estimate, program, payable, period, claim\n\nTITLE: Outlook\nTEXT: The availability of financing in the form of debt or equity is influenced by many factors, including our profitability, operating cash flows, debt levels, credit ratings, debt covenants and other contractual restrictions, regulatory requirements and economic and market conditions. A significant downgrade in our credit ratings or adverse conditions in the capital markets may increase the cost of borrowing for us or limit our access to capital.\nTEXT: Share Repurchase Program. In June 2024, our Board of Directors amended our share repurchase program to authorize the repurchase of up to 35 million shares of Common Stock, in addition to all remaining shares authorized to be repurchased under the Board’s 2018 renewal of the program. As of December 31, 2024, we had Board of Directors’ authorization to purchase up to 33 million shares of our common stock. The Board of Directors from time to time may further amend the share repurchase program in order to increase the authorized number of shares which may be repurchased under the program. For more information on our share repurchase program, see Note 10 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nTEXT: Dividends. In June 2024, our Board of Directors increased the Company’s quarterly cash dividend to shareholders to an annual rate of $8.40 compared to $7.52 per share. For more information on our dividend, see Note 10 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nTEXT: Pending Acquisitions. As of December 31, 2024, we have entered into agreements to acquire companies in the health care sector, subject to regulatory approval and other customary closing conditions. The total anticipated capital required for these acquisitions, excluding the payoff of acquired indebtedness, is approximately $4 billion.\nTEXT: We do not have other significant contractual obligations or commitments requiring cash resources. However, we continually evaluate opportunities to expand our operations, which include internal development of new products, programs and technology applications and may include acquisitions.\nTITLE: CRITICAL ACCOUNTING ESTIMATES\nTEXT: Critical accounting estimates are those estimates requiring management to make challenging, subjective or complex judgments, often because they must estimate the effects of matters inherently uncertain and may change in subsequent periods. Critical accounting estimates involve judgments and uncertainties which are sufficiently sensitive and may result in materially different results under different assumptions and conditions.\nTITLE: Medical Costs Payable\nTEXT: Medical costs and medical costs payable include estimates of our obligations for medical care services rendered on behalf of consumers, but for which claims have either not yet been received or processed. Depending on the health care professional and type of service, the typical billing lag for services can be up to 90 days from the date of service. Approximately 90% of claims related to medical care services are known and settled within 90 days from the date of service.\nTEXT: In each reporting period, our operating results include the effects of more completely developed medical costs payable estimates associated with previously reported periods. If the revised estimate of prior period medical costs is less than the previous estimate, we will decrease reported medical costs in the current period (favorable development). If the revised estimate of prior period medical costs is more than the previous estimate, we will increase reported medical costs in the current period (unfavorable development). Medical costs in 2024, 2023 and 2022 included favorable medical cost development related to prior years of $700 million, $840 million and $410 million, respectively.\nTEXT: In developing our medical costs payable estimates, we apply different estimation methods depending on the month for which incurred claims are being estimated. For example, for the most recent two months, we estimate claim costs incurred by applying observed medical cost trend factors to the average per member per month (PMPM) medical costs incurred in prior months for which more complete claim data is available, supplemented by a review of near-term completion factors.\nTEXT: Completion Factors. A completion factor is an actuarial estimate, based upon historical experience and analysis of current trends, of the percentage of incurred claims during a given period adjudicated by us at the date of estimation. Completion factors are the most significant factors we use in developing our medical costs payable estimates for periods prior to the most recent two months. Completion factors include judgments in relation to claim submissions such as the time from date of service to claim receipt, claim levels and processing cycles, as well as other factors. If actual claims submission rates from providers (which can be influenced by a number of factors, including provider mix and electronic versus manual submissions), actual care activity incurred (which can be influenced by pandemics or seasonal illnesses, such as influenza), or our claim processing patterns are different than estimated, our reserve estimates may be significantly impacted.\nTEXT: The following table illustrates the sensitivity of these factors and the estimated potential impact on our medical costs payable estimates for those periods as of December 31, 2024: Completion Factors(Decrease) Increase in FactorsIncrease (Decrease)In Medical Costs Payable(in millions)(0.75)%$973 (0.50)647 (0.25)322 0.25(321)0.50(640)0.75(958)\nTABLE: TABLE: Completion Factors(Decrease) Increase in Factors Increase (Decrease)In Medical Costs Payable; (0.75)% $ 973; (0.50) 647; (0.25) 322; 0.25 (321); 0.50 (640); 0.75 (958).\n"
    },
    {
      "cluster": 10,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nmedical, factors, costs, cost, payable, estimates, trend, pmpm, months, claims\n\nTITLE: Completion Factors(Decrease) Increase in FactorsIncrease (Decrease)In Medical Costs Payable\nTITLE: Completion Factors(Decrease) Increase in Factors\nTITLE: Increase (Decrease)In Medical Costs Payable\nTITLE: (in millions)\nTEXT: Medical Cost Per Member Per Month Trend Factors. Medical cost PMPM trend factors are significant factors we use in developing our medical costs payable estimates for the most recent two months. Medical cost trend factors are developed through a comprehensive analysis of claims incurred in prior months, provider contracting and expected unit costs, benefit design and a review of a broad set of health care utilization indicators. These factors include but are not limited to pharmacy utilization trends, inpatient hospital authorization data and seasonal and other incidence data from the National Centers for Disease Control. We also consider macroeconomic variables such as GDP growth, employment and disposable income. A large number of factors can cause the medical cost trend to vary from our estimates, including: our ability and practices to manage medical and pharmaceutical costs, changes in level and mix of services utilized; mix of benefits offered, including the impact of co-pays and deductibles; changes in medical practices; and catastrophes, epidemics and pandemics.\nTEXT: The following table illustrates the sensitivity of these factors and the estimated potential impact on our medical costs payable estimates for the most recent two months as of December 31, 2024: Medical Cost PMPM Quarterly TrendIncrease (Decrease) in FactorsIncrease (Decrease)In Medical Costs Payable(in millions)3%$1,264 2843 1421 (1)(421)(2)(843)(3)(1,264)\nTABLE: TABLE: Medical Cost PMPM Quarterly TrendIncrease (Decrease) in Factors Increase (Decrease)In Medical Costs Payable; 3% $ 1,264; 2 843; 1 421; (1) (421); (2) (843); (3) (1,264).\nTITLE: Medical Cost PMPM Quarterly TrendIncrease (Decrease) in FactorsIncrease (Decrease)In Medical Costs Payable\nTITLE: Medical Cost PMPM Quarterly TrendIncrease (Decrease) in Factors\nTITLE: Increase (Decrease)In Medical Costs Payable\nTITLE: (in millions)\nTEXT: The completion factors and medical costs PMPM trend factors analyses above include outcomes considered reasonably likely based on our historical experience estimating liabilities for incurred but not reported benefit claims.\nTEXT: Management believes the amount of medical costs payable is reasonable and adequate to cover our liability for unpaid claims as of December 31, 2024; however, actual claim payments may differ from established estimates as discussed above. Assuming a hypothetical 1% difference between our December 31, 2024 estimates of medical costs payable and actual medical costs payable, 2024 net earnings would have increased or decreased by approximately $260 million.\nTEXT: For more detail related to our medical cost estimates, see Note 2 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\n"
    },
    {
      "cluster": 11,
      "content": "ITEM 7:\nCLUSTER SUMMARY (KEYWORDS):\nreporting, unit, goodwill, impairment, carrying, value, factors, financial, units, rates\n\nTITLE: Goodwill\nTEXT: We evaluate goodwill for impairment annually or more frequently when an event occurs or circumstances change indicating the carrying value may not be recoverable. When testing goodwill for impairment, we may first assess qualitative factors to determine if it is more likely than not the carrying value of a reporting unit exceeds its estimated fair value. During a qualitative analysis, we consider the impact of changes, if any, to the following factors: macroeconomic, industry and market factors; cost factors; changes in overall financial performance; and any other relevant events and uncertainties impacting a reporting unit. If our qualitative assessment indicates a goodwill impairment is more likely than not, we perform additional quantitative analyses. We may also elect to skip the qualitative testing and proceed directly to the quantitative testing. For reporting units where a quantitative analysis is performed, we perform a test measuring the fair values of the reporting units and comparing them to their carrying values, including goodwill. If the fair value is less than the carrying value of the reporting unit, an impairment is recognized for the difference, up to the carrying amount of goodwill.\nTEXT: We estimate the fair values of our reporting units using a discounted cash flow method which includes assumptions about a wide variety of internal and external factors. Significant assumptions used in the discounted cash flow method include financial projections of free cash flow, including revenue trends, medical costs trends, operating productivity, income taxes and capital levels; long-term growth rates for determining terminal value beyond the discretely forecasted periods; and discount rates. For each reporting unit, comparative market multiples are used to corroborate the results of our discounted cash flow test.\nTEXT: Financial projections and long-term growth rates used for our reporting units are consistent with, and use inputs from, our internal long-term business plan and strategies. Discount rates are determined for each reporting unit and include consideration of the implied risk inherent in their forecasts. Our most significant estimate in the discount rate determinations involves our adjustments to the peer company weighted average costs of capital reflecting reporting unit-specific factors. We have not made any adjustments to decrease a discount rate below the calculated peer company weighted average cost of capital for any reporting unit. Company-specific adjustments to discount rates are subjective and thus are difficult to measure with certainty. The passage of time and the availability of additional information regarding areas of uncertainty with respect to the reporting units’ operations could cause these assumptions to change in the future. Additionally, as part of our quantitative impairment testing, we perform various sensitivity analyses on certain key assumptions, such as discount rates and cash flow projections to analyze the potential for a material impact. As of October 1, 2024, we completed our annual impairment tests for goodwill with all of our reporting units having fair values substantially in excess of their carrying values.\nTITLE: LEGAL MATTERS\nTEXT: A description of our legal proceedings is presented in Note 12 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nTITLE: CONCENTRATIONS OF CREDIT RISK\nTEXT: Investments in financial instruments such as marketable securities and accounts receivable may subject us to concentrations of credit risk. Our investments in marketable securities are managed under an investment policy authorized by our Board of Directors. This policy limits the amounts which may be invested in any one issuer and generally limits our investments to U.S. government and agency securities, state and municipal securities and corporate debt obligations of investment grade. Concentrations of credit risk with respect to accounts receivable are limited due to the large number of employer groups and other customers constituting our client base. As of December 31, 2024, there were no significant concentrations of credit risk.\n"
    }
  ],
  "item8": [
    {
      "cluster": 1,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nstatements, financial, company, consolidated, audit, accounting, opinion, pcaob, december, audits\n\nTEXT: Financial Statements and Supplementary Data\nTABLE: TABLE: Report of Independent Registered Public Accounting Firm (PCAOB ID No 34) 38; Consolidated Balance Sheets 40; Consolidated Statements of Operations 41; Consolidated Statements of Comprehensive Income 42; Consolidated Statements of Changes in Equity 43; Consolidated Statements of Cash Flows 44; Notes to the Consolidated Financial Statements 45; 1. Description of Business 45; 2. Basis of Presentation, Use of Estimates and Significant Accounting Policies 45; 3. Investments 50; 4. Fair Value 51; 5. Property, Equipment and Capitalized Software 54; 6. Goodwill and Other Intangible Assets 54; 7. Medical Costs Payable 55; 8. Short-Term Borrowings and Long-Term Debt 57; 9. Income Taxes 58; 10. Shareholders’ Equity 60; 11. Share-Based Compensation 61; 12. Commitments and Contingencies 63; 13. Dispositions and Held for Sale 64; 14. Segment Financial Information 65.\nTITLE: Page\nTEXT: Report of Independent Registered Public Accounting Firm (PCAOB ID No 34)\nTEXT: Consolidated Statements of Operations\nTEXT: Consolidated Statements of Comprehensive Income\nTEXT: Consolidated Statements of Changes in Equity\nTEXT: Consolidated Statements of Cash Flows\nTEXT: Notes to the Consolidated Financial Statements\nTEXT: 2. Basis of Presentation, Use of Estimates and Significant Accounting Policies\nTEXT: 5. Property, Equipment and Capitalized Software\nTEXT: 6. Goodwill and Other Intangible Assets\nTEXT: 8. Short-Term Borrowings and Long-Term Debt\nTEXT: 12. Commitments and Contingencies\nTEXT: 13. Dispositions and Held for Sale\nTEXT: 14. Segment Financial Information\nTITLE: REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTEXT: To the shareholders and the Board of Directors of UnitedHealth Group Incorporated and Subsidiaries:\nTITLE: Opinion on the Financial Statements\nTEXT: We have audited the accompanying consolidated balance sheets of UnitedHealth Group Incorporated and Subsidiaries (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, changes in equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\nTEXT: We have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 27, 2025 expressed an unqualified opinion on the Company’s internal control over financial reporting.\nTITLE: Basis for Opinion\nTEXT: These financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nTEXT: We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nTITLE: Critical Audit Matter\nTEXT: The critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the Audit and Finance Committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n"
    },
    {
      "cluster": 2,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nmanagement, medical, services, ibnr, estimate, care, claims, actuarial, audit, data\n\nTITLE: Medical Care Services Incurred but not Reported (IBNR) - Refer to Notes 2 and 7 to the financial statements.\nTEXT: Critical Audit Matter Description\nTEXT: Medical costs payable includes estimates of the Company’s obligations for medical care services rendered on behalf of insured consumers, for which claims have either not yet been received or processed. The Company develops estimates for medical care services incurred but not reported (IBNR) using an actuarial model that requires management to exercise certain judgments in developing its estimates. Judgments made by management include medical cost per member per month trend factors and completion factors, which include assumptions over the time from date of service to claim receipt, the impact of actual care activity, and processing cycles.\nTEXT: We identified medical care services IBNR as a critical audit matter because it requires significant management assumptions in estimating the liability. This required complex auditor judgment, and an increased extent of effort, including the involvement of actuarial specialists in performing procedures to evaluate the reasonableness of management’s methods, assumptions, and judgments in developing estimates for medical care services IBNR.\nTEXT: How the Critical Audit Matter Was Addressed in the Audit\nTEXT: Our audit procedures related to medical care services IBNR included the following, among others:\nTEXT: •We tested the effectiveness of controls over management’s estimate of the IBNR for these services, including controls over the judgments in both the completion factors and the medical cost per member per month trend factors, as well as controls over the claims and membership data used in the estimation process.\nTEXT: •We tested the underlying claims and membership data and other information that served as the basis for the actuarial analysis, to test that the inputs to the actuarial estimate were complete and accurate.\nTEXT: •With the assistance of actuarial specialists, we evaluated the reasonableness of the actuarial methods and assumptions used by management to estimate IBNR for these services by:\nTEXT: –Performing an overlay of the historical claims data used in management’s current year model to the data used in prior periods to validate that there were no material changes to the claims data tested in prior periods.\nTEXT: –Developing an independent estimate of the IBNR for these services and comparing our estimate to management’s estimate.\nTEXT: –Performing a retrospective review comparing management’s prior year estimate of IBNR to claims processed in 2024 with dates of service in 2023 or prior.\nTEXT: /S/ DELOITTE & TOUCHE LLPMinneapolis, MinnesotaFebruary 27, 2025\nTABLE: TABLE: .\nTEXT: We have served as the Company's auditor since 2002.\n"
    },
    {
      "cluster": 3,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nother, assets, current, liabilities, total, shares, term, accumulated, noncontrolling, interests\n\nTITLE: UnitedHealth Group\nTEXT: Consolidated Balance Sheets(in millions, except per share data)December 31,2024December 31,2023AssetsCurrent assets:Cash and cash equivalents$25,312 $25,427 Short-term investments3,801 4,201 Accounts receivable, net of allowances of $985 and $1,00022,365 21,276 Other current receivables, net of allowances of $2,864 and $2,08426,089 17,694 Assets under management— 3,755 Prepaid expenses and other current assets8,212 6,084 Total current assets85,779 78,437 Long-term investments52,354 47,609 Property, equipment and capitalized software, net of accumulated depreciation and amortization of $6,971 and $7,03910,553 11,450 Goodwill106,734 103,732 Other intangible assets, net of accumulated amortization of $8,350 and $7,27923,268 15,194 Other assets19,590 17,298 Total assets$298,278 $273,720 Liabilities, redeemable noncontrolling interests and equityCurrent liabilities:Medical costs payable$34,224 $32,395 Accounts payable and accrued liabilities34,337 31,958 Short-term borrowings and current maturities of long-term debt4,545 4,274 Unearned revenues3,317 3,355 Other current liabilities27,346 27,072 Total current liabilities103,769 99,054 Long-term debt, less current maturities72,359 58,263 Deferred income taxes3,620 3,021 Other liabilities15,939 14,463 Total liabilities195,687 174,801 Commitments and contingencies (Note 12)Redeemable noncontrolling interests4,323 4,498 Equity:Preferred stock, $0.001 par value - 10 shares authorized; no shares issued or outstanding— — Common stock, $0.01 par value - 3,000 shares authorized; 915 and 924 issued and outstanding9 9 Retained earnings96,036 95,774 Accumulated other comprehensive loss(3,387)(7,027)Nonredeemable noncontrolling interests5,610 5,665 Total equity98,268 94,421 Total liabilities, redeemable noncontrolling interests and equity$298,278 $273,720\nTABLE: TABLE: (in millions, except per share data) December 31,2024 December 31,2023; Cash and cash equivalents $ 25,312 $ 25,427; Short-term investments 3,801 4,201; Accounts receivable, net of allowances of $985 and $1,000 22,365 21,276; Other current receivables, net of allowances of $2,864 and $2,084 26,089 17,694; Assets under management — 3,755; Prepaid expenses and other current assets 8,212 6,084; Total current assets 85,779 78,437; Long-term investments 52,354 47,609; Property, equipment and capitalized software, net of accumulated depreciation and amortization of $6,971 and $7,039 10,553 11,450; Goodwill 106,734 103,732; Other intangible assets, net of accumulated amortization of $8,350 and $7,279 23,268 15,194; Other assets 19,590 17,298; Total assets $ 298,278 $ 273,720; Medical costs payable $ 34,224 $ 32,395; Accounts payable and accrued liabilities 34,337 31,958; Short-term borrowings and current maturities of long-term debt 4,545 4,274; Unearned revenues 3,317 3,355; Other current liabilities 27,346 27,072; Total current liabilities 103,769 99,054; Long-term debt, less current maturities 72,359 58,263; Deferred income taxes 3,620 3,021; Other liabilities 15,939 14,463; Total liabilities 195,687 174,801; Redeemable noncontrolling interests 4,323 4,498; Preferred stock, $0.001 par value - 10 shares authorized; no shares issued or outstanding — —; Common stock, $0.01 par value - 3,000 shares authorized; 915 and 924 issued and outstanding 9 9; Retained earnings 96,036 95,774; Accumulated other comprehensive loss (3,387) (7,027); Nonredeemable noncontrolling interests 5,610 5,665; Total equity 98,268 94,421; Total liabilities, redeemable noncontrolling interests and equity $ 298,278 $ 273,720.\nTITLE: (in millions, except per share data)December 31,2024December 31,2023\nTITLE: (in millions, except per share data)\nTITLE: December 31,2024\nTITLE: December 31,2023\nTITLE: Assets\nTEXT: Accounts receivable, net of allowances of $985 and $1,000\nTEXT: Other current receivables, net of allowances of $2,864 and $2,084\nTEXT: Property, equipment and capitalized software, net of accumulated depreciation and amortization of $6,971 and $7,039\nTEXT: Other intangible assets, net of accumulated amortization of $8,350 and $7,279\nTITLE: Total assets$298,278 $273,720\nTITLE: Total assets\nTITLE: Liabilities, redeemable noncontrolling interests and equity\nTEXT: Commitments and contingencies (Note 12)\nTEXT: Preferred stock, $0.001 par value - 10 shares authorized; no shares issued or outstanding\nTEXT: Common stock, $0.01 par value - 3,000 shares authorized; 915 and 924 issued and outstanding\nTEXT: Nonredeemable noncontrolling interests\nTITLE: Total liabilities, redeemable noncontrolling interests and equity$298,278 $273,720\nTITLE: Total liabilities, redeemable noncontrolling interests and equity\nTEXT: See Notes to the Consolidated Financial Statements\n"
    },
    {
      "cluster": 4,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, earnings, common, share, total, attributable, dilutive, effect, comprehensive, gains\n\nTITLE: UnitedHealth Group\nTEXT: Consolidated Statements of Operations For the Years Ended December 31,(in millions, except per share data)202420232022Revenues:Premiums$308,810 $290,827 $257,157 Products50,226 42,583 37,424 Services36,040 34,123 27,551 Investment and other income5,202 4,089 2,030 Total revenues400,278 371,622 324,162 Operating costs:Medical costs264,185 241,894 210,842 Operating costs53,013 54,628 47,782 Cost of products sold46,694 38,770 33,703 Depreciation and amortization4,099 3,972 3,400 Total operating costs367,991 339,264 295,727 Earnings from operations32,287 32,358 28,435 Interest expense(3,906)(3,246)(2,092)Loss on sale of subsidiary and subsidiaries held for sale(8,310)— — Earnings before income taxes20,071 29,112 26,343 Provision for income taxes(4,829)(5,968)(5,704)Net earnings15,242 23,144 20,639 Earnings attributable to noncontrolling interests(837)(763)(519)Net earnings attributable to UnitedHealth Group common shareholders$14,405 $22,381 $20,120 Earnings per share attributable to UnitedHealth Group common shareholders:Basic$15.64 $24.12 $21.47 Diluted$15.51 $23.86 $21.18 Basic weighted-average number of common shares outstanding921 928 937 Dilutive effect of common share equivalents8 10 13 Diluted weighted-average number of common shares outstanding929 938 950 Anti-dilutive shares excluded from the calculation of dilutive effect of common share equivalents6 6 3\nTABLE: TABLE: (in millions, except per share data) 2024 2023 2022; Premiums $ 308,810 $ 290,827 $ 257,157; Products 50,226 42,583 37,424; Services 36,040 34,123 27,551; Investment and other income 5,202 4,089 2,030; Total revenues 400,278 371,622 324,162; Medical costs 264,185 241,894 210,842; Operating costs 53,013 54,628 47,782; Cost of products sold 46,694 38,770 33,703; Depreciation and amortization 4,099 3,972 3,400; Total operating costs 367,991 339,264 295,727; Earnings from operations 32,287 32,358 28,435; Interest expense (3,906) (3,246) (2,092); Loss on sale of subsidiary and subsidiaries held for sale (8,310) — —; Earnings before income taxes 20,071 29,112 26,343; Provision for income taxes (4,829) (5,968) (5,704); Net earnings 15,242 23,144 20,639; Earnings attributable to noncontrolling interests (837) (763) (519); Net earnings attributable to UnitedHealth Group common shareholders $ 14,405 $ 22,381 $ 20,120; Basic $ 15.64 $ 24.12 $ 21.47; Diluted $ 15.51 $ 23.86 $ 21.18; Basic weighted-average number of common shares outstanding 921 928 937; Dilutive effect of common share equivalents 8 10 13; Diluted weighted-average number of common shares outstanding 929 938 950; Anti-dilutive shares excluded from the calculation of dilutive effect of common share equivalents 6 6 3.\nTITLE: For the Years Ended December 31,\nTITLE: (in millions, except per share data)202420232022\nTITLE: (in millions, except per share data)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Revenues:\nTITLE: Operating costs:\nTITLE: Earnings from operations32,287 32,358 28,435\nTITLE: Earnings from operations\nTITLE: Earnings before income taxes20,071 29,112 26,343\nTITLE: Earnings before income taxes\nTITLE: Net earnings15,242 23,144 20,639\nTITLE: Net earnings\nTITLE: Net earnings attributable to UnitedHealth Group common shareholders$14,405 $22,381 $20,120\nTITLE: Net earnings attributable to UnitedHealth Group common shareholders\nTITLE: Earnings per share attributable to UnitedHealth Group common shareholders:\nTITLE: Basic weighted-average number of common shares outstanding921 928 937\nTITLE: Basic weighted-average number of common shares outstanding\nTITLE: Dilutive effect of common share equivalents8 10 13\nTITLE: Dilutive effect of common share equivalents\nTITLE: Diluted weighted-average number of common shares outstanding929 938 950\nTITLE: Diluted weighted-average number of common shares outstanding\nTEXT: Anti-dilutive shares excluded from the calculation of dilutive effect of common share equivalents\nTEXT: See Notes to the Consolidated Financial Statements\nTITLE: UnitedHealth Group\nTITLE: Consolidated Statements of Comprehensive Income\nTEXT: For the Years Ended December 31,(in millions)202420232022Net earnings$15,242 $23,144 $20,639 Other comprehensive income (loss):Gross unrealized gains (losses) on investment securities during the period29 1,139 (4,292)Income tax effect(7)(263)984 Total unrealized gains (losses), net of tax22 876 (3,308)Gross reclassification adjustment for net realized (gains) losses included in net earnings(369)(90)139 Income tax effect92 21 (32)Total reclassification adjustment, net of tax(277)(69)107 Foreign currency translation (losses) gains(319)559 192 Reclassification adjustment for translation losses included in net earnings4,214 — — Total foreign currency translation gains3,895 559 192 Other comprehensive income (loss)3,640 1,366 (3,009)Comprehensive income18,882 24,510 17,630 Comprehensive income attributable to noncontrolling interests(837)(763)(519)Comprehensive income attributable to UnitedHealth Group common shareholders$18,045 $23,747 $17,111\nTABLE: TABLE: (in millions) 2024 2023 2022; Net earnings $ 15,242 $ 23,144 $ 20,639; Gross unrealized gains (losses) on investment securities during the period 29 1,139 (4,292); Income tax effect (7) (263) 984; Total unrealized gains (losses), net of tax 22 876 (3,308); Gross reclassification adjustment for net realized (gains) losses included in net earnings (369) (90) 139; Income tax effect 92 21 (32); Total reclassification adjustment, net of tax (277) (69) 107; Foreign currency translation (losses) gains (319) 559 192; Reclassification adjustment for translation losses included in net earnings 4,214 — —; Total foreign currency translation gains 3,895 559 192; Other comprehensive income (loss) 3,640 1,366 (3,009); Comprehensive income 18,882 24,510 17,630; Comprehensive income attributable to noncontrolling interests (837) (763) (519); Comprehensive income attributable to UnitedHealth Group common shareholders $ 18,045 $ 23,747 $ 17,111.\n"
    },
    {
      "cluster": 5,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nnoncontrolling, interests, other, share, common, adjustments, nonredeemable, comprehensive, income, paid\n\nTITLE: For the Years Ended December 31,\nTITLE: (in millions)202420232022\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Net earnings$15,242 $23,144 $20,639\nTITLE: Net earnings\nTEXT: Total reclassification adjustment, net of tax\nTEXT: Comprehensive income attributable to noncontrolling interests\nTITLE: Comprehensive income attributable to UnitedHealth Group common shareholders$18,045 $23,747 $17,111\nTITLE: Comprehensive income attributable to UnitedHealth Group common shareholders\nTEXT: See Notes to the Consolidated Financial Statements\nTITLE: UnitedHealth Group\nTEXT: Consolidated Statements of Changes in EquityCommon StockAdditional Paid-In CapitalRetained EarningsAccumulated Other Comprehensive Income (Loss) NonredeemableNoncontrolling InterestsTotalEquity(in millions, except per share data)SharesAmountNet Unrealized Gains (Losses) on InvestmentsForeign Currency Translation (Losses) GainsBalance at January 1, 2022941 $10 $— $77,134 $423 $(5,807)$3,285 $75,045 Net earnings 20,120 406 20,526 Other comprehensive (loss) income(3,201)192 (3,009)Issuances of common stock, and related tax effects7 — 903 903 Share-based compensation875 875 Common share repurchases(14)(1)(1,892)(5,107)(7,000)Cash dividends paid on common shares ($6.40 per share)(5,991)(5,991)Redeemable noncontrolling interests fair value and other adjustments114 114 Acquisition and other adjustments of nonredeemable noncontrolling interests374 374 Distributions to nonredeemable noncontrolling interests(387)(387)Balance at December 31, 2022934 9 — 86,156 (2,778)(5,615)3,678 81,450 Net earnings 22,381 575 22,956 Other comprehensive income807 559 1,366 Issuances of common stock, and related tax effects6 — 1,231 1,231 Share-based compensation1,027 1,027 Common share repurchases(16)— (2,057)(6,002)(8,059)Cash dividends paid on common shares ($7.29 per share)(6,761)(6,761)Redeemable noncontrolling interests fair value and other adjustments(201)(201)Acquisition and other adjustments of nonredeemable noncontrolling interests 1,928 1,928 Distributions to nonredeemable noncontrolling interests(516)(516)Balance at December 31, 2023924 9 — 95,774 (1,971)(5,056)5,665 94,421 Net earnings 14,405 663 15,068 Other comprehensive (loss) income(255)3,895 3,640 Issuances of common stock, and related tax effects8 — 1,485 1,485 Share-based compensation963 963 Common share repurchases(17)— (2,395)(6,610)(9,005)Cash dividends paid on common shares ($8.18 per share)(7,533)(7,533)Redeemable noncontrolling interests fair value and other adjustments(53)(53)Acquisition and other adjustments of nonredeemable noncontrolling interests 26 26 Distributions to nonredeemable noncontrolling interests(744)(744)Balance at December 31, 2024915 $9 $— $96,036 $(2,226)$(1,161)$5,610 $98,268\nTABLE: TABLE: Common Stock Additional Paid-In Capital Retained Earnings Accumulated Other Comprehensive Income (Loss) NonredeemableNoncontrolling Interests TotalEquity; (in millions, except per share data) Shares Amount Net Unrealized Gains (Losses) on Investments Foreign Currency Translation (Losses) Gains; Balance at January 1, 2022 941 $ 10 $ — $ 77,134 $ 423 $ (5,807) $ 3,285 $ 75,045; Net earnings 20,120 406 20,526; Other comprehensive (loss) income (3,201) 192 (3,009); Issuances of common stock, and related tax effects 7 — 903 903; Share-based compensation 875 875; Common share repurchases (14) (1) (1,892) (5,107) (7,000); Cash dividends paid on common shares ($6.40 per share) (5,991) (5,991); Redeemable noncontrolling interests fair value and other adjustments 114 114; Acquisition and other adjustments of nonredeemable noncontrolling interests 374 374; Distributions to nonredeemable noncontrolling interests (387) (387); Balance at December 31, 2022 934 9 — 86,156 (2,778) (5,615) 3,678 81,450; Net earnings 22,381 575 22,956; Other comprehensive income 807 559 1,366; Issuances of common stock, and related tax effects 6 — 1,231 1,231; Share-based compensation 1,027 1,027; Common share repurchases (16) — (2,057) (6,002) (8,059); Cash dividends paid on common shares ($7.29 per share) (6,761) (6,761); Redeemable noncontrolling interests fair value and other adjustments (201) (201); Acquisition and other adjustments of nonredeemable noncontrolling interests 1,928 1,928; Distributions to nonredeemable noncontrolling interests (516) (516); Balance at December 31, 2023 924 9 — 95,774 (1,971) (5,056) 5,665 94,421; Net earnings 14,405 663 15,068; Other comprehensive (loss) income (255) 3,895 3,640; Issuances of common stock, and related tax effects 8 — 1,485 1,485; Share-based compensation 963 963; Common share repurchases (17) — (2,395) (6,610) (9,005); Cash dividends paid on common shares ($8.18 per share) (7,533) (7,533); Redeemable noncontrolling interests fair value and other adjustments (53) (53); Acquisition and other adjustments of nonredeemable noncontrolling interests 26 26; Distributions to nonredeemable noncontrolling interests (744) (744); Balance at December 31, 2024 915 $ 9 $ — $ 96,036 $ (2,226) $ (1,161) $ 5,610 $ 98,268.\nTITLE: Common Stock\nTITLE: Additional Paid-In Capital\nTITLE: Retained Earnings\nTITLE: Accumulated Other Comprehensive Income (Loss)\nTITLE: NonredeemableNoncontrolling Interests\nTITLE: TotalEquity\nTITLE: (in millions, except per share data)SharesAmountNet Unrealized Gains (Losses) on InvestmentsForeign Currency Translation (Losses) Gains\nTITLE: (in millions, except per share data)\nTITLE: Shares\nTITLE: Amount\nTITLE: Net Unrealized Gains (Losses) on Investments\n"
    },
    {
      "cluster": 6,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncash, other, common, paid, noncontrolling, interests, share, equivalents, issuances, stock\n\nTITLE: Foreign Currency Translation (Losses) Gains\nTEXT: Issuances of common stock, and related tax effects\nTEXT: Cash dividends paid on common shares ($6.40 per share)\nTEXT: Acquisition and other adjustments of nonredeemable noncontrolling interests\nTEXT: Issuances of common stock, and related tax effects\nTEXT: Cash dividends paid on common shares ($7.29 per share)\nTEXT: Acquisition and other adjustments of nonredeemable noncontrolling interests\nTEXT: Issuances of common stock, and related tax effects\nTEXT: Cash dividends paid on common shares ($8.18 per share)\nTEXT: Redeemable noncontrolling interests fair value and other adjustments\nTEXT: Acquisition and other adjustments of nonredeemable noncontrolling interests\nTEXT: Distributions to nonredeemable noncontrolling interests\nTEXT: See Notes to the Consolidated Financial Statements\nTITLE: UnitedHealth Group\nTEXT: Consolidated Statements of Cash Flows For the Years Ended December 31,(in millions)202420232022Operating activitiesNet earnings$15,242 $23,144 $20,639 Noncash items:Depreciation and amortization4,099 3,972 3,400 Deferred income taxes(296)(245)(673)Share-based compensation1,018 1,059 925 Loss on sale of subsidiary and subsidiaries held for sale8,310 — — Gains on dispositions and other strategic transactions(3,333)(489)(588)Other, net(28)(16)257 Net change in other operating items, net of effects from acquisitions and dispositions:Accounts receivable(1,437)(3,114)(2,523)Other assets(4,140)(2,444)(1,374)Medical costs payable2,503 3,482 4,053 Accounts payable and other liabilities2,463 3,516 1,964 Unearned revenues(197)203 126 Cash flows from operating activities24,204 29,068 26,206 Investing activitiesPurchases of investments(27,308)(18,314)(18,825)Sales of investments18,514 7,307 5,907 Maturities of investments9,319 9,230 6,081 Cash paid for acquisitions and other transactions, net of cash assumed(13,408)(10,136)(21,458)Purchases of property, equipment and capitalized software(3,499)(3,386)(2,802)Loans to care providers - cyberattack(9,033)— — Repayments of care provider loans - cyberattack4,514 — — Cash received from dispositions and other strategic transactions, net2,041 685 3,414 Other, net(1,667)(960)(793)Cash flows used for investing activities(20,527)(15,574)(28,476)Financing activitiesCommon share repurchases(9,000)(8,000)(7,000)Cash dividends paid(7,533)(6,761)(5,991)Proceeds from common stock issuances1,846 1,353 1,253 Repayments of long-term debt(3,000)(2,125)(3,015)(Repayments of) proceeds from short-term borrowings, net(151)11 732 Proceeds from issuance of long-term debt17,811 6,394 14,819 Customer funds administered(1,560)(521)5,548 Purchases of redeemable noncontrolling interests(280)(730)(176)Other, net(1,645)(1,150)(1,944)Cash flows (used for) from financing activities(3,512)(11,529)4,226 Effect of exchange rate changes on cash and cash equivalents(61)97 34 Increase in cash and cash equivalents, including cash within businesses held for sale104 2,062 1,990 Less: cash within businesses held for sale(219)— — Net (decrease) increase in cash and cash equivalents(115)2,062 1,990 Cash and cash equivalents, beginning of period25,427 23,365 21,375 Cash and cash equivalents, end of period$25,312 $25,427 $23,365 Supplemental cash flow disclosuresCash paid for interest$3,594 $3,035 $1,945 Cash paid for income taxes4,620 6,078 5,222\nTABLE: TABLE: (in millions) 2024 2023 2022; Net earnings $ 15,242 $ 23,144 $ 20,639; Depreciation and amortization 4,099 3,972 3,400; Deferred income taxes (296) (245) (673); Share-based compensation 1,018 1,059 925; Loss on sale of subsidiary and subsidiaries held for sale 8,310 — —; Gains on dispositions and other strategic transactions (3,333) (489) (588); Other, net (28) (16) 257; Accounts receivable (1,437) (3,114) (2,523); Other assets (4,140) (2,444) (1,374); Medical costs payable 2,503 3,482 4,053; Accounts payable and other liabilities 2,463 3,516 1,964; Unearned revenues (197) 203 126; Cash flows from operating activities 24,204 29,068 26,206; Purchases of investments (27,308) (18,314) (18,825); Sales of investments 18,514 7,307 5,907; Maturities of investments 9,319 9,230 6,081; Cash paid for acquisitions and other transactions, net of cash assumed (13,408) (10,136) (21,458); Purchases of property, equipment and capitalized software (3,499) (3,386) (2,802); Loans to care providers - cyberattack (9,033) — —; Repayments of care provider loans - cyberattack 4,514 — —; Cash received from dispositions and other strategic transactions, net 2,041 685 3,414; Other, net (1,667) (960) (793); Cash flows used for investing activities (20,527) (15,574) (28,476); Common share repurchases (9,000) (8,000) (7,000); Cash dividends paid (7,533) (6,761) (5,991); Proceeds from common stock issuances 1,846 1,353 1,253; Repayments of long-term debt (3,000) (2,125) (3,015); (Repayments of) proceeds from short-term borrowings, net (151) 11 732; Proceeds from issuance of long-term debt 17,811 6,394 14,819; Customer funds administered (1,560) (521) 5,548; Purchases of redeemable noncontrolling interests (280) (730) (176); Other, net (1,645) (1,150) (1,944); Cash flows (used for) from financing activities (3,512) (11,529) 4,226; Effect of exchange rate changes on cash and cash equivalents (61) 97 34; Increase in cash and cash equivalents, including cash within businesses held for sale 104 2,062 1,990; Less: cash within businesses held for sale (219) — —; Net (decrease) increase in cash and cash equivalents (115) 2,062 1,990; Cash and cash equivalents, beginning of period 25,427 23,365 21,375; Cash and cash equivalents, end of period $ 25,312 $ 25,427 $ 23,365; Cash paid for interest $ 3,594 $ 3,035 $ 1,945; Cash paid for income taxes 4,620 6,078 5,222.\nTITLE: For the Years Ended December 31,\nTITLE: (in millions)202420232022\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Operating activities\nTITLE: Investing activities\nTITLE: Financing activities\n"
    },
    {
      "cluster": 7,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, estimates, consolidated, financial, statements, unitedhealth, group, health, help, judgments\n\nTITLE: Increase in cash and cash equivalents, including cash within businesses held for sale104 2,062 1,990\nTITLE: Increase in cash and cash equivalents, including cash within businesses held for sale\nTITLE: Cash and cash equivalents, beginning of period25,427 23,365 21,375\nTITLE: Cash and cash equivalents, beginning of period\nTITLE: Cash and cash equivalents, end of period$25,312 $25,427 $23,365\nTITLE: Cash and cash equivalents, end of period\nTITLE: Supplemental cash flow disclosures\nTEXT: See Notes to the Consolidated Financial Statements\nTITLE: UnitedHealth Group\nTITLE: 1.Description of Business\nTITLE: Description of Business\nTEXT: UnitedHealth Group Incorporated (individually and together with its subsidiaries, “UnitedHealth Group” and “the Company”) is a health care and well-being company with a mission to help people live healthier lives and help make the health system work better for everyone. The Company’s two distinct, yet complementary businesses — Optum and UnitedHealthcare — are working to help build a modern, high-performing health system through improved access, affordability, outcomes and experiences for the individuals and organizations the Company is privileged to serve.\nTITLE: 2.Basis of Presentation, Use of Estimates and Significant Accounting Policies\nTITLE: Basis of Presentation, Use of Estimates and Significant Accounting Policies\nTITLE: Basis of Presentation\nTEXT: The Company has prepared the Consolidated Financial Statements according to U.S. Generally Accepted Accounting Principles (GAAP) and has included the accounts of UnitedHealth Group and its subsidiaries.\nTITLE: Use of Estimates\nTEXT: These Consolidated Financial Statements include certain amounts based on the Company’s best estimates and judgments. The Company’s most significant estimates relate to estimates and judgments for medical costs payable and goodwill. Certain of these estimates require the application of complex assumptions and judgments, often because they involve matters inherently uncertain and will likely change in subsequent periods. The impact of any change in estimates is included in earnings in the period in which the estimate is adjusted.\n"
    },
    {
      "cluster": 8,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, revenues, health, premium, risk, based, services, care, which, adjustment\n\nTITLE: Revenues\nTEXT: Premium revenues are primarily derived from risk-based arrangements in which the premium is typically at a fixed rate per individual served for a one-year period, and the Company assumes the economic risk of funding its customers’ health care and related administrative costs.\nTEXT: Premium revenues are recognized in the period in which eligible individuals are entitled to receive health care benefits. Health care premium payments received from the Company’s customers in advance of the service period are recorded as unearned revenues. Fully insured commercial products of U.S. health plans, Medicare Advantage and Medicare Prescription Drug Benefit (Medicare Part D) plans with medical loss ratios (MLRs) as calculated under the definitions in the Patient Protection and Affordable Care Act (ACA) and related federal and state regulations and implementing regulation, falling below certain targets are required to rebate ratable portions of their premiums annually. Commercial premiums within the Company’s individual and small group markets are also subject to the ACA risk adjustment program. Medicare Advantage premium revenue includes the impact of the Centers for Medicare & Medicaid Services (CMS) quality bonuses based on plans’ Star rating. Certain of the Company’s Medicaid business is also subject to state minimum MLR rebates.\nTEXT: Premium revenues are recognized based on the estimated premiums earned, net of projected rebates, because the Company is able to reasonably estimate the ultimate premiums of these contracts. The Company also records premium revenues for certain value-based arrangements at its Optum Health care delivery businesses. Under these value-based arrangements, the Company enters into agreements with health plans to stand ready to deliver, integrate, direct and control certain health care services for patients. In exchange, the Company receives a premium that is typically paid on a per-patient per-month basis. The Company considers these value-based arrangements to represent a single performance obligation where premium revenues are recognized in the period in which health care services are made available.\nTEXT: The Company’s Medicare Advantage and Medicare Part D premium revenues are subject to periodic adjustment under CMS’ risk adjustment payment methodology. CMS deploys a risk adjustment model which apportions premiums paid to all health plans according to health severity and certain demographic factors. The CMS risk adjustment model provides higher per member payments for enrollees diagnosed with certain conditions and lower payments for enrollees who are healthier. Under this risk adjustment methodology, CMS calculates the risk adjusted premium payment using diagnosis and encounter data from hospital inpatient, hospital outpatient and physician treatment settings. The Company and health care providers collect, capture and submit the necessary and available data to CMS within prescribed deadlines. The Company estimates risk adjustment premium revenues based upon the data submitted and expected to be submitted to CMS. Risk adjustment data for the Company’s plans are subject to review by the government, including audit by regulators. See Note 12 for additional information regarding these audits.\nTEXT: For the Company’s Optum Rx pharmacy care services business, the majority of revenues are derived from products sold through a contracted network of retail pharmacies or home delivery, specialty and community health pharmacies. Product revenues include the cost of pharmaceuticals (net of rebates), a negotiated dispensing fee and customer co-payments. Pharmacy products are billed to customers based on the number of transactions occurring during the billing period. Product revenues are recognized when the prescriptions are dispensed. The Company has entered into contracts in which it is primarily obligated to pay its network pharmacy providers for benefits provided to their customers regardless of whether the Company is paid. The Company is also involved in establishing the prices charged by retail pharmacies, determining which drugs will be included in formulary listings and selecting which retail pharmacies will be included in the network offered to plan sponsors’ members and accordingly, product revenues are reported on a gross basis.\nTEXT: Services revenue includes a number of services and products sold through Optum. Optum Health’s service revenues include net patient service revenues recorded based upon established billing rates, less allowances for contractual adjustments, and are recognized as services are provided. For its financial services offerings, Optum Health charges fees and earns investment income on managed funds. Optum Insight provides software and information products, advisory consulting arrangements and managed services outsourcing contracts, which may be delivered over several years. Optum Insight revenues are generally recognized over time and measured for each period based on the progress to date as services are performed or made available to customers.\n"
    },
    {
      "cluster": 9,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, medical, costs, care, services, revenue, estimates, which, claims, cost\n\nTEXT: Services revenue also consists of fees derived from services performed for customers who self-insure the health care costs of their employees and employees’ dependents. Under service fee contracts, the Company receives a monthly fixed fee per employee, which is recognized as revenue as the Company performs, or makes available, the applicable services to the customer. The customers retain the risk of financing health care costs for their employees and employees’ dependents, and the Company administers the payment of customer funds to physicians and other health care professionals from customer-funded bank accounts. As the Company has neither the obligation for funding the health care costs, nor the primary responsibility for providing the medical care, the Company does not recognize premium revenue and medical costs for these contracts in its Consolidated Financial Statements. For these fee-based customer arrangements, the Company provides coordination and facilitation of medical services; transaction processing; customer, consumer and care professional services; and access to contracted networks of physicians, hospitals and other health care professionals. These services are performed throughout the contract period.\nTEXT: As of December 31, 2024 and 2023, accounts receivables related to products and services were $9.9 billion and $8.6 billion, respectively. In 2024 and 2023, the Company had no material bad-debt expense and there were no material contract assets, contract liabilities or deferred contract costs recorded on the Consolidated Balance Sheets as of December 31, 2024 or 2023.\nTEXT: For the years ended December 31, 2024, 2023 and 2022, revenue recognized from performance obligations related to prior periods (for example, due to changes in transaction price) was not material.\nTEXT: As of December 31, 2024, revenue expected to be recognized in any future year related to remaining performance obligations, excluding revenue pertaining to contracts having an original expected duration of one year or less, contracts where revenue is recognized as invoiced and contracts with variable consideration related to undelivered performance obligations, was $12.7 billion, of which approximately half is expected to be recognized in the next three years.\nTEXT: See Note 14 for disaggregation of revenue by segment and type.\nTITLE: Medical Costs and Medical Costs Payable\nTEXT: The Company’s estimate of medical costs payable represents management’s best estimate of its liability for unpaid medical costs as of December 31, 2024.\nTEXT: Each period, the Company re-examines previously established medical costs payable estimates based on actual claim submissions and other changes in facts and circumstances. As more complete claim information becomes available, the Company adjusts the amount of the estimates and includes the changes in estimates in medical costs in the period in which the change is identified. Approximately 90% of claims related to medical care services are known and settled within 90 days from the date of service and substantially all within twelve months.\nTEXT: Medical costs and medical costs payable include estimates of the Company’s obligations for medical care services rendered on behalf of consumers, but for which claims have either not yet been received, processed, or paid. The Company develops estimates for medical care services incurred but not reported (IBNR), which includes estimates for claims which have not been received or fully processed, using an actuarial process consistently applied, centrally controlled and automated. The actuarial models consider factors such as time from date of service to claim processing, seasonal variances in medical care consumption, health care professional contract rate changes, care activity and other medical cost trends, membership volume and\nTEXT: demographics, the introduction of new technologies, benefit plan changes and business mix changes related to products, customers and geography.\nTEXT: In developing its medical costs payable estimates, the Company applies different estimation methods depending on which incurred claims are being estimated. For the most recent two months, the Company estimates claim costs incurred by applying observed medical cost trend factors to the average per member per month medical costs incurred in prior months for which more complete claim data are available, supplemented by a review of near-term completion factors (actuarial estimates, based upon historical experience and analysis of current trends, of the percentage of incurred claims during a given period adjudicated by the Company at the date of estimation). For months prior to the most recent two months, the Company applies the completion factors to actual claims adjudicated-to-date to estimate the expected amount of ultimate incurred claims for those months.\nTITLE: Cost of Products Sold\nTEXT: The Company’s cost of products sold includes the cost of pharmaceuticals dispensed to unaffiliated customers either directly at its home delivery, specialty and community pharmacy locations, or indirectly through its nationwide network of participating pharmacies. Rebates attributable to unaffiliated clients are accrued as rebates receivable and a reduction of cost of products sold, with a corresponding payable for the amounts of the rebates to be remitted to those unaffiliated clients in accordance with their contracts and recorded in the Consolidated Statements of Operations as a reduction of product revenue. Cost of products sold also includes the cost of personnel to support the Company’s transaction processing services, system sales, maintenance and professional services.\n"
    },
    {
      "cluster": 10,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, investments, value, other, cost, rebates, cash, fair, included, software\n\nTITLE: Cash, Cash Equivalents and Investments\nTEXT: Cash and cash equivalents are highly liquid investments having an original maturity of three months or less. The fair value of cash and cash equivalents approximates their carrying value because of the short maturity of the instruments. Investments with maturities of less than one year are classified as short-term. Because of regulatory requirements, certain investments are included in long-term investments regardless of their maturity date. The Company classifies these investments as held-to-maturity and reports them at amortized cost. Substantially all other investments are classified as available-for-sale and reported at fair value based on quoted market prices, where available. Equity investments are measured at fair value, with certain exceptions where the Company has elected to measure investments with unobservable inputs at cost, subject to fair value adjustments upon an impairment or a transaction of the same or similar security. Changes in fair value of equity investments are recognized in net earnings.\nTEXT: The Company excludes unrealized gains and losses on available-for-sale debt securities from net earnings and reports them as comprehensive income and, net of income tax effects, as a separate component of equity. To calculate realized gains and losses on the sale of debt securities, the Company specifically identifies the cost of each investment sold.\nTEXT: The Company evaluates an available-for-sale debt security for credit-related impairment by considering the present value of expected cash flows relative to a security’s amortized cost, the extent to which fair value is less than amortized cost, the financial condition and near-term prospects of the issuer and specific events or circumstances which may influence the operations of the issuer. Credit-related impairments are recorded as an allowance, with an offset to investment and other income. Non-credit related impairments are recorded through other comprehensive income. If the Company intends to sell an impaired security, or will likely be required to sell a security before recovery of the entire amortized cost, the entire impairment is included in net earnings.\nTEXT: New information and the passage of time can change these judgments. The Company manages its investment portfolio to limit its exposure to any one issuer or market sector, and largely limits its investments to investment grade quality.\nTITLE: Assets Under Management\nTEXT: In July 2024, the Company amended its Medicare Supplement Program with a membership organization (the Medicare Supplement Program). The amendments provide the Company the right to use a trade name and other intellectual property in marketing efforts for Medicare Supplement offerings. Amounts previously reported as assets under management are now included within the Company’s Consolidated Balance Sheet based upon their classification.\nTEXT: For periods prior to the amended Medicare Supplement Program, the Company excluded the effects of certain balance sheet amounts in its Consolidated Statements of Cash Flows, while these effects are included for periods after the amendments.\nTITLE: Other Current Receivables\nTEXT: Other current receivables include amounts due from pharmaceutical manufacturers for rebates and Medicare Part D drug discounts, loans to care providers in response to the Change Healthcare cyberattack, accrued interest and other miscellaneous amounts due to the Company.\nTEXT: The Company’s pharmacy care services businesses contract with pharmaceutical manufacturers, some of which provide rebates based on use of the manufacturers’ products by its affiliated and unaffiliated clients. The Company accrues rebates as they are earned by its clients on a monthly basis based on the terms of the applicable contracts, historical data and current estimates. The pharmacy care services businesses bill these rebates to the manufacturers on a monthly or quarterly basis depending on the contractual terms and record rebates attributable to affiliated clients as a reduction to medical costs. The Company generally receives rebates two to five months after billing. As of December 31, 2024 and 2023, total pharmaceutical manufacturer rebates receivable included in other receivables in the Consolidated Balance Sheets amounted to $12.5 billion and $11.0 billion, respectively.\nTITLE: Prepaid Expenses and Other Current Assets\nTEXT: Prepaid expenses and other current assets included pharmaceutical drug and supplies inventory of $3.8 billion and $2.8 billion as of December 31, 2024 and 2023, respectively.\nTITLE: Property, Equipment and Capitalized Software\nTEXT: Property, equipment and capitalized software are stated at cost, net of accumulated depreciation and amortization. Capitalized software consists of certain costs incurred in the development of internal-use software, including external direct costs of materials and services and applicable payroll costs of employees devoted to specific software development.\nTEXT: The Company calculates depreciation and amortization using the straight-line method over the estimated useful lives of the assets. The useful lives for property, equipment and capitalized software are: Furniture, fixtures and equipment3 to 10 yearsBuildings35 to 40 yearsCapitalized software3 to 5 years\nTABLE: TABLE: Furniture, fixtures and equipment 3 to 10 years; Buildings 35 to 40 years; Capitalized software 3 to 5 years.\nTEXT: Leasehold improvements are depreciated over the shorter of the remaining lease term or their estimated useful economic life.\n"
    },
    {
      "cluster": 11,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, value, lease, impairment, stock, date, period, fair, assets, redeemable\n\nTITLE: Operating Leases\nTEXT: The Company leases facilities and equipment under long-term operating leases which are non-cancelable and expire on various dates. At the lease commencement date, lease right-of-use (ROU) assets and lease liabilities are recognized based on the present value of the future minimum lease payments over the lease term, which includes all fixed obligations arising from the lease contract. If an interest rate is not implicit in a lease, the Company utilizes its incremental borrowing rate for a period closely matching the lease term.\nTEXT: The Company’s ROU assets are included in other assets, and lease liabilities are included in other current liabilities and other liabilities in the Company’s Consolidated Balance Sheet.\nTITLE: Goodwill\nTEXT: To determine whether goodwill is impaired, annually or more frequently if needed, the Company performs impairment tests. The Company may first assess qualitative factors to determine if it is more likely than not the carrying value of a reporting unit exceeds its estimated fair value. If our qualitative assessment indicates a goodwill impairment is more likely than not, we perform additional quantitative analyses. The Company may also elect to skip the qualitative testing and proceed directly to the quantitative testing. When performing quantitative testing, the Company first estimates the fair values of its reporting units using discounted cash flows. To determine fair values, the Company must make assumptions about a wide variety of internal and external factors. Significant assumptions used in the impairment analysis include financial projections of free cash flow (including significant assumptions about operations, capital levels and income taxes), long-term growth rates for determining terminal value and discount rates. Comparative market multiples are used to corroborate the results of the discounted cash flow test. If the fair value is less than the carrying value of the reporting unit, an impairment is recognized for the difference, up to the carrying amount of goodwill.\nTEXT: There was no impairment of goodwill during the years ended December 31, 2024, 2023 and 2022.\nTITLE: Intangible Assets\nTEXT: The Company’s finite-lived intangible assets are subject to impairment tests when events or circumstances indicate an intangible asset (or asset group) may be impaired. The Company’s indefinite-lived intangible assets are also tested for impairment annually. There was no impairment of intangible assets during the years ended December 31, 2024, 2023 and 2022.\nTITLE: Other Current Liabilities\nTEXT: Other current liabilities include health savings account deposits ($13.7 billion and $13.5 billion as of December 31, 2024 and 2023, respectively), accruals for premium rebates payable, the current portion of future policy benefits and customer balances.\nTITLE: Policy Acquisition Costs\nTEXT: The Company’s short duration health insurance contracts typically have a one-year term and may be canceled by the customer with at least 30 days’ notice. Costs related to the acquisition and renewal of short duration customer contracts are primarily charged to expense as incurred.\nTITLE: Redeemable Noncontrolling Interests\nTEXT: Redeemable noncontrolling interests in the Company’s subsidiaries whose redemption is outside of the Company’s control are classified as temporary equity. These interests primarily relate to put options on unowned shares, which are typically redeemable at fair value after a certain time period. The Company accretes changes in the redemption value to the earliest redemption date utilizing the interest method. If all interests were currently redeemable, the difference between the carrying value and the estimated redemption value is not material. The following table provides details of the Company's redeemable noncontrolling interests’ activity for the years ended December 31, 2024 and 2023:\nTEXT: (in millions)20242023Redeemable noncontrolling interests, beginning of period$4,498 $4,897 Net earnings174 188 Acquisitions33 122 Redemptions(280)(730)Distributions (125)(144)Fair value and other adjustments23 165 Redeemable noncontrolling interests, end of period$4,323 $4,498\nTABLE: TABLE_ROW: Redeemable noncontrolling interests, beginning of period — 2024: 4,498; 2023: 4,897\nTABLE_ROW: Net earnings — 2024: 174; 2023: 188\nTABLE_ROW: Acquisitions — 2024: 33; 2023: 122\nTABLE_ROW: Redemptions — 2024: (280); 2023: (730)\nTABLE_ROW: Distributions — 2024: (125); 2023: (144)\nTABLE_ROW: Fair value and other adjustments — 2024: 23; 2023: 165\nTABLE_ROW: Redeemable noncontrolling interests, end of period — 2024: 4,323; 2023: 4,498\nTITLE: (in millions)20242023\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\nTITLE: Share-Based Compensation\nTEXT: The Company recognizes compensation expense for share-based awards, including stock options and restricted stock and restricted stock units (collectively, restricted shares), on a straight-line basis over the related service period (generally the vesting period) of the award, or to an employee’s eligible retirement date under the award agreement, if earlier. Restricted shares vest ratably, primarily over four years, and compensation expense related to restricted shares is based on the share price on the date of grant. Stock options vest ratably primarily over four years and may be exercised up to 10 years from the date of grant. Compensation expense related to stock options is based on the fair value at the date of grant, which is estimated on the date of grant using a binomial option-pricing model. Under the Company’s Employee Stock Purchase Plan (ESPP), eligible employees are allowed to purchase the Company’s stock at a discounted price, which is 90% of the market price of the Company’s common stock at the end of the six-month purchase period. Share-based compensation expense for all programs is recognized in operating costs in the Consolidated Statements of Operations.\n"
    },
    {
      "cluster": 12,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsecurities, debt, obligations, agency, common, shares, mortgage, backed, total, maturity\n\nTITLE: Net Earnings Per Common Share\nTEXT: The Company computes basic earnings per common share attributable to UnitedHealth Group common shareholders by dividing net earnings attributable to UnitedHealth Group common shareholders by the weighted-average number of common shares outstanding during the period. The Company determines diluted net earnings per common share attributable to UnitedHealth Group common shareholders using the weighted-average number of common shares outstanding during the period, adjusted for potentially dilutive shares associated with stock options, restricted shares and the ESPP (collectively, common stock equivalents), using the treasury stock method. The treasury stock method assumes a hypothetical issuance of shares to settle the share-based awards, with the assumed proceeds used to purchase common stock at the average market price for the period. Assumed proceeds include the amount the employee must pay upon exercise and the average unrecognized compensation cost. The difference between the number of shares assumed issued and number of shares assumed purchased represents the dilutive shares.\nTITLE: 3. Investments\nTEXT: A summary of debt securities by major security type is as follows:(in millions)AmortizedCostGrossUnrealizedGainsGrossUnrealizedLossesFairValueDecember 31, 2024Debt securities - available-for-sale:U.S. government and agency obligations$4,600 $1 $(274)$4,327 State and municipal obligations7,357 2 (375)6,984 Corporate obligations24,391 56 (1,140)23,307 U.S. agency mortgage-backed securities10,577 1 (994)9,584 Non-U.S. agency mortgage-backed securities2,890 2 (175)2,717 Total debt securities - available-for-sale49,815 62 (2,958)46,919 Debt securities - held-to-maturity:U.S. government and agency obligations444 — (2)442 State and municipal obligations28 — (2)26 Corporate obligations40 — — 40 Total debt securities - held-to-maturity512 — (4)508 Total debt securities$50,327 $62 $(2,962)$47,427 December 31, 2023Debt securities - available-for-sale:U.S. government and agency obligations$4,674 $3 $(234)$4,443 State and municipal obligations7,636 39 (322)7,353 Corporate obligations23,136 67 (1,186)22,017 U.S. agency mortgage-backed securities8,982 22 (708)8,296 Non-U.S. agency mortgage-backed securities3,023 3 (240)2,786 Total debt securities - available-for-sale47,451 134 (2,690)44,895 Debt securities - held-to-maturity:U.S. government and agency obligations506 1 (6)501 State and municipal obligations28 — (2)26 Corporate obligations69 — — 69 Total debt securities - held-to-maturity603 1 (8)596 Total debt securities$48,054 $135 $(2,698)$45,491\nTABLE: TABLE: (in millions) AmortizedCost GrossUnrealizedGains GrossUnrealizedLosses FairValue; U.S. government and agency obligations $ 4,600 $ 1 $ (274) $ 4,327; State and municipal obligations 7,357 2 (375) 6,984; Corporate obligations 24,391 56 (1,140) 23,307; U.S. agency mortgage-backed securities 10,577 1 (994) 9,584; Non-U.S. agency mortgage-backed securities 2,890 2 (175) 2,717; Total debt securities - available-for-sale 49,815 62 (2,958) 46,919; U.S. government and agency obligations 444 — (2) 442; State and municipal obligations 28 — (2) 26; Corporate obligations 40 — — 40; Total debt securities - held-to-maturity 512 — (4) 508; Total debt securities $ 50,327 $ 62 $ (2,962) $ 47,427; U.S. government and agency obligations $ 4,674 $ 3 $ (234) $ 4,443; State and municipal obligations 7,636 39 (322) 7,353; Corporate obligations 23,136 67 (1,186) 22,017; U.S. agency mortgage-backed securities 8,982 22 (708) 8,296; Non-U.S. agency mortgage-backed securities 3,023 3 (240) 2,786; Total debt securities - available-for-sale 47,451 134 (2,690) 44,895; U.S. government and agency obligations 506 1 (6) 501; State and municipal obligations 28 — (2) 26; Corporate obligations 69 — — 69; Total debt securities - held-to-maturity 603 1 (8) 596; Total debt securities $ 48,054 $ 135 $ (2,698) $ 45,491.\nTITLE: (in millions)AmortizedCostGrossUnrealizedGainsGrossUnrealizedLossesFairValue\nTITLE: (in millions)\nTITLE: AmortizedCost\nTITLE: GrossUnrealizedGains\nTITLE: GrossUnrealizedLosses\nTITLE: FairValue\nTITLE: December 31, 2024\nTITLE: December 31, 2023\nTEXT: Nearly all of the Company’s investments in mortgage-backed securities were rated “Double A” or better as of December 31, 2024.\nTEXT: The Company held $4.9 billion of equity securities as of December 31, 2024 and 2023. The Company’s investments in equity securities primarily consist of venture investments and employee savings plan related investments. Additionally, the Company’s investments included $3.8 billion and $1.4 billion of equity method investments primarily in operating businesses in the health care sector, as of December 31, 2024 and 2023, respectively. The allowance for credit losses on held-to-maturity securities as of December 31, 2024 and 2023 was not material.\nTEXT: The amortized cost and fair value of debt securities as of December 31, 2024, by contractual maturity, were as follows:Available-for-SaleHeld-to-Maturity(in millions)AmortizedCostFairValueAmortizedCostFairValueDue in one year or less$3,952 $3,932 $320 $319 Due after one year through five years14,845 14,384 161 161 Due after five years through ten years12,110 11,213 14 13 Due after ten years5,441 5,089 17 15 U.S. agency mortgage-backed securities10,577 9,584 — — Non-U.S. agency mortgage-backed securities2,890 2,717 — — Total debt securities$49,815 $46,919 $512 $508\nTABLE: TABLE: Available-for-Sale Held-to-Maturity; (in millions) AmortizedCost FairValue AmortizedCost FairValue; Due in one year or less $ 3,952 $ 3,932 $ 320 $ 319; Due after one year through five years 14,845 14,384 161 161; Due after five years through ten years 12,110 11,213 14 13; Due after ten years 5,441 5,089 17 15; U.S. agency mortgage-backed securities 10,577 9,584 — —; Non-U.S. agency mortgage-backed securities 2,890 2,717 — —; Total debt securities $ 49,815 $ 46,919 $ 512 $ 508.\nTITLE: Available-for-SaleHeld-to-Maturity\n"
    },
    {
      "cluster": 13,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsecurities, agency, mortgage, backed, company, debt, obligations, credit, available, sale\n\nTITLE: Available-for-Sale\nTITLE: Held-to-Maturity\nTITLE: (in millions)AmortizedCostFairValueAmortizedCostFairValue\nTITLE: (in millions)\nTITLE: AmortizedCost\nTITLE: FairValue\nTITLE: AmortizedCost\nTITLE: FairValue\nTEXT: The fair value of available-for-sale debt securities with gross unrealized losses by major security type and length of time that individual securities have been in a continuous unrealized loss position were as follows: Less Than 12 Months12 Months or Greater Total(in millions)FairValueGrossUnrealizedLossesFairValueGrossUnrealizedLossesFairValueGrossUnrealizedLossesDecember 31, 2024U.S. government and agency obligations$1,475 $(51)$2,152 $(223)$3,627 $(274)State and municipal obligations2,593 (58)4,085 (317)6,678 (375)Corporate obligations7,402 (213)11,449 (927)18,851 (1,140)U.S. agency mortgage-backed securities4,791 (191)4,674 (803)9,465 (994)Non-U.S. agency mortgage-backed securities416 (5)1,863 (170)2,279 (175)Total debt securities - available-for-sale$16,677 $(518)$24,223 $(2,440)$40,900 $(2,958)December 31, 2023U.S. government and agency obligations$1,270 $(7)$2,077 $(227)$3,347 $(234)State and municipal obligations907 (7)4,063 (315)4,970 (322)Corporate obligations1,826 (17)14,696 (1,169)16,522 (1,186)U.S. agency mortgage-backed securities1,337 (12)5,069 (696)6,406 (708)Non-U.S. agency mortgage-backed securities279 (6)2,202 (234)2,481 (240)Total debt securities - available-for-sale$5,619 $(49)$28,107 $(2,641)$33,726 $(2,690)\nTABLE: TABLE: Less Than 12 Months 12 Months or Greater Total; (in millions) FairValue GrossUnrealizedLosses FairValue GrossUnrealizedLosses FairValue GrossUnrealizedLosses; U.S. government and agency obligations $ 1,475 $ (51) $ 2,152 $ (223) $ 3,627 $ (274); State and municipal obligations 2,593 (58) 4,085 (317) 6,678 (375); Corporate obligations 7,402 (213) 11,449 (927) 18,851 (1,140); U.S. agency mortgage-backed securities 4,791 (191) 4,674 (803) 9,465 (994); Non-U.S. agency mortgage-backed securities 416 (5) 1,863 (170) 2,279 (175); Total debt securities - available-for-sale $ 16,677 $ (518) $ 24,223 $ (2,440) $ 40,900 $ (2,958); U.S. government and agency obligations $ 1,270 $ (7) $ 2,077 $ (227) $ 3,347 $ (234); State and municipal obligations 907 (7) 4,063 (315) 4,970 (322); Corporate obligations 1,826 (17) 14,696 (1,169) 16,522 (1,186); U.S. agency mortgage-backed securities 1,337 (12) 5,069 (696) 6,406 (708); Non-U.S. agency mortgage-backed securities 279 (6) 2,202 (234) 2,481 (240); Total debt securities - available-for-sale $ 5,619 $ (49) $ 28,107 $ (2,641) $ 33,726 $ (2,690).\nTITLE: Less Than 12 Months12 Months or Greater Total\nTITLE: Less Than 12 Months\nTITLE: 12 Months or Greater\nTITLE: Total\nTITLE: (in millions)FairValueGrossUnrealizedLossesFairValueGrossUnrealizedLossesFairValueGrossUnrealizedLosses\nTITLE: (in millions)\nTITLE: FairValue\nTITLE: GrossUnrealizedLosses\nTITLE: FairValue\nTITLE: GrossUnrealizedLosses\nTITLE: FairValue\nTITLE: GrossUnrealizedLosses\nTITLE: December 31, 2024\nTEXT: U.S. agency mortgage-backed securities\nTEXT: Non-U.S. agency mortgage-backed securities\nTITLE: December 31, 2023\nTEXT: U.S. agency mortgage-backed securities\nTEXT: Non-U.S. agency mortgage-backed securities\nTEXT: The Company’s unrealized losses from all securities as of December 31, 2024 were generated from approximately 34,000 positions out of a total of 43,000 positions. The Company believes it will timely collect the principal and interest due on its debt securities that have an amortized cost in excess of fair value. The unrealized losses were primarily caused by interest rate increases and not by unfavorable changes in the credit quality associated with these securities which impacted the Company’s assessment on collectibility of principal and interest. At each reporting period, the Company evaluates available-for-sale debt securities for any credit-related impairment when the fair value of the investment is less than its amortized cost. The Company evaluated the expected cash flows, the underlying credit quality and credit ratings of the issuers, noting no significant credit deterioration since purchase. As of December 31, 2024, the Company did not have the intent to sell any of the securities in an unrealized loss position. Therefore, the Company believes these losses to be temporary. The allowance for credit losses on available-for-sale debt securities as of December 31, 2024 and 2023 was not material.\n"
    },
    {
      "cluster": 14,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nfair, value, prices, assets, liabilities, inputs, level, company, market, securities\n\nTITLE: 4. Fair Value\nTEXT: Certain assets and liabilities are measured at fair value in the Consolidated Financial Statements or have fair values disclosed in the Notes to the Consolidated Financial Statements. These assets and liabilities are classified into one of three levels of a hierarchy defined by GAAP. In instances in which the inputs used to measure fair value fall into different levels of the fair value hierarchy, the fair value measurement is categorized in its entirety based on the lowest level input which is significant to the fair value measurement in its entirety. The Company’s assessment of the significance of a particular item to the fair value measurement in its entirety requires judgment, including the consideration of inputs specific to the asset or liability.\nTEXT: The fair value hierarchy is summarized as follows:\nTEXT: Level 1 — Quoted prices (unadjusted) for identical assets/liabilities in active markets.\nTEXT: Level 2 — Other observable inputs, either directly or indirectly, including:\nTEXT: •Quoted prices for similar assets/liabilities in active markets;\nTEXT: •Quoted prices for identical or similar assets/liabilities in inactive markets (e.g., few transactions, limited information, noncurrent prices, high variability over time);\nTEXT: •Inputs other than quoted prices observable for the asset/liability (e.g., interest rates, yield curves, implied volatilities, credit spreads); and\nTEXT: •Inputs corroborated by other observable market data.\nTEXT: Level 3 — Unobservable inputs cannot be corroborated by observable market data.\nTEXT: There were no transfers in or out of Level 3 financial assets or liabilities during the years ended December 31, 2024 or 2023.\nTEXT: Nonfinancial assets and liabilities or financial assets and liabilities measured at fair value on a nonrecurring basis are subject to fair value adjustments only in certain circumstances, such as when the Company records an impairment. For the years ended December 31, 2024, 2023 and 2022, the Company recognized $710 million, $276 million and $211 million respectively, of unrealized gains in investment and other income related to fair value adjustments on equity securities primarily in the Company’s venture portfolio, based upon transactions of the same or similar security. The assets and liabilities within our South American operations held for sale as of December 31, 2024 were measured at the lower of carrying value or fair value less cost to sell. Fair value is measured based upon unobservable amounts, such as estimated selling price derived from Company-specific information and market conditions. There were no other significant fair value adjustments for these assets and liabilities recorded during the years ended December 31, 2024, 2023 or 2022.\nTEXT: The following methods and assumptions were used to estimate the fair value and determine the fair value hierarchy classification of each class of financial instrument included in the tables below:\nTEXT: Cash and Cash Equivalents. The carrying value of cash and cash equivalents approximates fair value as maturities are less than three months. Fair values of cash equivalent instruments which do not trade on a regular basis in active markets are classified as Level 2.\nTEXT: Debt and Equity Securities. Fair values of debt securities and equity securities reported at fair value on a recurring basis are based on quoted market prices, where available. The Company obtains one price for each security primarily from a third-party pricing service (pricing service), which generally uses quoted or other observable inputs for the determination of fair value. The pricing service normally derives the security prices through recently reported trades for identical or similar securities, and, if necessary, makes adjustments through the reporting date based upon available observable market information. For securities not actively traded, the pricing service may use quoted market prices of comparable instruments or discounted cash flow analyses, incorporating inputs currently observable in the markets for similar securities. Inputs often used in the valuation methodologies include, but are not limited to, benchmark yields, credit spreads, default rates, prepayment speeds and nonbinding broker quotes. As the Company is responsible for the determination of fair value, it performs quarterly analyses on the prices received from the pricing service to determine whether the prices are reasonable estimates of fair value. Specifically, the Company compares the prices received from the pricing service to prices reported by a secondary pricing source, such as its custodian, its investment consultant and third-party investment advisors. Additionally, the Company compares changes in the reported market values and returns to relevant market indices to test the reasonableness of the reported prices. The Company’s internal price verification procedures and reviews of fair value methodology documentation provided by independent pricing services have not historically resulted in adjustment to the prices obtained from the pricing service.\nTEXT: Fair values of debt securities which do not trade on a regular basis in active markets but are priced using other observable inputs are classified as Level 2.\nTEXT: Fair value estimates for Level 1 and Level 2 equity securities reported at fair value on a recurring basis are based on quoted market prices for actively traded equity securities and/or other market data for the same or comparable instruments and transactions in establishing the prices.\nTEXT: The fair values of Level 3 investments in corporate bonds, which are not a significant portion of our investments, are estimated using valuation techniques relying heavily on management assumptions and qualitative observations.\n"
    },
    {
      "cluster": 15,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nsecurities, debt, fair, value, level, obligations, assets, agency, total, term\n\nTEXT: Throughout the procedures discussed above in relation to the Company’s processes for validating third-party pricing information, the Company validates the understanding of assumptions and inputs used in security pricing and determines the proper classification in the hierarchy based on such understanding.\nTEXT: Long-Term Debt. The fair values of the Company’s long-term debt are estimated and classified using the same methodologies as the Company’s investments in debt securities.\nTEXT: The following table presents a summary of fair value measurements by level and carrying values for items measured at fair value on a recurring basis in the Consolidated Balance Sheets:(in millions)Quoted Pricesin ActiveMarkets(Level 1)OtherObservableInputs(Level 2)UnobservableInputs(Level 3)TotalFair and CarryingValueDecember 31, 2024Cash and cash equivalents$25,248 $64 $— $25,312 Debt securities - available-for-sale:U.S. government and agency obligations4,194 133 — 4,327 State and municipal obligations— 6,984 — 6,984 Corporate obligations29 22,841 437 23,307 U.S. agency mortgage-backed securities— 9,584 — 9,584 Non-U.S. agency mortgage-backed securities— 2,717 — 2,717 Total debt securities - available-for-sale4,223 42,259 437 46,919 Equity securities1,859 24 65 1,948 Total assets at fair value$31,330 $42,347 $502 $74,179 Percentage of total assets at fair value42 %57 %1 %100 %December 31, 2023Cash and cash equivalents$25,345 $82 $— $25,427 Debt securities - available-for-sale:U.S. government and agency obligations4,167 276 — 4,443 State and municipal obligations— 7,353 — 7,353 Corporate obligations15 21,800 202 22,017 U.S. agency mortgage-backed securities— 8,296 — 8,296 Non-U.S. agency mortgage-backed securities— 2,786 — 2,786 Total debt securities - available-for-sale4,182 40,511 202 44,895 Equity securities2,468 16 69 2,553 Assets under management1,505 2,140 110 3,755 Total assets at fair value$33,500 $42,749 $381 $76,630 Percentage of total assets at fair value44 %55 %1 %100 %\nTABLE: TABLE: (in millions) Quoted Pricesin ActiveMarkets(Level 1) OtherObservableInputs(Level 2) UnobservableInputs(Level 3) TotalFair and CarryingValue; Cash and cash equivalents $ 25,248 $ 64 $ — $ 25,312; U.S. government and agency obligations 4,194 133 — 4,327; State and municipal obligations — 6,984 — 6,984; Corporate obligations 29 22,841 437 23,307; U.S. agency mortgage-backed securities — 9,584 — 9,584; Non-U.S. agency mortgage-backed securities — 2,717 — 2,717; Total debt securities - available-for-sale 4,223 42,259 437 46,919; Equity securities 1,859 24 65 1,948; Total assets at fair value $ 31,330 $ 42,347 $ 502 $ 74,179; Percentage of total assets at fair value 42 % 57 % 1 % 100 %; Cash and cash equivalents $ 25,345 $ 82 $ — $ 25,427; U.S. government and agency obligations 4,167 276 — 4,443; State and municipal obligations — 7,353 — 7,353; Corporate obligations 15 21,800 202 22,017; U.S. agency mortgage-backed securities — 8,296 — 8,296; Non-U.S. agency mortgage-backed securities — 2,786 — 2,786; Total debt securities - available-for-sale 4,182 40,511 202 44,895; Equity securities 2,468 16 69 2,553; Assets under management 1,505 2,140 110 3,755; Total assets at fair value $ 33,500 $ 42,749 $ 381 $ 76,630; Percentage of total assets at fair value 44 % 55 % 1 % 100 %.\nTITLE: (in millions)Quoted Pricesin ActiveMarkets(Level 1)OtherObservableInputs(Level 2)UnobservableInputs(Level 3)TotalFair and CarryingValue\nTITLE: (in millions)\nTITLE: Quoted Pricesin ActiveMarkets(Level 1)\nTITLE: OtherObservableInputs(Level 2)\nTITLE: UnobservableInputs(Level 3)\nTITLE: TotalFair and CarryingValue\nTITLE: December 31, 2024\nTITLE: December 31, 2023\nTEXT: The following table presents a summary of fair value measurements by level and carrying values for certain financial instruments not measured at fair value on a recurring basis in the Consolidated Balance Sheets:(in millions)Quoted Pricesin ActiveMarkets(Level 1)OtherObservableInputs(Level 2)UnobservableInputs(Level 3)TotalFairValueTotal Carrying ValueDecember 31, 2024Debt securities - held-to-maturity$482 $26 $— $508 $512 Long-term debt and other financing obligations$— $70,565 $— $70,565 $75,604 December 31, 2023Debt securities - held-to-maturity$524 $72 $— $596 $603 Long-term debt and other financing obligations$— $59,851 $— $59,851 $61,449\nTABLE: TABLE: (in millions) Quoted Pricesin ActiveMarkets(Level 1) OtherObservableInputs(Level 2) UnobservableInputs(Level 3) TotalFairValue Total Carrying Value; Debt securities - held-to-maturity $ 482 $ 26 $ — $ 508 $ 512; Long-term debt and other financing obligations $ — $ 70,565 $ — $ 70,565 $ 75,604; Debt securities - held-to-maturity $ 524 $ 72 $ — $ 596 $ 603; Long-term debt and other financing obligations $ — $ 59,851 $ — $ 59,851 $ 61,449.\nTITLE: (in millions)\nTITLE: Quoted Pricesin ActiveMarkets(Level 1)\nTITLE: OtherObservableInputs(Level 2)\nTITLE: UnobservableInputs(Level 3)\nTITLE: TotalFairValue\nTITLE: Total Carrying Value\nTITLE: December 31, 2024\nTITLE: December 31, 2023\nTEXT: The carrying amounts reported on the Consolidated Balance Sheets for other current financial assets and liabilities approximate fair value because of their short-term nature. These assets and liabilities are not listed in the table above.\n"
    },
    {
      "cluster": 16,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndecember, carrying, other, equipment, capitalized, software, property, follows, accumulated, amortization\n\nTITLE: 5. Property, Equipment and Capitalized Software\nTEXT: A summary of property, equipment and capitalized software is as follows: (in millions)December 31, 2024December 31, 2023Land and improvements$364 $712 Buildings and improvements4,215 5,573 Computer equipment2,267 2,007 Furniture and fixtures1,694 2,375 Less accumulated depreciation(3,645)(4,210)Property and equipment, net4,895 6,457 Capitalized software8,984 7,822 Less accumulated amortization(3,326)(2,829)Capitalized software, net5,658 4,993 Total property, equipment and capitalized software, net$10,553 $11,450\nTABLE: TABLE: (in millions) December 31, 2024 December 31, 2023; Land and improvements $ 364 $ 712; Buildings and improvements 4,215 5,573; Computer equipment 2,267 2,007; Furniture and fixtures 1,694 2,375; Less accumulated depreciation (3,645) (4,210); Property and equipment, net 4,895 6,457; Capitalized software 8,984 7,822; Less accumulated amortization (3,326) (2,829); Capitalized software, net 5,658 4,993; Total property, equipment and capitalized software, net $ 10,553 $ 11,450.\nTITLE: (in millions)December 31, 2024December 31, 2023\nTITLE: (in millions)\nTITLE: December 31, 2024\nTITLE: December 31, 2023\nTEXT: Depreciation expense for property and equipment for the years ended December 31, 2024, 2023 and 2022 was $1.0 billion, $1.1 billion, and $1.1 billion, respectively. Amortization expense for capitalized software for the years ended December 31, 2024, 2023 and 2022 was $1.4 billion, $1.2 billion and $1.0 billion, respectively.\nTITLE: 6. Goodwill and Other Intangible Assets\nTEXT: Changes in the carrying amount of goodwill, by reportable segment, were as follows:(in millions)UnitedHealthcareOptum HealthOptum InsightOptum RxConsolidatedBalance at January 1, 2023$27,395 $29,238 $17,244 $19,475 $93,352 Acquisitions296 8,023 1,802 — 10,121 Foreign currency effects and other adjustments, net187 (182)261 (7)259 Balance at December 31, 202327,878 37,079 19,307 19,468 103,732 Acquisitions— 2,071 — 2,305 4,376 Dispositions, foreign currency effects and other adjustments, net(717)(324)(327)(6)(1,374)Balance at December 31, 2024$27,161 $38,826 $18,980 $21,767 $106,734\nTABLE: TABLE: (in millions) UnitedHealthcare Optum Health Optum Insight Optum Rx Consolidated; Balance at January 1, 2023 $ 27,395 $ 29,238 $ 17,244 $ 19,475 $ 93,352; Acquisitions 296 8,023 1,802 — 10,121; Foreign currency effects and other adjustments, net 187 (182) 261 (7) 259; Balance at December 31, 2023 27,878 37,079 19,307 19,468 103,732; Acquisitions — 2,071 — 2,305 4,376; Dispositions, foreign currency effects and other adjustments, net (717) (324) (327) (6) (1,374); Balance at December 31, 2024 $ 27,161 $ 38,826 $ 18,980 $ 21,767 $ 106,734.\nTITLE: (in millions)UnitedHealthcareOptum HealthOptum InsightOptum RxConsolidated\nTITLE: (in millions)\nTITLE: UnitedHealthcare\nTITLE: Optum Health\nTITLE: Optum Insight\nTITLE: Optum Rx\nTITLE: Consolidated\nTEXT: The gross carrying value, accumulated amortization and net carrying value of other intangible assets were as follows: December 31, 2024December 31, 2023(in millions)Gross Carrying ValueAccumulated AmortizationNet Carrying ValueGross Carrying ValueAccumulated AmortizationNet Carrying ValueCustomer-related$17,190 $(6,675)$10,515 $16,636 $(5,909)$10,727 Trademarks and technology2,917 (1,284)1,633 2,508 (958)1,550 Trade names, trademarks, operating licenses and certificates and other indefinite-lived10,454 — 10,454 2,116 — 2,116 Other1,057 (391)666 1,213 (412)801 Total$31,618 $(8,350)$23,268 $22,473 $(7,279)$15,194\nTABLE: TABLE: December 31, 2024 December 31, 2023; (in millions) Gross Carrying Value Accumulated Amortization Net Carrying Value Gross Carrying Value Accumulated Amortization Net Carrying Value; Customer-related $ 17,190 $ (6,675) $ 10,515 $ 16,636 $ (5,909) $ 10,727; Trademarks and technology 2,917 (1,284) 1,633 2,508 (958) 1,550; Trade names, trademarks, operating licenses and certificates and other indefinite-lived 10,454 — 10,454 2,116 — 2,116; Other 1,057 (391) 666 1,213 (412) 801; Total $ 31,618 $ (8,350) $ 23,268 $ 22,473 $ (7,279) $ 15,194.\nTITLE: December 31, 2024December 31, 2023\nTITLE: December 31, 2024\nTITLE: December 31, 2023\nTITLE: (in millions)Gross Carrying ValueAccumulated AmortizationNet Carrying ValueGross Carrying ValueAccumulated AmortizationNet Carrying Value\nTITLE: (in millions)\nTITLE: Gross Carrying Value\nTITLE: Accumulated Amortization\nTITLE: Net Carrying Value\nTITLE: Gross Carrying Value\nTITLE: Accumulated Amortization\nTITLE: Net Carrying Value\nTEXT: The fair values and weighted-average useful lives assigned to intangible assets as a result of transactions completed during years ended: 20242023(in millions, except years)Fair ValueWeighted-Average Useful LifeFair ValueWeighted-Average Useful LifeCustomer-related$1,258 12 years$477 12 yearsTrademarks and technology527 6 years226 5 yearsOther22 8 years44 9 yearsTotal finite-lived$1,807 10 years$747 9 yearsTotal indefinite-lived - trade names, trademarks, operating licenses and certificates and other8,795 1,427 Total intangible assets$10,602 $2,174\nTABLE: TABLE_ROW: Customer-related — 2024: 1,258; 2023: 12 years\nTABLE_ROW: Trademarks and technology — 2024: 527; 2023: 6 years\nTABLE_ROW: Other — 2024: 22; 2023: 8 years\nTABLE_ROW: Total finite-lived — 2024: 1,807; 2023: 10 years\nTABLE_ROW: Total indefinite-lived - trade names, trademarks, operating licenses and certificates and other — 2024: 8,795; 2023: 1,427\nTABLE_ROW: Total intangible assets — 2024: 10,602; 2023: 2,174\nTITLE: 20242023\nTITLE: 2024\nTITLE: 2023\nTITLE: (in millions, except years)Fair ValueWeighted-Average Useful LifeFair ValueWeighted-Average Useful Life\nTITLE: (in millions, except years)\nTITLE: Fair Value\nTITLE: Weighted-Average Useful Life\nTITLE: Fair Value\n"
    },
    {
      "cluster": 17,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nmedical, costs, december, payable, total, payments, prior, included, current, amortization\n\nTITLE: Weighted-Average Useful Life\nTEXT: Estimated full year amortization expense relating to intangible assets for each of the next five years ending December 31 is as follows:(in millions)2025$1,655 20261,503 20271,424 20281,344 20291,211\nTABLE: TABLE: 2025 $ 1,655; 2026 1,503; 2027 1,424; 2028 1,344; 2029 1,211.\nTITLE: (in millions)2025$1,655 20261,503 20271,424 20281,344 20291,211\nTITLE: (in millions)\nTEXT: Amortization expense relating to intangible assets for the years ended December 31, 2024, 2023 and 2022 was $1.7 billion, $1.6 billion and $1.3 billion, respectively.\nTITLE: 7. Medical Costs Payable\nTEXT: The following table shows the components of the change in medical costs payable for the years ended December 31: (in millions)202420232022Medical costs payable, beginning of period$32,395 $29,056 $24,483 Acquisitions (dispositions), net(755)1 308 Reported medical costs:Current year264,885 242,734 211,252 Prior years(700)(840)(410)Total reported medical costs264,185 241,894 210,842 Medical payments:Payments for current year(231,890)(211,380)(184,049)Payments for prior years(29,532)(27,176)(22,528)Total medical payments(261,422)(238,556)(206,577)Less: medical costs payable included within businesses held for sale(179)— — Medical costs payable, end of period$34,224 $32,395 $29,056\nTABLE: TABLE_ROW: Medical costs payable, beginning of period — 2024: 32,395; 2023: 29,056; 2022: 24,483\nTABLE_ROW: Acquisitions (dispositions), net — 2024: (755); 2023: 1; 2022: 308\nTABLE_ROW: Current year — 2024: 264,885; 2023: 242,734; 2022: 211,252\nTABLE_ROW: Prior years — 2024: (700); 2023: (840); 2022: (410)\nTABLE_ROW: Total reported medical costs — 2024: 264,185; 2023: 241,894; 2022: 210,842\nTABLE_ROW: Payments for current year — 2024: (231,890); 2023: (211,380); 2022: (184,049)\nTABLE_ROW: Payments for prior years — 2024: (29,532); 2023: (27,176); 2022: (22,528)\nTABLE_ROW: Total medical payments — 2024: (261,422); 2023: (238,556); 2022: (206,577)\nTABLE_ROW: Less: medical costs payable included within businesses held for sale — 2024: (179)\nTABLE_ROW: Medical costs payable, end of period — 2024: 34,224; 2023: 32,395; 2022: 29,056\nTITLE: (in millions)202420232022\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: For the years ended December 31, 2024, 2023 and 2022, prior years’ medical cost reserve development included no individual factors that were significant. Medical costs payable included IBNR of $23.7 billion and $22.3 billion at December 31, 2024 and 2023, respectively. Substantially all of the IBNR balance as of December 31, 2024 relates to the current year.\nTEXT: The following is information about incurred and paid medical cost development as of December 31, 2024: Net Incurred Medical Costs (in millions)For the Years Ended December 31,Year202320242023$242,734 $242,156 2024264,885 Total$507,041 Net Cumulative Medical Payments (in millions)For the Years Ended December 31,Year202320242023$(211,380)$(240,112)2024(231,890)Total(472,002)Net remaining outstanding liabilities prior to 2023119 Acquisitions (dispositions), net(755)Medical costs payable included within businesses held for sale(179)Total medical costs payable$34,224\nTABLE: TABLE: (in millions) For the Years Ended December 31,; Year 2023 2024; 2023 $ 242,734 $ 242,156; 2024 264,885; Total $ 507,041; (in millions) For the Years Ended December 31,; Year 2023 2024; 2023 $ (211,380) $ (240,112); 2024 (231,890); Total (472,002); Net remaining outstanding liabilities prior to 2023 119; Acquisitions (dispositions), net (755); Medical costs payable included within businesses held for sale (179); Total medical costs payable $ 34,224.\nTITLE: Net Incurred Medical Costs\nTITLE: (in millions)For the Years Ended December 31,\nTITLE: (in millions)\nTITLE: For the Years Ended December 31,\nTITLE: Year20232024\nTITLE: Year\nTITLE: 2023\nTITLE: 2024\nTITLE: Net Cumulative Medical Payments\nTITLE: (in millions)For the Years Ended December 31,\nTITLE: (in millions)\nTITLE: For the Years Ended December 31,\nTITLE: Year20232024\nTITLE: Year\nTITLE: 2023\nTITLE: 2024\n"
    },
    {
      "cluster": 18,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nterm, long, debt, december, short, borrowings, commercial, paper, follows, carrying\n\nTITLE: 8. Short-Term Borrowings and Long-Term Debt\nTEXT: Short-term borrowings and senior unsecured long-term debt consisted of commercial paper and notes as follows: Carrying Value as of December 31,Carrying Value as of December 31,(in millions, except percentages)20242023(continued)20242023Commercial paper$1,300 $1,088 $1,000 4.625%, Jul 2035971 1,014 $750 3.5%, Feb 2024— 750 $850 5.8%, Mar 2036838 838 $1,000 0.55%, May 2024— 999 $500 6.5%, Jun 2037492 491 $750 2.375%, Aug 2024— 750 $650 6.625%, Nov 2037641 640 $500 5%, Oct 2024— 499 $1,100 6.875%, Feb 20381,079 1,078 $2,000 3.75%, Jul 20251,999 1,997 $1,250 3.5%, Aug 20391,243 1,242 $750 5.15%, Oct 2025749 748 $1,000 2.75%, May 2040970 968 $300 3.7%, Dec 2025300 299 $300 5.7%, Oct 2040296 296 $500 1.25%, Jan 2026499 498 $350 5.95%, Feb 2041346 346 $1,000 3.1%, Mar 2026999 998 $1,500 3.05%, May 20411,485 1,484 $1,000 1.15%, May 2026953 924 $600 4.625%, Nov 2041590 590 $500 floating rate, Jul 2026499 — $502 4.375%, Mar 2042487 486 $650 4.75%, Jul 2026648 — $625 3.95%, Oct 2042610 609 $750 3.45%, Jan 2027749 748 $750 4.25%, Mar 2043737 736 $500 4.6%, Apr 2027496 — $1,500 5.5%, Jul 20441,475 — $625 3.375%, Apr 2027623 622 $2,000 4.75%, Jul 20451,976 1,975 $600 3.7%, May 2027598 598 $750 4.2%, Jan 2047739 739 $950 2.95%, Oct 2027946 944 $725 4.25%, Apr 2047718 718 $1,000 5.25%, Feb 2028998 1,011 $950 3.75%, Oct 2047935 935 $1,150 3.85%, Jun 20281,147 1,146 $1,350 4.25%, Jun 20481,332 1,331 $850 3.875%, Dec 2028847 846 $1,100 4.45%, Dec 20481,087 1,087 $1,250 4.25%, Jan 20291,221 1,238 $1,250 3.7%, Aug 20491,237 1,236 $400 4.7%, Apr 2029398 — $1,250 2.9%, May 20501,212 1,211 $900 4%, May 2029854 862 $2,000 3.25%, May 20511,972 1,972 $1,000 2.875%, Aug 2029902 908 $2,000 4.75%, May 20521,966 1,966 $1,250 4.8%, Jan 20301,225 — $2,000 5.875%, Feb 20531,968 1,968 $1,250 5.3%, Feb 20301,243 1,275 $2,000 5.05%, Apr 20531,969 1,969 $1,250 2%, May 20301,240 1,238 $1,750 5.375%, Apr 20541,729 — $1,000 4.9%, Apr 2031982 — $2,750 5.625%, Jul 20542,724 — $1,500 2.3%, May 20311,271 1,290 $1,250 3.875%, Aug 20591,229 1,229 $1,500 4.95%, Jan 20321,489 — $1,000 3.125%, May 2060967 966 $1,500 4.2%, May 20321,372 1,412 $1,000 4.95%, May 2062981 981 $2,000 5.35%, Feb 20331,966 2,046 $1,500 6.05%, Feb 20631,466 1,466 $1,500 4.5%, Apr 20331,410 1,463 $1,750 5.2%, Apr 20631,710 1,709 $1,250 5%, Apr 20341,214 — $1,100 5.5%, Apr 20641,085 — $2,000 5.15%, Jul 20341,959 — $1,850 5.75%, Jul 20641,822 — Total short-term borrowings and long-term debt$76,180 $61,473\nTABLE: TABLE: Carrying Value as of December 31, Carrying Value as of December 31,; (in millions, except percentages) 2024 2023 (continued) 2024 2023; Commercial paper $ 1,300 $ 1,088 $1,000 4.625%, Jul 2035 971 1,014; $750 3.5%, Feb 2024 — 750 $850 5.8%, Mar 2036 838 838; $1,000 0.55%, May 2024 — 999 $500 6.5%, Jun 2037 492 491; $750 2.375%, Aug 2024 — 750 $650 6.625%, Nov 2037 641 640; $500 5%, Oct 2024 — 499 $1,100 6.875%, Feb 2038 1,079 1,078; $2,000 3.75%, Jul 2025 1,999 1,997 $1,250 3.5%, Aug 2039 1,243 1,242; $750 5.15%, Oct 2025 749 748 $1,000 2.75%, May 2040 970 968; $300 3.7%, Dec 2025 300 299 $300 5.7%, Oct 2040 296 296; $500 1.25%, Jan 2026 499 498 $350 5.95%, Feb 2041 346 346; $1,000 3.1%, Mar 2026 999 998 $1,500 3.05%, May 2041 1,485 1,484; $1,000 1.15%, May 2026 953 924 $600 4.625%, Nov 2041 590 590; $500 floating rate, Jul 2026 499 — $502 4.375%, Mar 2042 487 486; $650 4.75%, Jul 2026 648 — $625 3.95%, Oct 2042 610 609; $750 3.45%, Jan 2027 749 748 $750 4.25%, Mar 2043 737 736; $500 4.6%, Apr 2027 496 — $1,500 5.5%, Jul 2044 1,475 —; $625 3.375%, Apr 2027 623 622 $2,000 4.75%, Jul 2045 1,976 1,975; $600 3.7%, May 2027 598 598 $750 4.2%, Jan 2047 739 739; $950 2.95%, Oct 2027 946 944 $725 4.25%, Apr 2047 718 718; $1,000 5.25%, Feb 2028 998 1,011 $950 3.75%, Oct 2047 935 935; $1,150 3.85%, Jun 2028 1,147 1,146 $1,350 4.25%, Jun 2048 1,332 1,331; $850 3.875%, Dec 2028 847 846 $1,100 4.45%, Dec 2048 1,087 1,087; $1,250 4.25%, Jan 2029 1,221 1,238 $1,250 3.7%, Aug 2049 1,237 1,236; $400 4.7%, Apr 2029 398 — $1,250 2.9%, May 2050 1,212 1,211; $900 4%, May 2029 854 862 $2,000 3.25%, May 2051 1,972 1,972; $1,000 2.875%, Aug 2029 902 908 $2,000 4.75%, May 2052 1,966 1,966; $1,250 4.8%, Jan 2030 1,225 — $2,000 5.875%, Feb 2053 1,968 1,968; $1,250 5.3%, Feb 2030 1,243 1,275 $2,000 5.05%, Apr 2053 1,969 1,969; $1,250 2%, May 2030 1,240 1,238 $1,750 5.375%, Apr 2054 1,729 —; $1,000 4.9%, Apr 2031 982 — $2,750 5.625%, Jul 2054 2,724 —; $1,500 2.3%, May 2031 1,271 1,290 $1,250 3.875%, Aug 2059 1,229 1,229; $1,500 4.95%, Jan 2032 1,489 — $1,000 3.125%, May 2060 967 966; $1,500 4.2%, May 2032 1,372 1,412 $1,000 4.95%, May 2062 981 981; $2,000 5.35%, Feb 2033 1,966 2,046 $1,500 6.05%, Feb 2063 1,466 1,466; $1,500 4.5%, Apr 2033 1,410 1,463 $1,750 5.2%, Apr 2063 1,710 1,709; $1,250 5%, Apr 2034 1,214 — $1,100 5.5%, Apr 2064 1,085 —; $2,000 5.15%, Jul 2034 1,959 — $1,850 5.75%, Jul 2064 1,822 —; Total short-term borrowings and long-term debt $ 76,180 $ 61,473.\nTITLE: Carrying Value as of December 31,Carrying Value as of December 31,\nTITLE: Carrying Value as of December 31,\nTITLE: (in millions, except percentages)20242023(continued)20242023\nTITLE: (in millions, except percentages)\nTITLE: 2024\nTITLE: 2023\nTITLE: (continued)\nTITLE: 2024\nTITLE: 2023\nTEXT: The Company’s long-term debt obligations also included $0.7 billion and $1.1 billion of other financing obligations, of which $197 million and $188 million were current as of December 31, 2024 and 2023, respectively.\nTEXT: Maturities of short-term borrowings and long-term debt for the years ending December 31 are as follows: (in millions)2025$4,548 20263,756 20273,531 20283,106 20293,656 Thereafter59,908\nTABLE: TABLE: 2025 $ 4,548; 2026 3,756; 2027 3,531; 2028 3,106; 2029 3,656; Thereafter 59,908.\nTITLE: (in millions)2025$4,548 20263,756 20273,531 20283,106 20293,656 Thereafter59,908\nTITLE: (in millions)\n"
    },
    {
      "cluster": 19,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nincome, december, provision, taxes, rate, credit, company, facilities, based, bank\n\nTITLE: Short-Term Borrowings\nTEXT: Commercial paper consists of short-duration, senior unsecured debt privately placed on a discount basis through broker-dealers. As of December 31, 2024, the Company’s outstanding commercial paper had a weighted-average annual interest rate of 4.4%.\nTEXT: The Company has $7.0 billion five-year, $7.0 billion three-year and $7.0 billion 364-day revolving bank credit facilities with 26 banks, which mature in December 2029, December 2027 and December 2025, respectively. These facilities provide full liquidity support for the Company’s commercial paper program and are available for general corporate purposes. As of December 31, 2024, no amounts had been drawn on any of the bank credit facilities. The annual interest rates, which are variable based on term, are calculated based on one-month term Secured Overnight Financing Rate (SOFR) plus a SOFR Adjustment of 10 basis points plus a credit spread based on the Company’s senior unsecured credit ratings. If amounts had been drawn on the bank credit facilities as of December 31, 2024, annual interest rates would have ranged from 4.9% to 7.5%.\nTITLE: Debt Covenants\nTEXT: As of December 31, 2024, the Company was in compliance with the various covenants under its bank credit facilities.\nTITLE: 9. Income Taxes\nTEXT: The current income tax provision reflects the tax consequences of revenues and expenses currently taxable or deductible on various income tax returns for the year reported. The deferred income tax provision or benefit generally reflects the net change in deferred income tax assets and liabilities during the year, excluding any deferred income tax assets and liabilities of acquired businesses.\nTEXT: The components of income before income taxes, based upon tax jurisdiction, for the years ended December 31 are as follows:\nTEXT: (in millions)202420232022Income before income taxes: Domestic$28,264 $29,210 $26,685 Foreign(8,193)(98)(342)Total income before income taxes$20,071 $29,112 $26,343\nTABLE: TABLE_ROW: Domestic — 2024: 28,264; 2023: 29,210; 2022: 26,685\nTABLE_ROW: Foreign — 2024: (8,193); 2023: (98); 2022: (342)\nTABLE_ROW: Total income before income taxes — 2024: 20,071; 2023: 29,112; 2022: 26,343\nTITLE: (in millions)202420232022\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: The components of the provision for income taxes for the years ended December 31 are as follows:(in millions)202420232022Current Provision: Federal$3,453 $4,418 $4,842 State and local416 716 855 Foreign1,256 1,079 680 Total current provision5,125 6,213 6,377 Deferred benefit(296)(245)(673)Total provision for income taxes$4,829 $5,968 $5,704\nTABLE: TABLE_ROW: Federal — 2024: 3,453; 2023: 4,418; 2022: 4,842\nTABLE_ROW: State and local — 2024: 416; 2023: 716; 2022: 855\nTABLE_ROW: Foreign — 2024: 1,256; 2023: 1,079; 2022: 680\nTABLE_ROW: Total current provision — 2024: 5,125; 2023: 6,213; 2022: 6,377\nTABLE_ROW: Deferred benefit — 2024: (296); 2023: (245); 2022: (673)\nTABLE_ROW: Total provision for income taxes — 2024: 4,829; 2023: 5,968; 2022: 5,704\nTITLE: (in millions)202420232022\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: The reconciliation of the tax provision at the U.S. federal statutory rate to the provision for income taxes and the effective tax rate for the years ended December 31 is as follows:(in millions, except percentages)202420232022Tax provision at the U.S. federal statutory rate$4,215 21.0 %$6,114 21.0 %$5,532 21.0 %State income taxes, net of federal benefit343 1.7 567 2.0 621 2.4 Share-based awards - excess tax benefit(96)(0.5)(75)(0.3)(110)(0.4)Non-deductible compensation171 0.9 174 0.6 150 0.6 Foreign rate differential(369)(1.8)(442)(1.5)(265)(1.0)Tax effect of dispositions and other strategic transactions1,215 6.1 (29)(0.1)(215)(0.8)Other, net(650)(3.3)(341)(1.2)(9)(0.1)Provision for income taxes$4,829 24.1 %$5,968 20.5 %$5,704 21.7 %\nTABLE: TABLE_ROW: Tax provision at the U.S. federal statutory rate — 2024: 4,215; 2023: 21.0; 2022: 6,114\nTABLE_ROW: State income taxes, net of federal benefit — 2024: 343; 2023: 1.7; 2022: 567\nTABLE_ROW: Share-based awards - excess tax benefit — 2024: (96); 2023: (0.5); 2022: (75)\nTABLE_ROW: Non-deductible compensation — 2024: 171; 2023: 0.9; 2022: 174\nTABLE_ROW: Foreign rate differential — 2024: (369); 2023: (1.8); 2022: (442)\nTABLE_ROW: Tax effect of dispositions and other strategic transactions — 2024: 1,215; 2023: 6.1; 2022: (29)\nTABLE_ROW: Other, net — 2024: (650); 2023: (3.3); 2022: (341)\nTABLE_ROW: Provision for income taxes — 2024: 4,829; 2023: 24.1; 2022: 5,968\nTITLE: (in millions, except percentages)202420232022\nTITLE: (in millions, except percentages)\nTITLE: 2024\nTITLE: 2023\n"
    },
    {
      "cluster": 20,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ndeferred, income, assets, loss, carryforwards, liabilities, operating, december, allowances, federal\n\nTITLE: 2022\nTEXT: Deferred income tax assets and liabilities are recognized for the differences between the financial and income tax reporting bases of assets and liabilities based on enacted tax rates and laws. The components of deferred income tax assets and liabilities as of December 31 are as follows:(in millions)20242023Deferred income tax assets: Accrued expenses and allowances$1,055 $754 U.S. federal and state net operating loss carryforwards442 417 Share-based compensation189 173 Nondeductible liabilities343 329 Non-U.S. tax loss carryforwards21 1,061 Lease liability846 930 Net unrealized losses on investments669 586 Other-domestic597 327 Other-non-U.S.59 484 Subtotal4,221 5,061 Less: valuation allowances(397)(366)Total deferred income tax assets3,824 4,695 Deferred income tax liabilities:U.S. federal and state intangible assets(4,479)(3,712)Non-U.S. goodwill and intangible assets(82)(731)Capitalized software(288)(415)Depreciation and amortization(400)(371)Prepaid expenses(374)(326)Outside basis in partnerships(960)(811)Lease right-of-use asset(833)(914)Other-non-U.S.(28)(436)Total deferred income tax liabilities(7,444)(7,716)Net deferred income tax liabilities$(3,620)$(3,021)\nTABLE: TABLE_ROW: Accrued expenses and allowances — 2024: 1,055; 2023: 754\nTABLE_ROW: U.S. federal and state net operating loss carryforwards — 2024: 442; 2023: 417\nTABLE_ROW: Share-based compensation — 2024: 189; 2023: 173\nTABLE_ROW: Nondeductible liabilities — 2024: 343; 2023: 329\nTABLE_ROW: Non-U.S. tax loss carryforwards — 2024: 21; 2023: 1,061\nTABLE_ROW: Lease liability — 2024: 846; 2023: 930\nTABLE_ROW: Net unrealized losses on investments — 2024: 669; 2023: 586\nTABLE_ROW: Other-domestic — 2024: 597; 2023: 327\nTABLE_ROW: Other-non-U.S. — 2024: 59; 2023: 484\nTABLE_ROW: Subtotal — 2024: 4,221; 2023: 5,061\nTABLE_ROW: Less: valuation allowances — 2024: (397); 2023: (366)\nTABLE_ROW: Total deferred income tax assets — 2024: 3,824; 2023: 4,695\nTABLE_ROW: U.S. federal and state intangible assets — 2024: (4,479); 2023: (3,712)\nTABLE_ROW: Non-U.S. goodwill and intangible assets — 2024: (82); 2023: (731)\nTABLE_ROW: Capitalized software — 2024: (288); 2023: (415)\nTABLE_ROW: Depreciation and amortization — 2024: (400); 2023: (371)\nTABLE_ROW: Prepaid expenses — 2024: (374); 2023: (326)\nTABLE_ROW: Outside basis in partnerships — 2024: (960); 2023: (811)\nTABLE_ROW: Lease right-of-use asset — 2024: (833); 2023: (914)\nTABLE_ROW: Other-non-U.S. — 2024: (28); 2023: (436)\nTABLE_ROW: Total deferred income tax liabilities — 2024: (7,444); 2023: (7,716)\nTABLE_ROW: Net deferred income tax liabilities — 2024: (3,620); 2023: (3,021)\nTITLE: (in millions)20242023\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\nTEXT: Non-U.S. tax loss carryforwards\nTEXT: Valuation allowances are provided when it is considered more likely than not deferred tax assets will not be realized. The valuation allowances primarily relate to future tax benefits on certain federal, state and non-U.S. net operating loss carryforwards. Substantially all of the federal net operating loss carryforwards have indefinite carryforward periods; state net operating loss carryforwards expire beginning in 2025 through 2044, with some having an indefinite carryforward period. Additionally, as of December 31, 2024, the Company has historical non-U.S. net operating loss carryforwards for which a deferred tax asset and valuation allowance of $4.1 billion are not established because realization of the loss carryforwards is remote.\nTEXT: As of December 31, 2024, except for subsidiaries held for sale, the Company’s undistributed earnings from non-U.S. subsidiaries are intended to be indefinitely reinvested in non-U.S. operations, and therefore no U.S. deferred taxes have been recorded. Taxes payable on the remittance of such earnings would be minimal.\nTEXT: A reconciliation of the beginning and ending amount of unrecognized tax benefits as of December 31 is as follows: (in millions)202420232022Gross unrecognized tax benefits, beginning of period$3,716 $3,081 $2,310 Gross increases: Current year tax positions578 782 586 Prior year tax positions10 97 206 Gross decreases: Prior year tax positions(121)(212)(21)Statute of limitations lapses and settlements(60)(32)— Gross unrecognized tax benefits, end of period$4,123 $3,716 $3,081\nTABLE: TABLE_ROW: Gross unrecognized tax benefits, beginning of period — 2024: 3,716; 2023: 3,081; 2022: 2,310\nTABLE_ROW: Current year tax positions — 2024: 578; 2023: 782; 2022: 586\nTABLE_ROW: Prior year tax positions — 2024: 10; 2023: 97; 2022: 206\nTABLE_ROW: Prior year tax positions — 2024: (121); 2023: (212); 2022: (21)\nTABLE_ROW: Statute of limitations lapses and settlements — 2024: (60); 2023: (32)\nTABLE_ROW: Gross unrecognized tax benefits, end of period — 2024: 4,123; 2023: 3,716; 2022: 3,081\nTITLE: (in millions)202420232022\nTITLE: (in millions)\nTITLE: 2024\nTITLE: 2023\n"
    },
    {
      "cluster": 21,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, share, december, dividends, capital, program, statutory, paid, income, these\n\nTITLE: 2022\nTEXT: The Company believes it is reasonably possible its liability for unrecognized tax benefits will decrease in the next twelve months by $101 million as a result of audit settlements and the expiration of statutes of limitations.\nTEXT: The Company classifies net interest and penalties associated with uncertain income tax positions as income taxes within its Consolidated Statements of Operations. During the years ended December 31, 2024, 2023 and 2022, the Company recognized $210 million, $177 million and $64 million of net interest and penalties, respectively. The Company had $637 million and $430 million of accrued interest and penalties for uncertain tax positions as of December 31, 2024 and 2023, respectively. These amounts are not included in the reconciliation above. As of December 31, 2024, there were $2.0 billion of unrecognized tax benefits which, if recognized, would affect the effective tax rate.\nTEXT: The Company currently files income tax returns in the United States, various states and localities and non-U.S. jurisdictions. The U.S. Internal Revenue Service (IRS) has completed exams on the consolidated income tax returns for fiscal years 2016 and prior. The Company’s 2017 through 2020 tax years are under review by the IRS under its Compliance Assurance Program. The Company is no longer subject to state income tax examinations prior to the 2015 tax year. The Company is subject to examination in non-U.S. jurisdictions for years 2015 and forward.\nTITLE: 10. Shareholders' Equity\nTITLE: Regulatory Capital and Dividend Restrictions\nTEXT: The Company’s regulated insurance and HMO subsidiaries are subject to regulations and standards in their respective jurisdictions. These standards, among other things, require these subsidiaries to maintain specified levels of statutory capital, as defined by each jurisdiction, and restrict the timing and amount of dividends and other distributions which may be paid to their parent companies. In the United States, most of these state regulations and standards are generally consistent with model regulations established by the NAIC. These standards generally permit dividends to be paid from statutory unassigned surplus of the regulated subsidiary and are limited based on the regulated subsidiary’s level of statutory net income and statutory capital and surplus. These dividends are referred to as “ordinary dividends” and generally may be paid without prior regulatory approval. If the dividend, together with other dividends paid within the preceding twelve months, exceeds a specified statutory limit or is paid from sources other than earned surplus, it is generally considered an “extraordinary dividend” and must receive prior regulatory approval.\nTEXT: For the year ended December 31, 2024, the Company’s domestic insurance and HMO subsidiaries paid their parent companies dividends of $9.2 billion, including $2.6 billion of extraordinary dividends. For the year ended December 31, 2023, the Company’s domestic insurance and HMO subsidiaries paid their parent companies dividends of $8.0 billion, including $4.9 billion of extraordinary dividends.\nTEXT: The Company's financially regulated subsidiaries had estimated aggregate statutory capital and surplus of $37.8 billion as of December 31, 2024. The estimated statutory capital and surplus necessary to satisfy regulatory requirements of the Company's financially regulated subsidiaries was approximately $20.4 billion as of December 31, 2024.\nTEXT: Optum Bank must meet minimum capital requirements of the FDIC under the capital adequacy rules to which it is subject. At December 31, 2024, the Company believes Optum Bank met the FDIC requirements to be considered “Well Capitalized.”\nTITLE: Share Repurchase Program\nTEXT: Under its Board of Directors’ authorization, the Company maintains a share repurchase program. The objectives of the share repurchase program are to optimize the Company’s capital structure and cost of capital, thereby improving returns to shareholders, as well as to offset the dilutive impact of share-based awards. Repurchases may be made from time to time in open market purchases or other types of transactions (including prepaid or structured share repurchase programs), subject to certain restrictions. In June 2024, the Board of Directors amended the Company’s share repurchase program to authorize the\nTEXT: repurchase of up to 35 million shares of its common stock, in addition to all remaining shares authorized to be repurchased under the Board’s 2018 renewal of the program. The Board of Directors from time to time may further amend the share repurchase program in order to increase the authorized number of shares which may be repurchased under the program.\nTEXT: A summary of common share repurchases for the years ended December 31, 2024 and 2023 is as follows:Years Ended December 31,(in millions, except per share data)20242023Common share repurchases, shares17 16 Common share repurchases, average price per share$529.85 $493.79 Common share repurchases, aggregate cost$8,942 $8,000 Board authorized shares remaining33 15\nTABLE: TABLE: (in millions, except per share data) 2024 2023; Common share repurchases, shares 17 16; Common share repurchases, average price per share $ 529.85 $ 493.79; Common share repurchases, aggregate cost $ 8,942 $ 8,000; Board authorized shares remaining 33 15.\nTITLE: Years Ended December 31,\nTITLE: (in millions, except per share data)20242023\nTITLE: (in millions, except per share data)\nTITLE: 2024\nTITLE: 2023\n"
    },
    {
      "cluster": 22,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nshare, shares, december, based, stock, company, period, compensation, value, restricted\n\nTITLE: Dividends\nTEXT: In June 2024, the Company’s Board of Directors increased the Company’s quarterly cash dividend to shareholders to an annual rate of $8.40 compared to $7.52 per share, which the Company had paid since June 2023. Declaration and payment of future quarterly dividends is at the discretion of the Board and may be adjusted as business needs or market conditions change.\nTEXT: The following table provides details of the Company’s 2024 dividend payments:Payment DateAmount per ShareTotal Amount Paid(in millions)March 19$1.88 $1,729 June 252.10 1,935 September 242.10 1,937 December 172.10 1,932\nTABLE: TABLE: Payment Date Amount per Share Total Amount Paid; March 19 $ 1.88 $ 1,729; June 25 2.10 1,935; September 24 2.10 1,937; December 17 2.10 1,932.\nTITLE: Payment DateAmount per ShareTotal Amount Paid\nTITLE: Payment Date\nTITLE: Amount per Share\nTITLE: Total Amount Paid\nTITLE: (in millions)\nTITLE: 11. Share-Based Compensation\nTEXT: The Company’s outstanding share-based awards consist mainly of non-qualified stock options and restricted shares. As of December 31, 2024, the Company had 48 million shares available for future grants of share-based awards under the 2020 Stock Incentive Plan. As of December 31, 2024, there were 16 million shares of common stock available for issuance under the ESPP.\nTITLE: Stock Options\nTEXT: Stock option activity for the year ended December 31, 2024 is summarized in the table below:SharesWeighted-AverageExercisePriceWeighted-AverageRemainingContractual LifeAggregateIntrinsic Value (in millions) (in years)(in millions)Outstanding at beginning of period21 $320 Granted3 522 Exercised(6)253 Forfeited(1)480 Outstanding at end of period17 370 5.6$2,338 Exercisable at end of period10 298 4.22,115 Vested and expected to vest, end of period17 368 5.52,335\nTABLE: TABLE: Shares Weighted-AverageExercisePrice Weighted-AverageRemainingContractual Life AggregateIntrinsic Value; (in millions) (in years) (in millions); Outstanding at beginning of period 21 $ 320; Granted 3 522; Exercised (6) 253; Forfeited (1) 480; Outstanding at end of period 17 370 5.6 $ 2,338; Exercisable at end of period 10 298 4.2 2,115; Vested and expected to vest, end of period 17 368 5.5 2,335.\nTITLE: SharesWeighted-AverageExercisePriceWeighted-AverageRemainingContractual LifeAggregateIntrinsic Value\nTITLE: Shares\nTITLE: Weighted-AverageExercisePrice\nTITLE: Weighted-AverageRemainingContractual Life\nTITLE: AggregateIntrinsic Value\nTITLE: (in millions) (in years)(in millions)\nTITLE: (in millions)\nTITLE: (in years)\nTITLE: (in millions)\nTITLE: Restricted Shares\nTEXT: Restricted share activity for the year ended December 31, 2024 is summarized in the table below:(shares in millions)SharesWeighted-AverageGrant DateFair Valueper ShareNonvested at beginning of period4 $449 Granted2 523 Vested(2)435 Nonvested at end of period4 489\nTABLE: TABLE: (shares in millions) Shares Weighted-AverageGrant DateFair Valueper Share; Nonvested at beginning of period 4 $ 449; Granted 2 523; Vested (2) 435; Nonvested at end of period 4 489.\nTITLE: (shares in millions)SharesWeighted-AverageGrant DateFair Valueper Share\nTITLE: (shares in millions)\nTITLE: Shares\nTITLE: Weighted-AverageGrant DateFair Valueper Share\nTEXT: Other Share-Based Compensation Data(in millions, except per share amounts)For the Years Ended December 31,202420232022Stock OptionsWeighted-average grant date fair value of shares granted, per share$138 $134 $116 Total intrinsic value of stock options exercised1,886 1,325 1,419 Restricted SharesWeighted-average grant date fair value of shares granted, per share523 493 483 Total fair value of restricted shares vested690 803 760 Employee Stock Purchase PlanNumber of shares purchased1 1 1 Share-Based Compensation ItemsShare-based compensation expense, before tax$1,018 $1,059 $925 Share-based compensation expense, net of tax effects896 937 836 Income tax benefit realized from share-based award exercises216 231 207\nTABLE: TABLE: (in millions, except per share amounts) For the Years Ended December 31,; 2024 2023 2022; Weighted-average grant date fair value of shares granted, per share $ 138 $ 134 $ 116; Total intrinsic value of stock options exercised 1,886 1,325 1,419; Weighted-average grant date fair value of shares granted, per share 523 493 483; Total fair value of restricted shares vested 690 803 760; Number of shares purchased 1 1 1; Share-based compensation expense, before tax $ 1,018 $ 1,059 $ 925; Share-based compensation expense, net of tax effects 896 937 836; Income tax benefit realized from share-based award exercises 216 231 207.\nTITLE: (in millions, except per share amounts)For the Years Ended December 31,\nTITLE: (in millions, except per share amounts)\nTITLE: For the Years Ended December 31,\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTITLE: Stock Options\nTITLE: Restricted Shares\nTITLE: Employee Stock Purchase Plan\nTITLE: Share-Based Compensation Items\nTEXT: (in millions, except years)December 31, 2024Unrecognized compensation expense related to share awards$1,099 Weighted-average years to recognize compensation expense1.3\nTABLE: TABLE: (in millions, except years) December 31, 2024; Unrecognized compensation expense related to share awards $ 1,099; Weighted-average years to recognize compensation expense 1.3.\nTITLE: (in millions, except years)December 31, 2024\nTITLE: (in millions, except years)\nTITLE: December 31, 2024\n"
    },
    {
      "cluster": 23,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, december, expected, lease, based, other, operating, regulatory, matters, total\n\nTITLE: Share-Based Compensation Recognition and Estimates\nTEXT: The principal assumptions the Company used in calculating grant-date fair value for stock options were as follows:For the Years Ended December 31, 202420232022Risk-free interest rate3.6% - 4.4%3.8% - 4.6%1.9% - 4.3%Expected volatility25.5% - 30.7%29.7% - 30.6%30.6% - 30.8%Expected dividend yield1.4% - 1.5%1.3% - 1.5%1.2%Forfeiture rate5.0%5.0%5.0%Expected life in years4.64.64.7\nTABLE: TABLE: 2024 2023 2022; Risk-free interest rate 3.6% - 4.4% 3.8% - 4.6% 1.9% - 4.3%; Expected volatility 25.5% - 30.7% 29.7% - 30.6% 30.6% - 30.8%; Expected dividend yield 1.4% - 1.5% 1.3% - 1.5% 1.2%; Forfeiture rate 5.0% 5.0% 5.0%; Expected life in years 4.6 4.6 4.7.\nTITLE: For the Years Ended December 31,\nTITLE: 202420232022\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: Risk-free interest rates are based on U.S. Treasury yields in effect at the time of grant. Expected volatilities are based on the historical volatility of the Company’s common stock and the implied volatility from exchange-traded options on the Company’s common stock. Expected dividend yields are based on the per share cash dividend paid by the Company. The Company uses historical data to estimate option exercises and forfeitures within the valuation model. The expected lives of options granted represent the periods of time the awards granted are expected to be outstanding based on historical exercise patterns.\nTITLE: Other Employee Benefit Plans\nTEXT: The Company offers a 401(k) plan for its employees. Compensation expense related to this plan was not material for the years ended December 31, 2024, 2023 and 2022.\nTEXT: In addition, the Company maintains non-qualified, deferred compensation plans, which allow certain members of senior management and executives to defer portions of their salary or bonus. The deferrals are recorded within long-term investments\nTEXT: with an approximately equal amount in other liabilities in the Consolidated Balance Sheets. The total deferrals are distributable based upon termination of employment or other periods, as elected under each plan and were $2.1 billion and $1.9 billion as of December 31, 2024 and 2023, respectively.\nTITLE: 12. Commitments and Contingencies\nTITLE: Leases\nTEXT: Operating lease costs, including immaterial variable and short-term lease costs, were $1.4 billion, $1.4 billion and $1.3 billion for the years ended December 31, 2024, 2023 and 2022, respectively. Cash payments made on the Company’s operating lease liabilities were $1.1 billion, $1.1 billion and $1.0 billion for the years ended December 31, 2024, 2023 and 2022, respectively, which were classified within operating activities in the Consolidated Statements of Cash Flows. As of December 31, 2024, the Company’s weighted-average remaining lease term and weighted-average discount rate for its operating leases were 9.5 years and 4.7%, respectively.\nTEXT: As of December 31, 2024, future minimum annual lease payments under all non-cancelable operating leases were as follows: (in millions)Future Minimum Lease Payments2025$1,014 2026876 2027688 2028568 2029583 Thereafter2,465 Total future minimum lease payments6,194 Less imputed interest(1,305)Total$4,889\nTABLE: TABLE: (in millions) Future Minimum Lease Payments; 2025 $ 1,014; 2026 876; 2027 688; 2028 568; 2029 583; Thereafter 2,465; Total future minimum lease payments 6,194; Less imputed interest (1,305); Total $ 4,889.\nTITLE: (in millions)Future Minimum Lease Payments\nTITLE: (in millions)\nTITLE: Future Minimum Lease Payments\nTITLE: Other Commitments\nTEXT: The Company provides guarantees related to its service level under certain contracts. If minimum standards are not met, the Company may be financially at risk up to a stated percentage of the contracted fee or a stated dollar amount. None of the amounts accrued, paid or charged to income for service level guarantees were material as of December 31, 2024, 2023 or 2022.\nTITLE: Pending Acquisitions\nTEXT: As of December 31, 2024, the Company has entered into agreements to acquire companies in the health care sector, subject to regulatory approval and other customary closing conditions. The total anticipated capital required for these acquisitions, excluding the payoff of acquired indebtedness, is approximately $4 billion.\nTITLE: Legal Matters\nTEXT: The Company is frequently made party to a variety of legal actions and regulatory inquiries, including class actions and suits brought by members, care providers, consumer advocacy organizations, customers and regulators, relating to the Company’s businesses, including management and administration of health benefit plans and other services. These matters include medical malpractice, employment, intellectual property, antitrust, privacy and contract claims and claims related to health care benefits coverage and other business practices.\nTEXT: The Company records liabilities for its estimates of probable costs resulting from these matters where appropriate. Estimates of costs resulting from legal and regulatory matters involving the Company are inherently difficult to predict, particularly where the matters: involve indeterminate claims for monetary damages or may involve fines, penalties or punitive damages; present novel legal theories or represent a shift in regulatory policy; involve a large number of claimants or regulatory bodies; are in the early stages of the proceedings; or could result in a change in business practices. Accordingly, the Company is often unable to estimate the losses or ranges of losses for those matters where there is a reasonable possibility or it is probable a loss may be incurred.\n"
    },
    {
      "cluster": 24,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncompany, other, assets, sale, held, liabilities, audits, which, related, losses\n\nTITLE: Government Investigations, Audits and Reviews\nTEXT: The Company has been involved or is currently involved in various governmental investigations, audits and reviews. These include routine, regular and special investigations, audits and reviews by CMS, state insurance and health and welfare departments, state attorneys general, the Office of the Inspector General, the Office of Personnel Management, the Office for Civil Rights, the Government Accountability Office, the Federal Trade Commission, U.S. Congressional committees, the U.S. Department of Justice (DOJ), the SEC, the IRS, the U.S. Drug Enforcement Administration, the U.S. Department of Labor, the\nTEXT: FDIC, the Consumer Financial Protection Bureau, the Defense Contract Audit Agency, the Food and Drug Administration and other governmental authorities. Similarly, the Company’s international businesses are also subject to investigations, audits and reviews by applicable foreign governments and other non-U.S. governmental authorities. Certain of the Company’s businesses have been reviewed or are currently under review, including for, among other matters, compliance with coding and other requirements under the Medicare risk-adjustment model. CMS has selected certain of the Company’s local plans for risk adjustment data validation (RADV) audits to validate the coding practices of and supporting documentation maintained by health care providers and such audits may result in retrospective adjustments to payments made to the Company’s health plans. On February 14, 2017, the DOJ announced its decision to pursue certain claims within a lawsuit initially asserted against the Company and filed under seal by a whistleblower in 2011. The whistleblower’s complaint, which was unsealed on February 15, 2017, alleges the Company made improper risk adjustment submissions and violated the False Claims Act. On February 12, 2018, the court granted in part and denied in part the Company’s motion to dismiss. In May 2018, the DOJ moved to dismiss the Company’s counterclaims, which were filed in March 2018, and moved for partial summary judgment. In March 2019, the court denied the government’s motion for partial summary judgment and dismissed the Company’s counterclaims without prejudice. The Company cannot reasonably estimate the outcome which may result from this matter given its procedural status.\nTITLE: 13. Dispositions and Held for Sale\nTEXT: During the year ended December 31, 2024, the Company completed or initiated various business portfolio refinement and asset disposition activities. The Company recorded a loss of $7.1 billion related to the sale of its Brazil operations, of which $4.1 billion related to the impact of cumulative foreign currency translation losses previously included in accumulated other comprehensive loss, and a loss of $1.2 billion related to the reclassification of the Company’s remaining South American operations as held for sale, of which $855 million related to the impact of cumulative foreign currency translation losses.\nTEXT: As these losses relate to our strategic exit of South American markets and include significant losses related to foreign currency translation effects, these losses are included within loss on sale of subsidiary and subsidiaries held for sale on the Consolidated Statement of Operations. The sales of the Company’s remaining South American assets are expected to close within a year, subject to regulatory and other customary closing conditions. Assets and liabilities held for sale have been included within prepaid and other current assets and other current liabilities on the Consolidated Balance Sheet, respectively.\nTEXT: The assets and liabilities of the Brazil and held for sale disposal groups as of the date of the sale and as of December 31, 2024, respectively, were as follows:(in millions)Brazil DispositionBusinesses Held for SaleAssetsCash and cash equivalents$778 $219 Accounts receivable and other current assets515 573Long-term investments788 41Property, equipment and capitalized software1,052 641Deferred tax assets1,035 — Goodwill and other intangible assets317 413Other long-term assets439 231Remeasurement of assets of businesses held for sale to fair value less cost to sell(1)— (1,224)Total assets$4,924 $894 LiabilitiesMedical costs payable$701 $179 Accounts payable and other current liabilities834 338Other long-term liabilities136 504Total liabilities$1,671 $1,021\nTABLE: TABLE: (in millions) Brazil Disposition Businesses Held for Sale; Cash and cash equivalents $ 778 $ 219; Accounts receivable and other current assets 515 573; Long-term investments 788 41; Property, equipment and capitalized software 1,052 641; Deferred tax assets 1,035 —; Goodwill and other intangible assets 317 413; Other long-term assets 439 231; Remeasurement of assets of businesses held for sale to fair value less cost to sell(1) — (1,224); Total assets $ 4,924 $ 894; Medical costs payable $ 701 $ 179; Accounts payable and other current liabilities 834 338; Other long-term liabilities 136 504; Total liabilities $ 1,671 $ 1,021.\nTITLE: (in millions)Brazil DispositionBusinesses Held for Sale\nTITLE: (in millions)\nTITLE: Brazil Disposition\nTITLE: Businesses Held for Sale\nTITLE: Assets\nTEXT: Remeasurement of assets of businesses held for sale to fair value less cost to sell(1)\n"
    },
    {
      "cluster": 25,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ntransactions, these, interests, related, portfolio, refinement, company, other, strategic, total\n\nTITLE: Liabilities\nTEXT: (1) Includes the effect of $855 million of cumulative foreign currency translation losses and $56 million of noncontrolling interests.\nTEXT: As a result of continued portfolio refinement, the Company sold other businesses and assets and entered into strategic transactions. These transactions resulted in total consideration received of $3.0 billion and an additional $1.9 billion of equity method investments related to the valuation of our retained interests in certain transactions. The carrying value for these transactions was $1.0 billion, primarily related to goodwill. The gains from business portfolio refinement, including strategic\nTEXT: transactions, were recorded within operating costs in the Consolidated Statement of Operations and contributed about 80 basis points ($3.3 billion) to the operating cost ratio, nearly half ($1.4 billion) related to Optum Health with the remainder split between UnitedHealthcare ($1.1 billion) and Optum Insight ($800 million). Certain transactions also included various put and call options, which were valued at $630 million and included in other liabilities on the Consolidated Balance Sheet. As of December 31, 2024 the total estimated future obligation under these arrangements if the Company decided or was required to repurchase these interests was up to $3.4 billion.\n"
    },
    {
      "cluster": 26,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\nhealth, care, unitedhealthcare, services, optum, reportable, management, company, segment, revenues\n\nTITLE: 14. Segment Financial Information\nTEXT: Factors used to determine the Company’s reportable segments include the nature of operating activities, economic characteristics, existence of separate senior management teams and the type of information used by the Company’s chief operating decision maker (CODM), which is the Chief Executive Officer, to evaluate its results of operations. Reportable segments with similar economic characteristics, products and services, customers, distribution methods and operational processes which operate in a similar regulatory environment are combined. The CODM uses consolidated expense information and segment earnings from operations to assess performance and determine allocation of resources.\nTEXT: The following is a description of the types of products and services from which each of the Company’s four reportable segments derives its revenues:\nTEXT: •UnitedHealthcare includes the combined results of operations of UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement and UnitedHealthcare Community & State. The businesses share significant common assets, including a contracted network of physicians, health care professionals, hospitals and other facilities, information technology and consumer engagement infrastructure and other resources. UnitedHealthcare Employer & Individual offers an array of consumer-oriented health benefit plans and services for employers and individuals. UnitedHealthcare Medicare & Retirement provides health care coverage and health and well-being services to individuals age 50 and older, addressing their unique needs. UnitedHealthcare Community & State provides diversified health care benefits products and services to state programs caring for the economically disadvantaged, the medically underserved and those without the benefit of employer-funded health care coverage.\nTEXT: •Optum Health focuses on care delivery, including value-based care; care management; wellness and consumer engagement and health financial services. Optum Health is building a comprehensive, connected health care delivery and engagement platform by directly providing high-quality care, helping people manage chronic and complex health needs, and proactively engaging consumers in managing their health through in-person, in-home, virtual and digital clinical platforms.\nTEXT: •Optum Insight brings together advanced analytics, technology and health care expertise to deliver integrated services and solutions. Hospital systems, physicians, health plans, governments, life sciences companies and other organizations depend on Optum Insight to help them improve performance, achieve efficiency, reduce costs, meet compliance mandates and modernize their core operating systems to meet the changing needs of the health system.\nTEXT: •Optum Rx offers pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, purchasing and clinical capabilities, and develops programs in areas such as step therapy, formulary management, drug adherence and disease and drug therapy management. Optum Rx integrates pharmacy and medical care and is positioned to serve patients with complex clinical needs and consumers looking for a better digital pharmacy experience with transparent pricing.\nTEXT: The Company’s accounting policies for reportable segment operations are consistent with those described in the Summary of Significant Accounting Policies (see Note 2). Transactions between reportable segments principally consist of sales of pharmacy care products and services to UnitedHealthcare customers by Optum Rx; care delivery, care management services and certain product offerings sold to UnitedHealthcare by Optum Health; and health information and technology solutions, consulting and other services sold to UnitedHealthcare by Optum Insight. These transactions are recorded at management’s estimate of fair value. Transactions with affiliated customers are eliminated in consolidation. Assets and liabilities jointly used are assigned to each reportable segment using estimates of pro-rata usage. Cash and investments are assigned so each reportable segment has working capital and/or at least minimum specified levels of regulatory capital.\nTEXT: As a percentage of the Company’s total consolidated revenues, premium revenues from CMS were 40%, 40% and 38% for the years ended December 31, 2024, 2023 and 2022, respectively, most of which were generated by UnitedHealthcare Medicare & Retirement and included in the UnitedHealthcare segment. U.S. customer revenue represented approximately 99%, 97% and 97% of consolidated total revenues for 2024, 2023 and 2022, respectively. Long-lived fixed assets located in the United States represented approximately 92% and 82% of the total long-lived fixed assets as of December 31, 2024 and 2023, respectively. The non-U.S. revenues and fixed assets are primarily related to UnitedHealthcare Employer & Individual’s international businesses.\n"
    },
    {
      "cluster": 27,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ntotal, revenues, customers, unaffiliated, income, earnings, premiums, products, services, affiliated\n\nTEXT: The following table presents the reportable segment financial information: Optum (in millions)UnitedHealthcareOptum HealthOptum InsightOptum RxOptum EliminationsOptumCorporate andEliminationsConsolidated2024Revenues - unaffiliated customers:Premiums$286,004 $22,806 $— $— $— $22,806 $— $308,810 Products— 277 174 49,775 — 50,226 — 50,226 Services9,791 16,153 6,466 3,630 — 26,249 — 36,040 Total revenues - unaffiliated customers295,795 39,236 6,640 53,405 — 99,281 — 395,076 Total revenues - affiliated customers— 63,883 11,881 79,512 (4,389)150,887 (150,887)— Investment and other income2,413 2,239 236 314 — 2,789 — 5,202 Total revenues$298,208 $105,358 $18,757 $133,231 $(4,389)$252,957 $(150,887)$400,278 Total operating costs (a)$282,624 $97,588 $15,660 $127,395 $(4,389)$236,254 $(150,887)$367,991 Earnings from operations$15,584 $7,770 $3,097 $5,836 $— $16,703 $— $32,287 Interest expense— — — — — — (3,906)(3,906)Loss on sale of subsidiary and subsidiaries held for sale(8,310)— — — — — — (8,310)Earnings before income taxes$7,274 $7,770 $3,097 $5,836 $— $16,703 $(3,906)$20,071 Total assets$119,009 $96,472 $34,452 $59,086 $— $190,010 $(10,741)$298,278 Purchases of property, equipment and capitalized software781 1,008 1,291 419 — 2,718 — 3,499 Depreciation and amortization889 1,123 1,294 793 — 3,210 — 4,099 2023Revenues - unaffiliated customers:Premiums$269,052 $21,775 $— $— $— $21,775 $— $290,827 Products— 207 162 42,214 — 42,583 — 42,583 Services10,057 14,109 7,760 2,197 — 24,066 — 34,123 Total revenues - unaffiliated customers279,109 36,091 7,922 44,411 — 88,424 — 367,533 Total revenues - affiliated customers— 57,696 10,896 71,484 (3,703)136,373 (136,373)— Investment and other income2,251 1,532 114 192 — 1,838 — 4,089 Total revenues$281,360 $95,319 $18,932 $116,087 $(3,703)$226,635 $(136,373)$371,622 Total operating costs (a)$264,945 $88,759 $14,664 $110,972 $(3,703)$210,692 $(136,373)$339,264 Earnings from operations$16,415 $6,560 $4,268 $5,115 $— $15,943 $— $32,358 Interest expense— — — — — — (3,246)(3,246)Earnings before income taxes$16,415 $6,560 $4,268 $5,115 $— $15,943 $(3,246)$29,112 Total assets$110,943 $89,432 $34,173 $51,266 $— $174,871 $(12,094)$273,720 Purchases of property, equipment and capitalized software866 1,199 974 347 — 2,520 — 3,386 Depreciation and amortization989 1,058 1,229 696 — 2,983 — 3,972 2022Revenues - unaffiliated customers:Premiums$238,783 $18,374 $— $— $— $18,374 $— $257,157 Products— 72 180 37,172 — 37,424 — 37,424 Services10,035 10,917 4,996 1,603 — 17,516 — 27,551 Total revenues - unaffiliated customers248,818 29,363 5,176 38,775 — 73,314 — 322,132 Total revenues - affiliated customers— 40,883 9,288 60,936 (2,760)108,347 (108,347)— Investment and other income923 928 117 62 — 1,107 — 2,030 Total revenues$249,741 $71,174 $14,581 $99,773 $(2,760)$182,768 $(108,347)$324,162 Total operating costs (a)$235,362 $65,142 $10,993 $95,337 $(2,760)$168,712 $(108,347)$295,727 Earnings from operations$14,379 $6,032 $3,588 $4,436 $— $14,056 $— $28,435 Interest expense— — — — — — (2,092)(2,092)Earnings before income taxes$14,379 $6,032 $3,588 $4,436 $— $14,056 $(2,092)$26,343 Total assets$107,094 $68,950 $31,090 $47,476 $— $147,516 $(8,905)$245,705 Purchases of property, equipment and capitalized software799 997 698 308 — 2,003 — 2,802 Depreciation and amortization973 943 841 643 — 2,427 — 3,400\n"
    },
    {
      "cluster": 28,
      "content": "ITEM 8:\nCLUSTER SUMMARY (KEYWORDS):\ncosts, operating, total, include, medical, cost, products, sold, depreciation, amortization\n\nTABLE: TABLE: (in millions) UnitedHealthcare Optum Health Optum Insight Optum Rx Optum Eliminations Optum Corporate andEliminations Consolidated; Premiums $ 286,004 $ 22,806 $ — $ — $ — $ 22,806 $ — $ 308,810; Products — 277 174 49,775 — 50,226 — 50,226; Services 9,791 16,153 6,466 3,630 — 26,249 — 36,040; Total revenues - unaffiliated customers 295,795 39,236 6,640 53,405 — 99,281 — 395,076; Total revenues - affiliated customers — 63,883 11,881 79,512 (4,389) 150,887 (150,887) —; Investment and other income 2,413 2,239 236 314 — 2,789 — 5,202; Total revenues $ 298,208 $ 105,358 $ 18,757 $ 133,231 $ (4,389) $ 252,957 $ (150,887) $ 400,278; Total operating costs (a) $ 282,624 $ 97,588 $ 15,660 $ 127,395 $ (4,389) $ 236,254 $ (150,887) $ 367,991; Earnings from operations $ 15,584 $ 7,770 $ 3,097 $ 5,836 $ — $ 16,703 $ — $ 32,287; Interest expense — — — — — — (3,906) (3,906); Loss on sale of subsidiary and subsidiaries held for sale (8,310) — — — — — — (8,310); Earnings before income taxes $ 7,274 $ 7,770 $ 3,097 $ 5,836 $ — $ 16,703 $ (3,906) $ 20,071; Total assets $ 119,009 $ 96,472 $ 34,452 $ 59,086 $ — $ 190,010 $ (10,741) $ 298,278; Purchases of property, equipment and capitalized software 781 1,008 1,291 419 — 2,718 — 3,499; Depreciation and amortization 889 1,123 1,294 793 — 3,210 — 4,099; Premiums $ 269,052 $ 21,775 $ — $ — $ — $ 21,775 $ — $ 290,827; Products — 207 162 42,214 — 42,583 — 42,583; Services 10,057 14,109 7,760 2,197 — 24,066 — 34,123; Total revenues - unaffiliated customers 279,109 36,091 7,922 44,411 — 88,424 — 367,533; Total revenues - affiliated customers — 57,696 10,896 71,484 (3,703) 136,373 (136,373) —; Investment and other income 2,251 1,532 114 192 — 1,838 — 4,089; Total revenues $ 281,360 $ 95,319 $ 18,932 $ 116,087 $ (3,703) $ 226,635 $ (136,373) $ 371,622; Total operating costs (a) $ 264,945 $ 88,759 $ 14,664 $ 110,972 $ (3,703) $ 210,692 $ (136,373) $ 339,264; Earnings from operations $ 16,415 $ 6,560 $ 4,268 $ 5,115 $ — $ 15,943 $ — $ 32,358; Interest expense — — — — — — (3,246) (3,246); Earnings before income taxes $ 16,415 $ 6,560 $ 4,268 $ 5,115 $ — $ 15,943 $ (3,246) $ 29,112; Total assets $ 110,943 $ 89,432 $ 34,173 $ 51,266 $ — $ 174,871 $ (12,094) $ 273,720; Purchases of property, equipment and capitalized software 866 1,199 974 347 — 2,520 — 3,386; Depreciation and amortization 989 1,058 1,229 696 — 2,983 — 3,972; Premiums $ 238,783 $ 18,374 $ — $ — $ — $ 18,374 $ — $ 257,157; Products — 72 180 37,172 — 37,424 — 37,424; Services 10,035 10,917 4,996 1,603 — 17,516 — 27,551; Total revenues - unaffiliated customers 248,818 29,363 5,176 38,775 — 73,314 — 322,132; Total revenues - affiliated customers — 40,883 9,288 60,936 (2,760) 108,347 (108,347) —; Investment and other income 923 928 117 62 — 1,107 — 2,030; Total revenues $ 249,741 $ 71,174 $ 14,581 $ 99,773 $ (2,760) $ 182,768 $ (108,347) $ 324,162; Total operating costs (a) $ 235,362 $ 65,142 $ 10,993 $ 95,337 $ (2,760) $ 168,712 $ (108,347) $ 295,727; Earnings from operations $ 14,379 $ 6,032 $ 3,588 $ 4,436 $ — $ 14,056 $ — $ 28,435; Interest expense — — — — — — (2,092) (2,092); Earnings before income taxes $ 14,379 $ 6,032 $ 3,588 $ 4,436 $ — $ 14,056 $ (2,092) $ 26,343; Total assets $ 107,094 $ 68,950 $ 31,090 $ 47,476 $ — $ 147,516 $ (8,905) $ 245,705; Purchases of property, equipment and capitalized software 799 997 698 308 — 2,003 — 2,802; Depreciation and amortization 973 943 841 643 — 2,427 — 3,400.\nTITLE: Optum\nTITLE: (in millions)UnitedHealthcareOptum HealthOptum InsightOptum RxOptum EliminationsOptumCorporate andEliminationsConsolidated\nTITLE: (in millions)\nTITLE: UnitedHealthcare\nTITLE: Optum Health\nTITLE: Optum Insight\nTITLE: Optum Rx\nTITLE: Optum Eliminations\nTITLE: Optum\nTITLE: Corporate andEliminations\nTITLE: Consolidated\nTITLE: 2024\nTITLE: 2023\nTITLE: 2022\nTEXT: (a) Total operating costs include medical costs, operating costs, cost of products sold and depreciation and amortization, as applicable for each reportable segment.\n"
    }
  ]
}