{
  "Bloomberg": [
    {
      "heading": "AI Has Fueled $70 Billion in Data Center M&amp;A Talks This Year",
      "date": "2025-12-29",
      "tickers": [
        "AAPL",
        "NVDA",
        "META",
        "AMD"
      ],
      "summary": "The artificial intelligence boom has spurred numerous data center acquisition talks, including SoftBank's multibillion-dollar deal to buy DigitalBridge Group Inc. At CES 2026 in Las Vegas (Jan. 6-9), major tech companies such as Nvidia, AMD, Samsung, and Lenovo will showcase AI-powered products targeting investors, corporate clients, and consumers. The event will feature AI-powered hardware like smart glasses from Meta, Snap, and various smaller brands, as well as AI-enabled humanoid robots for home and enterprise use. Companion robots, such as Tombot Inc.’s Jennie robot dog, will also be present.\n\nTelevisions remain a key focus at CES, with Samsung, LG, TCL, and Hisense emphasizing color reproduction and aesthetics, while Sony has reduced its presence. Motorola, under Lenovo, may reveal a new book-style foldable smartphone. Wearables will advance beyond fitness tracking to include medical-grade features addressing women’s health, glucose monitoring, cardiovascular tracking, and chronic-condition management."
    },
    {
      "heading": "As Netflix, Paramount Battle Over Warner Bros., What’s at Stake?",
      "date": "2025-12-29",
      "tickers": [
        "NFLX"
      ],
      "summary": "Warner Bros. Discovery is facing two major acquisition offers: Netflix proposed an $82.7 billion deal to buy its streaming and studio assets, while Paramount Skydance launched a hostile $108.4 billion takeover bid for the entire company. Warner Bros. had planned to split into separate cable TV and streaming/studio businesses before these offers. Netflix's deal excludes cable networks like CNN and Discovery Channel, which would be spun off. Paramount's bid targets the whole company and values Warner Bros. shares higher; the board has recommended shareholders reject it. Both deals include significant breakup fees and would require regulatory approval amid antitrust concerns from U.S. and EU authorities. Industry groups and politicians have expressed concerns about market concentration and potential impacts on theaters and consumers. Warner Bros. plans to spin off its cable networks into a separate entity by 2026. The outcome of the sale is expected to influence the entertainment industry significantly."
    },
    {
      "heading": "Wall Street Shuns Risk Ahead of Nvidia, Jobs Data: Markets Wrap",
      "date": "2025-12-29",
      "tickers": [
        "NVDA"
      ],
      "summary": "Wall Street traders are cautious ahead of Nvidia Corp.’s earnings report and the delayed September U.S. jobs report, both expected to influence market direction through 2025. Stocks declined while bonds and the dollar gained. The S&P 500 is near ending a six-month gain streak but could recover if investors receive positive signals about artificial intelligence (AI) and potential Federal Reserve interest-rate cuts.\n\nNvidia’s earnings, due Wednesday, are closely watched amid uncertainty about the sustainability of AI valuations. The September jobs report, released Thursday after a government shutdown delay, may impact expectations for Fed rate policy. Investor sentiment on Nvidia is mixed, with hedge funds equally divided on increasing or decreasing stakes.\n\nOther major companies such as Walmart and Target will provide insights into consumer trends amid limited economic data due to the shutdown. Big Tech firms are increasingly issuing debt to finance AI investments, leading to cautious credit market conditions.\n\nMarket analysts note growing skepticism about AI profitability and expect increased volatility around key earnings and economic data releases. Despite short-term caution, some strategists forecast continued market growth, with targets for the S&P 500 ranging from around 6,700 currently to as high as 7,800 by the end of 2026.\n\nThe U.S. government recently resumed funding after the longest shutdown in history, but delays in economic data collection persist. This has contributed to policymakers’ caution regarding interest-rate changes. The Fed is set to release minutes from its October meeting soon, with economists expecting data to support a December rate cut."
    },
    {
      "heading": "Bitcoin Breaks Above $90,000 as Traders Bet on New Year Rebound",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Bitcoin briefly rose above $90,000 on Monday before falling below $88,000 in New York trading. Other cryptocurrencies, including Ether, showed similar volatility. Despite record highs in the stock market during the holiday season, Bitcoin remained largely unchanged, still below its October starting level after a significant selloff. Analysts noted potential market movement following the upcoming Federal Reserve policy meeting minutes. Increased retail futures trading has raised the Bitcoin funding rate to its highest since mid-October, indicating growing bullish sentiment, though futures open interest remains below recent peaks. Meanwhile, Michael Saylor's Strategy Inc. resumed Bitcoin purchases, acquiring $109 million worth between December 22 and 28, adding to its total holdings of about $59 billion, with an average cost of around $100,000 per token for 2025."
    },
    {
      "heading": "Chevron Ships Unload Venezuelan Oil in US Ports Amid Blockade",
      "date": "2025-12-29",
      "tickers": [
        "CVX"
      ],
      "summary": "Since the Trump administration imposed a partial maritime blockade on Venezuela, at least two vessels chartered by Chevron Corp. carrying Venezuelan oil have successfully unloaded at US ports, according to Bloomberg data. Chevron, authorized to drill and export Venezuelan oil under a US license, has completed unloading the Searuby and is unloading the Canopus Voyager. Another ship, Nave Neutrino, also off-loaded Venezuelan crude in the US Gulf Coast, though its charter status with Chevron is unclear. Three more Chevron ships are en route to the US. The White House has ordered a regional focus on quarantining Venezuelan oil to pressure President Nicolás Maduro. Chevron's vessels are not under sanctions and have moved freely, while foreign tankers remain stalled nearby. Chevron sold at least 10 Venezuelan oil cargoes for January delivery."
    },
    {
      "heading": "Codelco-SQM Joint Venture Sets Sights on Lithium Mining Top Spot",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Chilean state copper producer Codelco and lithium supplier SQM have formed a joint venture, NovaAndino Litio, aiming to become the world’s largest lithium producer. The partnership plans to increase output at SQM’s Salar de Atacama lithium operation using new direct-extraction technologies to boost production and reduce environmental impact. Codelco will gain majority ownership of SQM’s Chilean lithium business in exchange for extending operations by 30 years. The venture supports Chile's efforts to increase state control over lithium resources and regain market share lost to Australia and Argentina. Production currently stands at about 230,000 metric tons per year. Codelco will own 50% plus one share after 2030, while SQM retains operational control until then. China’s Tianqi Lithium Corp. is challenging the partnership in Chile’s Supreme Court. China’s antitrust regulator has conditionally approved the deal. Other major lithium producers in Chile include Albemarle, Rio Tinto, Ganfeng Lithium, and Tianqi."
    },
    {
      "heading": "Fight Over Trump’s $100,000 H-1B Visa Fee Moves to Appeals Court",
      "date": "2025-12-29",
      "tickers": [
        "AAPL",
        "MSFT",
        "GOOGL",
        "AMZN",
        "NVDA",
        "META",
        "TSLA",
        "INTC",
        "AMD",
        "NFLX"
      ],
      "summary": "The US Chamber of Commerce is appealing a federal court ruling that upheld the Trump administration's $100,000 fee on H-1B visa applications. The fee, intended to discourage program abuse, was ruled lawful by US District Judge Beryl Howell in December. The fee increase faces other legal challenges from states and organizations, with the case expected to reach the US Supreme Court. The H-1B visa program allows US companies to hire skilled foreign workers for specialized jobs. The Chamber argues the fee exceeds presidential authority and federal law, but the judge found it was issued under statutory authority. Legal analysts consider the Chamber's appeal unlikely to succeed."
    },
    {
      "heading": "A Troubled $140 Billion Bet on China Property Gets Even Worse",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "International investors who invested nearly $140 billion in Chinese commercial real estate over the past 15 years are increasingly selling properties at significant losses, worsening the challenges in China's real estate sector. Major investment firms like BlackRock and Carlyle have sold assets below purchase prices, causing financial losses for both investors and lenders, including HSBC and Standard Chartered. An oversupply of office space and warehouses has led to high vacancy rates—between 20% and 40% in major cities—and falling rents. Distressed sales reached 114 billion yuan ($16 billion) in 2023-2024, accounting for a record 22% of total transactions.\n\nCapital values for offices in Beijing and Shanghai have dropped by at least 40% since 2019, and new supply is expected to continue through at least 2028. Foreign investors face difficulty exiting their investments and are increasingly looking for local buyers, including state-owned enterprises, which are themselves cautious. Rental rates have declined by about 25% in logistics properties, and some sales, like BlackRock’s logistics parks and Carlyle’s Shanghai office tower, have incurred losses or loan defaults.\n\nCases like Oaktree Capital’s control of Evergrande’s stalled resort project illustrate ongoing efforts to recover value amid slow sales and reduced prices. Overall, high vacancy rates, rising capitalization rates, economic deflation, and trade tensions with the US contribute to expectations of continued declines in rents and property values in China's commercial real estate sector through the coming years."
    },
    {
      "heading": "How a Reclusive Ex-Glencore Trader Became Indonesia’s Nickel King",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Arif Kurniawan is a major trader and mine owner in Indonesia's nickel industry, which is the world's largest producer of nickel used in batteries and electric vehicles. Over less than a decade, he has come to control about one-third of Indonesia’s domestic nickel ore trade and holds stakes in at least 20 mining concessions covering an area comparable to New York City. Kurniawan began his career at Glencore before founding his own trading company in 2015 and expanding through alliances, reinvestment, and partnerships with Chinese smelters such as Jiangsu Delong and Tsingshan.\n\nIndonesia's nickel industry has grown rapidly due to export bans, technological advances like high-pressure acid leaching (HPAL), and government policies encouraging domestic processing. The sector is highly fragmented, with many small miners requiring stable trading intermediaries like Kurniawan's firm. Recently, political shifts under President Prabowo Subianto have increased regulatory pressures, royalties, and enforcement actions, impacting miners including Kurniawan’s operations. Kurniawan has been abroad much of 2024, with his businesses managed by associates. Maintaining his market position amid Indonesia's evolving political landscape will likely depend on new political alliances."
    },
    {
      "heading": "Crude Oil Advances as China Pledges to Support Growth Next Year",
      "date": "2025-12-29",
      "tickers": [
        "XOM",
        "CVX"
      ],
      "summary": "Oil prices rose after falling the previous day, with West Texas Intermediate increasing 2.4% to over $58 a barrel and Brent nearing $62. US-led efforts to end the Russia-Ukraine war encountered new difficulties after Russian President Vladimir Putin announced a revision of Russia’s negotiating stance following a drone attack on his residence. Despite recent price gains, oil is set for a fifth consecutive monthly decline due to concerns about global oversupply from OPEC+ and other producers. China pledged expanded fiscal spending next year to support growth and is expected to continue building crude stockpiles. Meanwhile, US talks with Israel may address potential new actions against Iran, and the US has imposed a partial maritime blockade near Venezuela amid drug trafficking allegations, prompting Venezuela to condemn the move."
    },
    {
      "heading": "Nvidia, Lenovo and Samsung to Test Consumer Appetite for AI at CES",
      "date": "2025-12-29",
      "tickers": [
        "NVDA",
        "AMD",
        "META"
      ],
      "summary": "CES 2026, held in Las Vegas from January 6-9, will feature major tech companies like Nvidia, AMD, Samsung, and Lenovo promoting AI-driven products to investors, corporate clients, and consumers. The event will showcase both available products and concept devices, with an emphasis on AI-powered hardware, including smart glasses from smaller brands alongside Meta and Snap’s presence. Additionally, AI-first gadgets such as rings and other wearable devices will be highlighted.\n\nA dedicated hall will display AI-powered humanoid robots for home and enterprise applications, including robots for manufacturing, logistics, food service, and companion roles like the Jennie robot dog. Demonstrations are expected to progress toward more complex tasks, although challenges remain regarding commercial viability.\n\nTelevision manufacturers, including Samsung, LG, TCL, and Hisense, will focus on color reproduction and aesthetics rather than brightness or resolution improvements. Motorola may debut a new book-style foldable smartphone following a media teaser from Lenovo.\n\nWearable devices at CES will continue evolving toward medical-grade capabilities, featuring products for sleep monitoring, women’s health, glucose tracking, cardiovascular health, and chronic-condition management."
    },
    {
      "heading": "Packer Family Office CEO Sells Sydney Home for A$85 Million: AFR",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "In Sydney, a five-bedroom mansion in Rose Bay owned by the CEO of James Packer’s family office sold for about A$85 million, marking the city's largest home sale of 2025. The property was previously purchased in 2018 for A$47 million. Another Rose Bay property sold for A$82.5 million in October, while the largest residential sale in Australia this year occurred in Melbourne’s Toorak for between A$115 million and A$135 million.\n\nRegarding the US stock market, analysts predict a continued rally in 2026, expecting the S&P 500 to rise by around 8-11%, potentially marking four consecutive years of gains. Despite recent market volatility driven by factors such as AI sector challenges and trade tensions, confidence remains high among strategists. Risks cited include prolonged interest rates, trade policy changes, and corporate earnings adjustments. The US economy’s recent growth and strong corporate earnings underpin the optimistic outlook, although some analysts advise caution due to valuation levels and recession risks."
    },
    {
      "heading": "Gold, Silver Tumble as Traders Book Profit After Rally to Record",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Gold and silver prices dropped sharply due to profit-taking following a strong year-end rally that had pushed both metals to record highs. Spot gold fell up to 5%, its largest single-day drop since October, while silver declined 11%, its biggest intraday fall since September 2020. The declines were amplified by low market liquidity at year-end. Technical indicators showed both metals were overbought, signaling a likely pullback. Silver’s retreat followed a surge above $84 per ounce driven by strong Chinese demand and record premiums in Shanghai. To curb speculation, some exchanges increased margin requirements for silver futures. Gold fell to around $1,827 an ounce, and major gold mining stocks also declined. Platinum and palladium experienced steep losses, with drops exceeding 14% and 17%, respectively."
    },
    {
      "heading": "Tech Weighs on US Stocks as Silver Turns Volatile: Markets Wrap",
      "date": "2025-12-29",
      "tickers": [
        "TSLA",
        "NVDA",
        "META"
      ],
      "summary": "US stocks declined as investors reduced positions in major tech companies near year-end. The S&P 500 dropped 0.4%, led by declines in Tesla, Nvidia, and Meta, while the Nasdaq 100 fell 0.5%. The 10-year Treasury yield edged down to 4.11%. The recent equity weakness contrasts with last week’s tech-led gains and is not linked to any specific fundamental factor. The S&P 500 has gained about 17% year-to-date, underperforming some global markets despite tariff-related concerns.\n\nAnalysts maintain a positive outlook for 2026, forecasting an average 9% gain in the S&P 500, supported by factors such as tariff policies, fiscal stimulus, labor market shifts, AI productivity, and possible deregulation.\n\nSilver prices dropped 9% after reaching a record high above $80 per ounce, while gold fell over 4%. Precious metals have been volatile due to strong central bank demand, ETF inflows, lower borrowing costs, and geopolitical tensions. Elon Musk's recent comments on silver's industrial importance contributed to earlier price gains. Analysts view the recent pullback in metals as a potential buying opportunity.\n\nBitcoin briefly rose above $90,000 before falling back, and the US dollar remained steady. Oil prices increased amid stalled US-led Ukraine talks and China’s economic growth support, although Brent crude is on track for a fifth consecutive monthly decline."
    },
    {
      "heading": "Every Wall Street Analyst Now Predicts a Stock Rally in 2026",
      "date": "2025-12-29",
      "tickers": [
        "JPM",
        "BAC"
      ],
      "summary": "Leading Wall Street strategists predict the US stock market will rise again in 2026, potentially marking a four-year winning streak for the S&P 500. Despite risks such as AI sector volatility, Federal Reserve interest rate decisions, and political uncertainties, the consensus forecast shows an average gain of around 9%. No surveyed analysts anticipate a market decline for the year. Recent market volatility and economic resilience, including strong corporate earnings and investment in AI, have contributed to this optimistic outlook. However, some analysts caution about risks like prolonged high interest rates, trade tensions, or earnings adjustments. Overall, the US economy's growth and solid corporate performance underpin the positive predictions for the stock market in 2026."
    }
  ],
  "WSJ": [
    {
      "heading": "Andersen’s IPO Makes It Hard for Investors to See Straight",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Andersen Group, a professional-services firm specializing in tax and accounting, went public on December 16, two decades after Arthur Andersen's criminal conviction was overturned. The company has a complex structure, with insiders retaining majority voting control and receiving substantial financial benefits through tax arrangements and promissory notes. Andersen Group owns only 11% of its main operating partnership but consolidates all revenues and expenses on its financial statements, with the remainder attributed to insiders as non-controlling interests. The company reported material weaknesses in internal accounting controls and faces potential disruption from AI, as its business relies heavily on hourly billing. The IPO raised about $188 million, valuing the company at $2.8 billion."
    },
    {
      "heading": "In a Wild Year for Markets, Investors Who Did Nothing Did Just Fine",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "In 2025, markets experienced disruptions from tariffs, declining trust in the U.S., and developments in artificial intelligence (AI). Despite volatility, U.S. and foreign stocks, Treasurys, and cash holdings delivered positive returns. European and emerging market stocks outperformed U.S. stocks, aided by a weaker dollar and stimulus measures. AI-related stocks saw rapid price fluctuations, raising concerns about a potential bubble. The market exhibited a \"K-shaped\" pattern, with large tech companies outperforming smaller stocks. Looking ahead, key investor concerns include Federal Reserve independence, inflation persistence, tariff policies, foreign investment flows, and the commercial viability of AI."
    },
    {
      "heading": "Live Q&A: Warren Buffett’s Legacy—Share Your Thoughts and Ask WSJ Your Questions",
      "date": "2025-12-29",
      "tickers": [
        "BRK.B"
      ],
      "summary": "Warren Buffett, 95, will step down as CEO of Berkshire Hathaway at the end of the year. Berkshire Hathaway is a conglomerate involved in insurance, utilities, rail, and other sectors. Buffett is known for his philanthropy and annual letters that offer insights on investing and life. The Wall Street Journal invites readers to share their thoughts and questions about Buffett’s legacy and Berkshire’s future in the comments. Journal reporters Justin Baer and Krystal Hur will respond on Tuesday."
    },
    {
      "heading": "Michael Burry Bets He Isn’t Too Early to Go Against the AI Juggernaut",
      "date": "2025-12-29",
      "tickers": [
        "NVDA"
      ],
      "summary": "Michael Burry, known for his successful bet against the 2008 housing market, is now betting against artificial-intelligence stocks, specifically Nvidia and Palantir Technologies. He warns of a bubble in AI stocks that could burst, comparing it to the dot-com bubble. Burry's hedge fund recently closed and he launched a finance newsletter focusing on this thesis, gaining significant subscribers. His short positions against Nvidia and Palantir are relatively small but could yield large profits if the stocks fall substantially by 2027. Burry criticizes Palantir's reliance on government contracts and executive compensation, and questions Nvidia’s accounting practices and business sustainability. Both companies deny his claims. Despite some stock declines, the market has not yet reacted strongly to Burry's warnings, and some investors remain confident in continued growth."
    },
    {
      "heading": "Private Equity Has More Housecleaning to Do in 2026",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Private-equity firms have made progress in selling off long-held investments in 2025, but a large number of companies remain unsold. As of September 30, about 12,900 U.S. companies were still held in private-equity portfolios, slightly more than at the end of 2024. The average holding period is nearly seven years, shorter than in 2023 but still high compared to pre-pandemic levels. Higher interest rates since 2022 have made buyouts more expensive, reducing firms' willingness to accept low returns on earlier investments. U.S. firms held approximately $880 billion in undeployed capital as of September, down from $1.3 trillion in December 2024. Deal activity has increased, with global private-equity sales or IPOs rising over 40% in 2025. Notable transactions include Medline's IPO and the sale of Ampere Computing to SoftBank. Executives expect more asset sales and IPOs in 2026, with companies like SpaceX and Anthropic considering listings."
    },
    {
      "heading": "Rolex Tries to Beat Watch Flippers at Their Own Game",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Rolex launched an official certified preowned watch program three years ago to address the large, counterfeit-prone secondhand market. The program, expected to generate over $500 million in sales in 2025, allows authorized retailers to source, authenticate, service, and price preowned Rolex watches, which Rolex then certifies and warranties. Consumers pay an average 28% premium for certified watches over uncertified ones, with some models reselling for more than new. Rolex's preowned program aims primarily to protect its brand reputation, limit counterfeit sales, and support the primary market, rather than to generate significant profit. The program keeps Rolex at arm’s length from resale operations, relying on authorized retailers for execution. The secondhand Swiss watch trade is large, reaching $25 billion annually, and luxury brands may increasingly need to consider certified resale programs to safeguard their images."
    },
    {
      "heading": "There’s No Happy Ending for Movie Theaters, No Matter Who Wins Warner",
      "date": "2025-12-29",
      "tickers": [
        "NFLX"
      ],
      "summary": "The ownership of Warner Bros. is uncertain, with Netflix currently the designated buyer, but Paramount making a higher cash offer to shareholders. The bidding war is occurring amid a weakened theatrical movie market, with domestic box office revenues below pre-pandemic levels. Warner Bros. has a history of numerous theatrical releases and major franchises, but the future focus depends on whether the buyer favors streaming or theaters. Netflix has pledged commitment to theatrical releases and standard release windows but remains vague on specifics. Paramount promises to maintain a high volume of theatrical films but faces significant debt if it acquires Warner. Existing contracts require honoring theatrical releases through 2029. Investors remain cautious about the theatrical sector’s prospects regardless of the outcome."
    },
    {
      "heading": "Trump Wants a Weaker Dollar. Some Chinese Say He Has a Point.",
      "date": "2025-12-29",
      "tickers": [
        "GS"
      ],
      "summary": "The article discusses the potential impact of a weaker U.S. dollar against the Chinese yuan. President Trump supports a weaker dollar to reduce the U.S. trade deficit and increase competitiveness of American goods, while some Chinese economists advocate for a stronger yuan to boost consumption and economic growth. Currently, China maintains a weak yuan to support exports by managing currency fluctuations and holding large foreign reserves. Analysts estimate the yuan is undervalued by 20-30%. Despite debates within China about strengthening the yuan, the government has resisted rapid changes due to concerns over economic stability and historical precedents."
    },
    {
      "heading": "Why Japan’s Stock Market Can Keep Rising",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "In 2025, Japan experienced economic growth, rising wages, and higher prices, prompting the Bank of Japan to increase interest rates to their highest level in 30 years. The Nikkei 225 index rose 26% in 2025, outperforming the S&P 500. The yen remained mostly stable against the dollar for the year. Japan's strong performance is linked to its role in the global tech supply chain and corporate-governance reforms.\n\nJapan's public debt stands at about 200% of GDP, with rising government bond yields reflecting tighter monetary policy and fiscal stimulus amounting to around 3.4% of GDP. Despite this, Japan's long debt maturity and recent reductions in bond issuance help manage financing costs. Japan’s debt-to-GDP ratio has decreased from 212% in 2022 due to recent nominal GDP growth averaging 3.1% annually.\n\nThe government’s stimulus package targets strategic sectors like semiconductors and shipbuilding and aims to increase defense spending to 2% of GDP. Rising Japanese bond yields may attract domestic savings that might otherwise go to U.S. debt, but this has not led to higher U.S. Treasury yields. Risks to U.S. Treasurys are seen as stemming from domestic U.S. issues rather than Japan. Japan remains an attractive investment option for 2026."
    },
    {
      "heading": "Why the ‘Everyone’s a Winner’ Energy Trade Can’t Last Forever",
      "date": "2025-12-29",
      "tickers": [
        "CAT"
      ],
      "summary": "The power sector has seen broad gains in 2024 across various energy types, driven by increasing demand from artificial intelligence (AI). Stocks in nuclear, natural gas, renewables, geothermal, coal, and related equipment manufacturers have all risen significantly. For example, nuclear and uranium companies like Constellation Energy and Cameco have gained 60% and 80%, respectively, while renewable energy ETFs and companies like Ormat Technologies have also risen strongly. Equipment makers such as GE Vernova, Caterpillar, and Cummins posted gains due to increased turbine demand. Coal consumption is also up in the U.S.\n\nHowever, many energy stocks now trade at high valuations, pricing in substantial optimism related to AI-driven power demand. Smaller or speculative firms, particularly in small modular reactors, face greater risk of correction. Renewable energy stocks have rallied but without expanding earnings multiples, indicating stable growth expectations.\n\nChallenges such as labor shortages in construction may impact future project development across the sector. Analysts suggest that while 2024 focused on AI exposure, 2025 and beyond will require demonstration of execution and contract wins. Overall, further gains in energy stocks may be more difficult as much positive outlook is already reflected in current valuations."
    },
    {
      "heading": "Why We Could Use a Good, Long Bear Market",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "The article discusses the rarity of major bear markets in the past 16 years and the impact on investor behavior. It notes that deep downturns like the 2007-09 recession, where the S&P 500 fell over 50%, take years to recover but offer investment opportunities. In contrast, recent shorter bear markets have quickly recovered, encouraging risky \"buy the dip\" behavior, often in speculative, unprofitable companies. The piece compares past market cycles, including the late 1990s tech bubble, highlighting how lack of experience with severe downturns may contribute to current market risks. Historically, bear markets with recessions take longer to recover than those without. The article concludes that while bear markets provide lessons, their costs are significant."
    }
  ],
  "Reuters": [
    {
      "heading": "Banks tap Fed liquidity tool amid year-end pressures",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "On December 29, the Federal Reserve's standing repo facility lent $25.95 billion overnight to financial firms, marking the third-highest usage since its 2021 launch. The loans were offered at an interest rate of 3.75%, the top of the Fed's current target range. Use of the facility tends to rise around quarter-end periods. The Fed recently ended its balance sheet reduction and began purchasing short-term government bonds to manage liquidity. It also removed a $500 billion daily limit on the standing repo tool earlier in December. Additionally, $10.55 billion was parked on the Fed's reverse repo facility, down from $20.34 billion the previous Friday."
    },
    {
      "heading": "European stocks hit fresh record close as tech, staples drive post-holiday gains",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "On December 29, European stocks closed slightly higher, with the pan-European STOXX 600 up 0.09% at 589.25, setting a new record. Gains were led by technology, retail, and food and beverage sectors, while defense and financial shares declined. Defense stocks fell amid ongoing uncertainty over U.S.-Ukraine peace talks and reported Ukrainian attacks near Putin's residence. Financials, despite recent losses, have gained about 65% in 2025 due to merger activity, lighter regulations, and stable economic conditions. The STOXX 600 is on track for its best annual performance since 2021, supported by lower interest rates and Germany’s fiscal spending. Market watchers are focused on upcoming U.S. Federal Reserve meeting minutes and expect continued cautious trading. Separately, Ion Beam Applications rose 4.6% after securing a contract in South Korea."
    },
    {
      "heading": "FTSE 100 subdued as defence, mining shares slide in thin holiday trading",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "On December 29, London's FTSE 100 ended nearly unchanged, with declines in precious metal miners and defence stocks. The FTSE 250 index rose 0.4% in quiet trading. Talks between U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskiy briefly boosted hopes for an end to the Russia-Ukraine war, leading to a selloff in defence shares, but these hopes diminished after Russia accused Ukraine of attempting to attack President Vladimir Putin's residence. Babcock International, BAE Systems, and Rolls-Royce shares fell, along with the aerospace and defence sector index. Precious metal miners dropped as gold and silver prices fell, and industrial metal miners declined following a drop in copper prices. Trading volumes were expected to remain low due to the holiday-shortened week. International Personal Finance shares rose nearly 6% after agreeing to a £543 million takeover. The FTSE 100 has gained nearly 21% in 2024, on track for a fifth consecutive annual rise, outperforming major European and U.S. indices."
    },
    {
      "heading": "Indian shares extend losses as investors book profits in thin year-end trade; Reliance drags",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "On December 29, Indian stock markets declined, with the Nifty 50 index falling 0.38% to 25,942.10 and the BSE Sensex dropping 0.41% to 84,695.54. The Nifty lost 0.9% over three sessions, and the Sensex fell 1% in four sessions. Trading volume decreased from 300 million shares in November to 250 million in December. Fourteen of 16 major sectors declined, including small-caps (-0.7%), mid-caps (-0.5%), IT (-0.8%), and energy (-0.5%), with Reliance Industries down 0.9%. Reliance and BP face a $30 billion arbitration claim over alleged gas underproduction. Hikal shares dropped 2.6% following revenue reporting discrepancies, and Timex Group India shares fell 5.3% after a shareholder’s discounted stake sale. Foreign investors sold Indian equities worth a record $18.03 billion in 2025 so far."
    },
    {
      "heading": "Oil settles up over 2% on dented peace hopes in Ukraine, tensions in Yemen",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "On December 29, oil prices rose over $1 per barrel following Russia's accusation that Ukraine attacked President Vladimir Putin's residence. Brent crude settled at $61.94 a barrel, up 2.1%, and U.S. West Texas Intermediate closed at $58.08, up 2.4%. Ukraine denied the attack and dismissed Russia's claims. The situation prompted concerns over potential supply disruptions, also influenced by increased tensions in Yemen, where Saudi air strikes targeted separatist forces. Strong Chinese crude imports contributed to tightening markets. Analysts expect Brent prices to hold above $60 and possibly rise slightly in 2026 due to expected non-OPEC+ supply stagnation. U.S. oil inventory data was delayed but anticipated to show lower crude stocks and higher distillate and gasoline inventories for the week ending December 19."
    },
    {
      "heading": "Precious metals drop amid profit taking; silver, platinum retreat from record highs",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "On December 29, precious metals including gold, silver, platinum, and palladium experienced sharp price declines after reaching record highs earlier in the day. Spot gold fell 4.5% to $4,330.79 an ounce, platinum dropped 14.5% to $2,096.53 an ounce, silver decreased 9.5% to $71.66 an ounce, and palladium fell 15.9% to $1,617.47 an ounce. The declines were attributed to profit-taking following recent rallies. Gold has increased about 65% in 2023, with silver gaining 147%, driven by supply constraints and demand. Price drops were also influenced by liquidity constraints related to a critical minerals investigation deadline and reduced trading volume due to holidays. Additionally, Russia stated it would review its position in peace talks following a reported Ukrainian drone attack."
    },
    {
      "heading": "Record foreign outflows cap India stock rally in 2025; selling may ease next year",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "In 2025, India's stock market reached new highs despite a record foreign investor sell-off of about 1.6 trillion rupees ($18 billion), driven by stretched valuations, weak earnings, geopolitical concerns, and U.S. tariff worries. IT stocks saw significant declines due to reduced demand from the U.S. Foreign ownership of Indian equities fell to a 15-year low, while domestic institutional investments hit a record $86 billion, offsetting foreign outflows. Indian benchmarks rose roughly 10%, underperforming regional peers. Analysts project foreign selling to ease in 2026 with potential improvements in earnings, valuations, economic growth, and a possible U.S. trade deal, supported by continued strong domestic buying."
    },
    {
      "heading": "Wall Street fluctuates ahead of Nvidia results, government data",
      "date": "2025-12-29",
      "tickers": [
        "GOOGL",
        "BRK.B",
        "AAPL",
        "NVDA",
        "HD"
      ],
      "summary": "On Monday, Wall Street's major indexes showed little direction ahead of key events, including Nvidia's upcoming earnings report and resumed U.S. government data releases. Alphabet shares rose 4.6% after Berkshire Hathaway revealed a $4.3 billion stake in the company, while Apple shares fell 1.4%. Nvidia shares dropped 1.3% ahead of earnings. The Dow fell 0.10%, the S&P 500 rose 0.02%, and the Nasdaq gained 0.16%. Technology and energy sectors declined around 0.7%. Morgan Stanley downgraded Dell Technologies and Hewlett Packard Enterprise, resulting in share declines of 6.6% and 6.3% respectively. Earnings reports from Walmart, Home Depot, and Target are scheduled this week. The U.S. government shutdown ended last week, with key economic data, including the September jobs report, expected soon. Markets price in a higher chance of the Federal Reserve holding rates steady in December. Fed Vice Chair Philip Jefferson advised caution on rate cuts. Minutes from the Fed's October meeting will be released Wednesday. Morgan Stanley anticipates U.S. stocks will outperform globally next year. On the NYSE and Nasdaq, declining stocks outnumbered advancers. The S&P 500 and Nasdaq recorded several new 52-week highs and lows."
    },
    {
      "heading": "Precious metals drop amid profit taking; silver, platinum retreat from record highs",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "On December 29, precious metals prices fell sharply after reaching record highs earlier in the day as investors took profits. Spot gold dropped 4.5% to $4,330.79 per ounce, platinum fell 14.5% to $2,096.53 per ounce, silver declined 9.5% to $71.66 per ounce, and palladium decreased 15.9% to $1,617.47 per ounce. Gold has risen about 65% during the year, silver 147%, with platinum and palladium also posting gains. The price falls were influenced by profit-taking, liquidity constraints, holiday-thinned trading, and a pending critical minerals investigation. Additionally, Russia stated it would review its peace negotiation position following an alleged Ukrainian drone attack."
    },
    {
      "heading": "U.S. stocks ease from record highs, world indexes set for double-digit 2025 gains",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "On December 29, 2025, U.S. stock indexes declined amid a broad selloff, with some defensive sectors showing strength. Treasury yields decreased slightly as investors anticipated possible Federal Reserve interest rate cuts. The U.S. dollar stabilized after reaching a three-month low. Market attention focused on negotiations between U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskiy regarding a potential deal to end Russia's war on Ukraine, though prospects dimmed due to accusations of Ukrainian attacks on Russian President Vladimir Putin's residence. European and emerging market stocks mostly rose, while Japan's Nikkei fell. Oil prices increased due to geopolitical tensions and supply concerns. Gold prices fell sharply from record levels due to profit-taking. Cryptocurrency values, including bitcoin and ethereum, also decreased slightly."
    },
    {
      "heading": "UK’s Octopus Energy nears Kraken stake sale, Sky News reports",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Octopus Energy Group is reportedly close to selling a 10% to 20% stake in its software unit, Kraken Technologies, in a deal valuing the business at $9 billion to $10 billion, according to Sky News. Kraken provides energy software to major utilities including EDF, National Grid U.S., and Tokyo Gas. Investors expected to participate include D1 Capital Partners, Fidelity, and a unit of Canada's Ontario Teachers' Pension Plan. Octopus Energy declined to confirm the report."
    },
    {
      "heading": "US stocks slip as tech loses steam in final week of 2025",
      "date": "2025-12-29",
      "tickers": [
        "NVDA",
        "TSLA"
      ],
      "summary": "On Monday, Wall Street's main indexes declined as technology stocks, including Nvidia and Palantir, pulled back from recent gains. The Dow Jones fell 0.38%, the S&P 500 dropped 0.35%, and the Nasdaq lost 0.55%. Tesla also declined after reaching a record high last week. Materials stocks slipped, with precious metals falling sharply, while energy stocks rose alongside oil prices. Despite the pullback, all three indexes are on track for monthly gains and their third consecutive yearly increase. The tech-driven bull market that began in October 2022 remains intact, supported by optimism around AI, potential interest-rate cuts, and economic resilience. Market activity is expected to be light due to the holiday season, with upcoming attention on Federal Reserve minutes and jobless claims data."
    },
    {
      "heading": "Wall St Week Ahead S&P 500 eyes 7,000 mark as investors look for upbeat end to strong 2025",
      "date": "2025-12-29",
      "tickers": [],
      "summary": "Investors expect the U.S. stock market to finish 2025 strongly, with major indexes near record highs. The S&P 500 is approaching the 7,000 level and is set for its eighth consecutive month of gains, the longest since 2017-2018. Recent stock volatility linked to technology sector concerns and AI spending has eased. Market participants await the Federal Reserve's December meeting minutes, scheduled for release next week, for insight into future interest rate cuts. The Fed cut rates by 75 basis points over three meetings in 2025 to 3.50%-3.75%, but policymakers showed differing views in their December vote. Investors are also anticipating a Fed chair nomination by President Trump to replace Jerome Powell in May. For the year, the S&P 500 rose about 18%, and the Nasdaq gained 22%, though the technology sector has weakened since November, while financials, transports, healthcare, and small caps have performed well. Market activity suggests a rotation toward sectors with more moderate valuations."
    }
  ]
}