{
  "Bloomberg": [
    {
      "heading": "Alphabet Earnings Need to Justify Its Stock\u0019s $2 Trillion Rally",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Alphabet Inc. is currently viewed as a leading company across key segments of the artificial intelligence (AI) industry. Its upcoming earnings report will serve as a crucial indicator of whether this position and its recent stock gains are sustainable. Less than a year ago, Alphabet was perceived as trailing competitors in AI; however, it now boasts a highly regarded AI model (Gemini), advanced semiconductor technology (tensor processing units), and a rapidly expanding cloud computing division. Its dominant digital advertising business, generating nearly $300 billion annually, further strengthens its market standing.\n\nAlphabet’s share price recently reached an all-time high and is close to surpassing Nvidia as the world’s largest publicly traded company, with a market cap of about $4.1 trillion compared to Nvidia’s $4.4 trillion. The stock has gained over 65% in 2025 and remains a top performer in 2026, rising 6.3% year-to-date. Despite this, shares experienced a 2.7% decline mid-Wednesday trading.\n\nInvestor enthusiasm has been fueled by developments since October 2024, including the launch of the Gemini AI model and strong prospects for growth in cloud services, which analysts expect to drive significant free cash flow. Alphabet’s semiconductors are viewed as a major business opportunity, particularly for Google Cloud. The company also maintains dominant positions with YouTube in streaming and Waymo in autonomous vehicles, with Waymo recently valued at $126 billion following a $16 billion funding round.\n\nAnalysts forecast 17% revenue growth and a 23% increase in earnings per share for the upcoming quarter. However, questions remain about whether this growth justifies Alphabet’s high valuation—shares trade at roughly 28 times estimated earnings, well above the decade average of 21—especially as 2026 capital expenditures are expected to rise by 28% to $117 billion.\n\nRecent market dynamics include Microsoft reporting slowing cloud growth amid heavy AI investments, triggering a selloff, while Meta Platforms gained investor confidence through strong revenue forecasts despite high spending. Some analysts suggest Alphabet might follow Meta’s pattern of sustaining growth through aggressive AI-related expenditures.\n\nIn the broader market, an AI automation tool launch by Anthropic PBC caused a $285 billion decline in stocks across multiple sectors due to rapid selling by investors. Overall, Alphabet’s earnings and strategic execution will be closely scrutinized as indicators of its ability to maintain leadership and justify its valuation in the evolving AI and cloud landscapes."
    },
    {
      "heading": "Alphabet Plans Record Spending in Race to Dominate AI Market",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Alphabet Inc. plans to invest up to $185 billion in capital expenditures in 2026, surpassing the $119.5 billion expected by analysts and doubling its 2025 spending. This investment is driven by an expansion of data centers and infrastructure to support its artificial intelligence (AI) initiatives. The company reported strong fourth-quarter revenue of $97.23 billion, exceeding estimates.\n\nCEO Sundar Pichai emphasized that these investments are essential to fuel growth across Alphabet’s businesses, especially as AI drives increased usage of Google Search and other products. Despite the strong results, Alphabet’s stock fell 3.2% intraday but remains up nearly 70% year-over-year.\n\nAlphabet is focused on evolving its AI capabilities to compete with rivals like Microsoft, Amazon, and OpenAI by improving its Gemini AI model and integrating it across products. Around 40% of technical infrastructure spending is on data centers and networking, with the remainder on servers. Pichai noted planning for constraints such as power and supply chain limitations.\n\nThe company reported a doubling of its cloud revenue backlog to $240 billion, reflecting strong demand for enterprise AI offerings. Gemini Enterprise has reached over 8 million paid users since its launch four months ago, while the Gemini app’s active users grew to 750 million as of December.\n\nAlphabet is expanding its AI ecosystem by supplying AI chips to Anthropic and powering Apple’s Siri. AI agents currently write about half of Google’s internal code. Google Cloud revenue rose 48% year-over-year to $17.7 billion, exceeding analyst expectations.\n\nAlphabet’s Other Bets segment, including Waymo, posted a fourth-quarter revenue of $370 million and an operating loss of $3.6 billion, wider than projected. The company contributed to a $16 billion funding round for Waymo, valuing it at $126 billion, and its R&D expenses increased 42%, driven by AI talent costs and Waymo support.\n\nYouTube showed strong engagement, with its Shorts format averaging 200 billion daily views, and combined ad and subscription revenue surpassed $60 billion in 2025."
    },
    {
      "heading": "Amazon Cloud Sales in Focus After Microsoft\u0019s $500 Billion Rout",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Amazon.com Inc. is set to report its earnings on Thursday with particular focus on its cloud business, Amazon Web Services (AWS), amid concerns sparked by Microsoft Corp.’s recent share decline linked to slowing growth in its Azure cloud platform. Microsoft shares have dropped over 16% since January 28, erasing approximately $500 billion in market value, raising investor apprehension about the broader cloud sector. Amazon’s shares, which rose nearly 10% after its October earnings beat expectations, have underperformed in recent months, gaining only 5.2% in 2025 and less than 1% in 2026 so far, compared to a 20% rise in the Nasdaq 100 and 16% gain in the S&P 500 last year.\n\nAnalysts expect Amazon to report a 21% year-over-year increase in AWS revenue to $34.8 billion for the fourth quarter, with total company revenue projected to rise 13% to $211.5 billion and adjusted earnings per share increasing 8% to $2.40. Other factors under scrutiny include Amazon’s margin expansion, retail business performance, AI initiatives such as its chatbot Rufus, and capital expenditures for 2026, including investments in AI firms Anthropic PBC and possibly OpenAI. Amazon invested $8 billion in Anthropic in late 2024, contributing to a significant gain in the prior quarter.\n\nInvestor sentiment is cautious amid a tech sector-wide reevaluation of AI-related spending and growth prospects, exemplified by Microsoft’s capital expenditure increase and a recent downgrade on its shares over Azure growth concerns. Amazon’s valuation remains lower than its decade average, trading at about 23 times forward earnings versus a 10-year average of 46, suggesting continued pressure to deliver strong results. Cloud revenue growth remains the primary focus, as AWS represents Amazon’s core growth engine despite diversification in other areas. Options data suggests the stock could experience volatile moves following the earnings release."
    },
    {
      "heading": "Amazon Launches AI-Enhanced Alexa for Prime Subscribers in US",
      "date": "2026-02-05",
      "tickers": [
        "AMZN"
      ],
      "summary": "Amazon.com Inc. has launched an upgraded version of its AI-enhanced digital assistant, Alexa+, in the US. The new Alexa, powered by large language models, offers dynamic responses to user queries, moving beyond the scripted replies of earlier editions. After nearly a year of early access limited to Amazon Prime members—which costs $139 annually in the US and had tens of millions of users by January—the company is now making Alexa+ available in a free tier via web and smartphone apps, albeit with usage limits. \n\nNon-Prime users can subscribe to Alexa+ for $19.99 per month, a higher cost than the annual Prime fee. This rollout intensifies Amazon’s competition with other AI chatbot providers like OpenAI, Google, Microsoft, and Anthropic. The upgraded Alexa is currently being tested in Canada and European markets, with plans for wider international expansion expected later this year. Amazon last reported its Prime membership count in 2021, citing 200 million members globally."
    },
    {
      "heading": "Amazon Told to Stop Policing Prices, Pay $70 Million in Germany",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Germany’s Federal Cartel Office has ordered Amazon.com Inc. to stop enforcing price controls on retailers in its German marketplace and has seized €59 million ($70 million) from the company, representing estimated profits from this practice. The regulator found that Amazon’s policy of delisting or demoting products with prices deemed too high violates rules intended to ensure fair competition in the digital economy. Such interventions are permitted only in exceptional cases, such as preventing price gouging, and under regulatory oversight.\n\nThe authority expressed concern that Amazon’s pricing controls allow the company to influence market prices and compete unfairly against other online retailers. This interference may lead some retailers to sell at a loss or exit the marketplace. Amazon accounts for about 60% of online retail sales in Germany.\n\nAmazon stated it will appeal the ruling and maintain normal operations to avoid disruption. The company’s German country manager argued that the decision misunderstands retail competition and could hinder innovation while fragmenting the European single market. He maintained that Amazon’s pricing guidelines allow retailers to set prices independently.\n\nThis marks the first use by Germany’s antitrust authority of its new power to confiscate profits earned through anticompetitive behavior, a power established in 2023. The regulator indicated it may seize additional funds if violations continue. The Cartel Office noted that Amazon’s price controls are unnecessary for maintaining low prices and criticized the lack of transparency in how Amazon determines which prices to regulate."
    },
    {
      "heading": "Australia Blasts Big Tech for Child Sexual Abuse Failings",
      "date": "2026-02-05",
      "tickers": [
        "META",
        "AAPL",
        "MSFT",
        "GOOGL"
      ],
      "summary": "Australia’s online safety regulator, the eSafety Commissioner, criticized major tech companies including Meta, Apple, and Google for failing to adequately address child sexual exploitation and abuse on their platforms. The regulator highlighted issues such as poor detection of live abuse during video calls and insufficient efforts to identify newly created abusive content. Additionally, the lack of language analysis tools to detect sexual extortion targeting Australian children was noted, despite companies being provided with common online indicators. eSafety Commissioner Julie Inman Grant expressed disappointment over the limited progress despite prolonged engagement with these companies.\n\nApple, Microsoft, and Google did not respond to requests for comments. Snap Inc., which owns Snapchat, said it would continue cooperating with eSafety but did not directly address the allegations. Meta, owner of Facebook, Instagram, and WhatsApp, stated it would review the regulator’s feedback.\n\nThe eSafety Commissioner emphasized the need for corporate accountability in tackling online abuse, amid growing global scrutiny of tech companies’ responsibilities. Australia has also implemented a unique social media ban for users under 16, aiming to enhance online child safety."
    },
    {
      "heading": "BofA Reworks Credit Cards to Fuel Ambitious Consumer Profit Plan",
      "date": "2026-02-05",
      "tickers": [
        "BAC"
      ],
      "summary": "Bank of America Corp. is pursuing a strategy to double its consumer unit profit to $20 billion annually by 2030, a milestone rarely achieved in the US banking industry. Key elements of this plan include revamping its credit card rewards program, particularly by introducing new incentives for cardholders with higher balances, and expanding its customer base from 69 million to 75 million consumers. The bank is deploying artificial intelligence (AI) and investing millions of dollars to attract new customers and increase engagement among existing ones. AI is used to better assess credit risk, including for applicants with limited credit history, and to enhance underwriting for mortgages and other complex loans.\n\nBank of America aims to grow through targeted outreach using data analytics, trimming expenses, and developing co-brand partnerships with companies like Alaska Air, Royal Caribbean, and Norwegian Cruise Line. While it has focused traditionally on no-fee, cash-back cards, it plans to increase attractiveness by boosting rewards, such as doubling the cash-back rate to 6% for new cardholders in their chosen spending category during the first year. Despite fluctuations in customer satisfaction rankings, the bank seeks to deepen product appeal without altering its conservative lending standards post-2008 financial crisis.\n\nThe bank is also modernizing its physical branch network by opening up to 100 new centers in high-growth areas by next year, renovating existing locations to emphasize personal customer service combined with digital tools. Approximately 55,000 employees currently work in these centers, with anticipated reductions over time due to efficiency gains from AI technologies like the virtual assistant Erica, which supports staff productivity.\n\nBank of America is preparing for potential increases in homebuying activity if borrowing costs decline, aiming to maintain flexible mortgage processing capacities. Ultimately, the success of the bank’s ambitious profit growth target will depend on how effectively it leverages technology and digital tools to enhance customer acquisition, underwriting precision, operational efficiency, and product competitiveness."
    },
    {
      "heading": "Berkshire Utility Presses Wildfire Appeal With Billions at Stake",
      "date": "2026-02-05",
      "tickers": [
        "BRK.B"
      ],
      "summary": "Berkshire Hathaway’s utility unit, PacifiCorp, is appealing a 2023 jury verdict in a wildfire-related class-action lawsuit that could result in billions of dollars in losses. PacifiCorp, the largest grid operator in the western US, was found grossly negligent for failing to shut off power before a series of wildfires in Oregon in September 2020. The jury awarded $645 million to 119 victims, with potential total damages possibly exceeding $6 billion. This judgment has negatively impacted the company’s credit rating and raised concerns about its continued operations in Oregon.\n\nPacifiCorp is asking the Oregon Court of Appeals to dismiss the class action, arguing the case improperly grouped property owners affected by separate wildfires across various locations. The utility also claims an Oregon statute prohibits non-economic damages for wildfire-related property losses. Plaintiffs’ attorneys argue the class action was properly certified and that emotional distress awards averaging $4 million per victim are legally justified. Approximately 1,400 additional claims remain and are slated for resolution over the next two years. The appeals court decision is anticipated within six months to a year."
    },
    {
      "heading": "Goldman Readies $3.75 Billion Debt Offering for DuPont Unit Deal",
      "date": "2026-02-05",
      "tickers": [
        "GS"
      ],
      "summary": "Goldman Sachs Group Inc. is preparing a revised $3.75 billion financing package, likely including a junk bond offering, to support chemical maker Arclin Inc.’s acquisition of DuPont de Nemours Inc.’s Aramids business. The proposed deal would consist of approximately $2.25 billion in dollar- and euro-denominated leveraged loans, $1 billion in privately placed junk bonds, and a $500 million revolving credit facility. The transaction could launch as soon as this week.\n\nInitially, in September, investor discussions focused on a $3 billion term loan, a $500 million revolver, and a $250 million delayed-draw loan. The revised terms follow Arclin’s recent acquisition of adhesive maker Willamette Valley Co. and additional equity injection by Arclin’s private equity owner, TJC LP, into the DuPont deal. Debt offering terms are still being negotiated and may change.\n\nThe decision to include junk bonds in the financing stems from weakness in the US loan market, marked by a selloff in software sector debt that pushed billions of dollars into distress. Leveraged loans in the US have declined to a two-month low. Similarly, banks recently adjusted the funding mix for $1.8 billion of debt backing TreeHouse Foods Inc.’s takeover, reducing loan size and increasing reliance on junk bonds.\n\nArclin agreed in August to acquire DuPont’s Aramids business for about $1.8 billion; the transaction is expected to close in Q1 2026. Aramids are high-strength fibers used in protective gear like body armor and fire-resistant clothing. Arclin last raised $340 million in leveraged loans in May 2024. DuPont has been divesting assets since announcing a broader reorganization in May 2024. Representatives for Goldman Sachs and TJC declined or were unavailable for comment."
    },
    {
      "heading": "Google Backs Up $185 Billion in AI Spending With Receipts",
      "date": "2026-02-05",
      "tickers": [
        "GOOGL",
        "MSFT",
        "AMZN",
        "AAPL"
      ],
      "summary": "Alphabet Inc. announced plans for capital expenditures (CapEx) of $175 to $185 billion in 2026, significantly higher than the $119.5 billion expected by analysts, representing more than a doubling of spending. Initially, this announcement caused Alphabet's shares to drop over 7% in after-hours trading. However, the stock later recovered some losses due to strong quarterly results, including beats on revenue, profits, YouTube advertising, and cloud computing.\n\nAlphabet is aggressively expanding its artificial intelligence (AI) efforts, integrating its Gemini chatbot into products like Gmail and Chrome, which gained 100 million monthly active users quarter-over-quarter. CEO Sundar Pichai noted increased user engagement and emphasized that AI has become an expansion opportunity for Google Search, which saw a 17% year-on-year revenue increase. The company’s agreement to power Apple’s redesigned Siri is expected to further enhance growth.\n\nGoogle Cloud, the company’s AI and hardware platform for enterprises, grew 48% year-on-year, continuing its role as the fastest-growing cloud provider among the main players, helped by investing in its own AI chips and reducing Nvidia hardware dependence. Cloud backlog, representing future computing power agreements, increased 55% year-over-year, driven by multiple customers, contrasting with Microsoft’s backlog concentration in one client.\n\nPichai described the CapEx as an investment in future demand across Google DeepMind and cloud services, signaling confidence in sustained growth. The scale of spending indicates a strategic push to capitalize on AI opportunities over the coming years."
    },
    {
      "heading": "Microsoft Gets Rare Downgrade as Stifel Warns on Azure Growth",
      "date": "2026-02-05",
      "tickers": [
        "MSFT",
        "GOOGL",
        "AMZN"
      ],
      "summary": "Microsoft Corp. was downgraded from buy to hold by Stifel analyst Brad Reback, citing overly optimistic consensus expectations for 2027 and concerns over slowing growth in its Azure cloud business and high artificial intelligence (AI) spending. Reback lowered his price target to $392 from $540, suggesting no near-term catalysts and expecting the stock to remain range-bound until capital expenditure growth slows relative to Azure growth or Azure sees significant acceleration. Despite this, about 96% of analysts maintain buy-equivalent ratings on Microsoft, with an average price target above $600, implying a 45% upside from its recent close at $414.19. Shares fell 2% in premarket trading and have declined 14% since the company’s earnings report, underperforming year-to-date. The results highlighted decelerating cloud sales growth and aggressive capital expenditures, raising concerns about when Microsoft’s AI investments will yield stronger returns. Reback noted that heavy AI spending might limit operating-margin improvement and considered a near-term Azure growth acceleration unlikely, citing supply issues and competitive pressure from Google Cloud Platform (GCP) and growing Anthropic momentum. Microsoft is among the top three cloud providers alongside Alphabet, which recently reported strong cloud growth, and Amazon, set to report after market close. The downgrade comes amid broader investor worries about AI’s impact on software companies, as evidenced by a software sector ETF declining for seven consecutive sessions, losing 15%, and continuing to fall in premarket trading."
    },
    {
      "heading": "Nvidia\u0019s Doubts About OpenAI Are a Warning for Microsoft",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Nvidia CEO Jensen Huang has expressed reservations about his previously announced $100 billion investment in OpenAI, clarifying that the commitment is nonbinding and may be reduced to tens of billions amid OpenAI’s current $100 billion fundraising efforts involving Nvidia, Microsoft, and Amazon. Huang has also privately criticized OpenAI’s business discipline but denies dissatisfaction with the company. OpenAI, under CEO Sam Altman, has faced management instability and aggressive computing commitments totaling $1.4 trillion, far exceeding its expected 2025 revenue, alongside a series of underperforming product initiatives.\n\nMicrosoft, holding a 27% stake in OpenAI valued at around $135 billion following a $13 billion investment, has exclusive access to OpenAI's intellectual property through 2032. Despite this, Microsoft’s flagship AI product, Copilot, lags behind competitors like Anthropic’s Claude Cowork, which offers advanced productivity features. Users find Copilot complicated and limited, highlighting issues in Microsoft’s ability to translate OpenAI’s AI technology into effective products. Microsoft’s internal AI model development efforts are also viewed as inefficient, raising questions about the leadership of its AI division.\n\nTensions exist due to OpenAI’s reluctance to fully share model details with Microsoft. Although integration of OpenAI’s GPT-5 improved Copilot's capabilities, the product still needs enhancements to compete effectively. Analysts warn that if Microsoft does not deliver competitive AI tools soon, leadership changes may ensue. The future of OpenAI’s financing and potential acquisition by Microsoft could hinge on improved execution. The AI landscape is shifting from model innovation to product delivery, and Microsoft’s ability to leverage its privileged OpenAI partnership will be critical to remaining competitive."
    },
    {
      "heading": "Nvidia Partner Hon Hai\u0019s Sales Soar in Sign of Strong AI Demand",
      "date": "2026-02-05",
      "tickers": [
        "NVDA",
        "META",
        "AMZN"
      ],
      "summary": "Hon Hai Precision Industry Co., also known as Foxconn, reported a 35.5% increase in revenue for January, reaching NT$730 billion ($23 billion). This growth indicates strong demand for Nvidia Corp.-related servers amid a global surge in AI development. The year-on-year comparison may be influenced by the timing of the Lunar New Year holidays, which occurred in January in 2025. Hon Hai is expected to report a 28% rise in sales for the first quarter ending in March. As a key manufacturer of servers that house chips for data centers, Hon Hai benefits from significant investments by U.S. companies such as Meta Platforms Inc. and Amazon.com Inc., which are spending billions of dollars on AI infrastructure despite concerns about potential overcapacity and uncertainty regarding AI monetization."
    },
    {
      "heading": "Elon Musk Alone Can\u0019t Explain Tesla\u0019s Owner Exodus",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Tesla faces a decline in sales and market share amid increasing competition and shifting consumer sentiment. In 2025, Tesla’s global sales dropped 9% with U.S. sales down 7%, and its share of newly registered vehicles in California fell below 10%. This decline reflects a broader slowdown in the electric vehicle (EV) market, affected by diminished government incentives, concerns over battery technology, and charging infrastructure challenges. Tesla’s brand value fell 26% to $43 billion in 2025, with Chinese automaker BYD surpassing it as the top EV seller globally.\n\nCustomer dissatisfaction is partly linked to the polarizing public image of CEO Elon Musk, whose controversial behavior and legal issues have alienated some owners. Surveys indicate that Musk’s influence is a notable drawback for Tesla, though consumers also cite outdated vehicle models, quality issues, and weak customer service as reasons for switching brands. Tesla has not released a fully new vehicle since the 2023 Cybertruck and plans to discontinue its oldest models, the Model S and Model X. Meanwhile, competition is intensifying, with over 100 EV models available in the U.S., leading Tesla’s U.S. market share to dip below 50% in 2024, signaling the erosion of its first-mover advantage.\n\nDespite setbacks, Tesla remains focused on technology, including developments in autonomous driving and robotics, with plans to potentially merge with Musk’s AI and space ventures. Customers and industry analysts suggest Tesla’s future growth depends on new products and technological advancements rather than Musk’s public persona. Tesla’s full self-driving system, currently supervised rather than fully autonomous, faces regulatory scrutiny, exemplifying the challenges ahead. Brand loyalty, after a deep decline, has started to recover modestly, aided by incentives and Musk’s less disruptive public behavior."
    },
    {
      "heading": "Tesla Sued Over Crash That Trapped, Killed Massachusetts Driver",
      "date": "2026-02-05",
      "tickers": [
        "TSLA"
      ],
      "summary": "Samuel Tremblett, 20, died from thermal injuries and smoke inhalation after being trapped inside his Tesla Model Y SUV following a crash near Boston in October. According to a lawsuit filed in Massachusetts federal court, Tremblett was unable to open the vehicle’s electrically powered doors and died before rescue. The case highlights ongoing safety concerns about Tesla’s electric door handles, which have reportedly failed to open in at least a dozen incidents over the past decade, resulting in at least 15 deaths.\n\nThe complaint references a 911 call transcript where Tremblett pleaded for help, stating he could not exit the on-fire vehicle. Tremblett’s remains were found in the back seat after the initial impact. Tesla has faced several lawsuits over similar incidents involving door entrapments, including a fatal Cybertruck crash in California.\n\nTesla vehicles feature two batteries: a high-voltage pack for propulsion and a low-voltage battery controlling functions such as doors. If the low-voltage battery fails, electric doors may become inoperable and must be opened manually from inside. While mechanical door releases exist in Teslas, many users are reportedly unaware of their location or operation.\n\nTesla announced plans to redesign its door handles in September and updated safety features in December to automatically unlock doors after serious collisions. However, regulators worldwide have increased scrutiny on electric door systems. China banned concealed exterior handles, European authorities plan accelerated regulations, and the U.S. National Highway Traffic Safety Administration (NHTSA) is investigating potential defects after incidents of door failures, including cases where occupants were trapped.\n\nAdditionally, U.S. lawmakers have proposed legislation to mandate manual door releases and enable emergency responders to access vehicles when power is lost.\n\nThe litigation is filed as Tremblett v. Tesla, 1:26-cv-10567, in the U.S. District Court for the District of Massachusetts."
    },
    {
      "heading": "Watchlist - Bloomberg",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Please provide the financial news article you want summarized."
    }
  ],
  "WSJ": [
    {
      "heading": "A Bullish Tech Roadmap From History",
      "date": "2026-02-05",
      "tickers": [
        "GOOGL",
        "AMZN",
        "AMD"
      ],
      "summary": "The AI-driven software sector is undergoing a significant selloff, affecting not only software firms but also chipmakers like AMD, Qualcomm, and Arm. Alphabet reported strong revenue growth but its stock declined, reflecting investor concerns despite plans to increase capital spending. Amazon’s upcoming quarterly report is highly anticipated. Overall, markets look set for a neutral open while silver and bitcoin prices continue to fall.\n\nAnalysts debate which stage the current AI-driven market rally is in, often using baseball analogies. Bespoke Investment Group notes striking similarities between today’s AI boom and the 1990s internet surge, with a median investor survey response placing the cycle in the fourth inning out of nine. The AI boom started with ChatGPT’s release in late 2022, mirroring how the internet took off with Netscape Navigator in 1994, and has generated trillions in market value since then.\n\nComparisons with the late-1990s tech bubble reveal that the S&P 500’s current valuation already matches late-1999 levels based on metrics like the Shiller P/E ratio. The Nasdaq composite, historically more volatile and tech-focused, could face similar corrections, though the timing and scale remain uncertain. Some prominent price targets and market events reminiscent of the tech bubble are projected over the coming years, but investing solely on historical patterns or charts is cautioned against.\n\nRecent corporate news highlights a mixed earnings season: Qualcomm issued weak guidance citing memory shortages; AMD’s shares dropped sharply after disappointing profits; Shell saw reduced profits due to weaker oil trading; Samsung and SK Hynix shares declined following recent gains. Additionally, Intercontinental Exchange is reporting results after a recent selloff, and ConocoPhillips, Hershey, KKR, Amazon, and Strategy are also scheduled to announce earnings soon.\n\nAlphabet continues to emphasize AI in its growth strategy, with accelerating ad and cloud revenues supporting recent stock gains despite market jitters over increased capital expenditures. The newsletter situates current market activity within historical speculative episodes, such as the 1637 “Tulipmania,” underscoring ongoing investor fascination with market cycles and bubbles."
    },
    {
      "heading": "Alphabet’s Cloud Is Shining as CapEx Heads Even Higher. The Stock Is Falling.",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Alphabet, Google's parent company, reported strong fourth-quarter 2024 earnings, with revenue of $113.8 billion, up 18% year-over-year and surpassing expectations of $111.3 billion. Earnings per share were $2.82, exceeding the consensus estimate of $2.63 and rising from $2.15 a year earlier. The company's advertising revenue was robust, with Search ad revenue up 17% and YouTube ad revenue up 9%, offsetting previous concerns about AI search impacting ad sales.\n\nA key highlight was Alphabet’s increased forecast for capital expenditures through 2026, now projected between $175 billion and $185 billion, significantly above prior expectations of around $115 billion. This spending is largely aimed at expanding AI cloud computing capabilities. Google Cloud revenue reached $17.7 billion, a 48% increase year-over-year and well above analyst expectations, with operating margins improving to 30.1% from 17.5% last year. However, Alphabet CFO Anat Ashkenazi noted that rising depreciation from capex, up 38% in 2025, may pressure operating margins in 2026. CEO Sundar Pichai indicated that Google Cloud expects to remain supply-constrained next year. The cloud backlog grew 55% since the previous quarter, standing at $240 billion.\n\nAlphabet has advanced its AI technology with the release of Gemini 3 models, bringing its capabilities in line with competitors like OpenAI and Anthropic. The company also gained momentum with its custom AI chips, TPU, and secured a major partnership with Anthropic. Regulatory challenges continue, including ongoing appeals related to U.S. antitrust rulings, but recent outcomes have been less punitive than feared.\n\nFollowing months of uncertainty, Alphabet’s shares rose 81% over the past six months, reflecting improving investor sentiment and solid business performance amid a challenging competitive and regulatory landscape."
    },
    {
      "heading": "Amazon Fined in Germany Over Price-Filtering Tools",
      "date": "2026-02-05",
      "tickers": [
        "AMZN"
      ],
      "summary": "German antitrust authorities fined Amazon €59 million ($69.7 million) for using pricing tools that restrict the visibility of third-party sellers’ listings on its marketplace, ruling that these tools breach competition law. The Federal Cartel Office (FCO) stated that Amazon’s system filters or removes seller listings based on pricing, potentially causing significant sales losses for those vendors. Amazon’s mechanism evaluates offers from multiple sellers and prioritizes those likely to attract customers, with the ability to downgrade or remove listings with unusually high prices. The FCO ordered Amazon to stop using these tools except in exceptional cases of excessively high prices.\n\nFCO President Andreas Mundt emphasized that Amazon cannot limit visibility or remove legally permissible offers merely because prices do not meet Amazon’s expectations. The fine reflects economic benefits Amazon gained from the pricing tools and is an initial step, as the company continues to use them. Amazon has one month to appeal before the Federal Court of Justice intervenes.\n\nAmazon Germany’s country manager, Rocco Braeuniger, said the company will appeal and continue operations without disruption. He argued the decision conflicts with EU competition law and would uniquely compel Amazon to promote uncompetitive prices in Germany. The ruling follows heightened regulatory scrutiny since 2022, when Amazon was designated of paramount significance for cross-border competition in Germany, subjecting it to increased monitoring to prevent anticompetitive conduct."
    },
    {
      "heading": "Cathie Wood’s ARK Funds Buy the AMD Stock Drop",
      "date": "2026-02-05",
      "tickers": [
        "AMD",
        "TSLA"
      ],
      "summary": "Cathie Wood’s ARK Investment Management purchased 141,108 shares of Advanced Micro Devices (AMD) on Wednesday, valued at $28.2 million, following a significant drop in the chip maker’s stock. AMD shares declined 17% to $200.19 on Wednesday, marking their worst single-day fall since May 2017, after the company reported solid fourth-quarter earnings and revenue but issued cautious guidance that disappointed investors. Despite this, AMD stock edged up 0.8% to $200.97 on Thursday, supported by optimism from Alphabet’s forecast of increased capital spending benefiting chip makers.\n\nIn addition to AMD, ARK’s exchange-traded funds also acquired shares in several other companies on Wednesday, including Tempus AI (health technology), Tesla (electric vehicles), GeneDx (biotech), CoreWeave (cloud computing), Bullish (cryptocurrency exchange), Circle Internet Group (stablecoin issuer), Brera (soccer club owner), and Kodiak AI (autonomous trucking).\n\nARK Investment Management is known for making sizable investments in technology, artificial intelligence, and cryptocurrency sectors. Its funds performed strongly last year, with the ARK Innovation ETF rising 35% and the ARK Next Generation Internet ETF increasing 37%, both outperforming the S&P 500’s 16% gain. The Next Generation Internet fund has beaten the market for three consecutive years."
    },
    {
      "heading": "Berkshire Is Scoring Big With Japanese Trading Companies: 5 Stocks Worth Almost $40 Billion",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Berkshire Hathaway’s investment in five Japanese trading companies—Itochu, Marubeni, Mitsubishi, Mitsui, and Sumitomo—has grown close to $40 billion in value following a stock rally in 2026. Berkshire holds an average stake of about 9% in these firms, whose market caps range from $4.6 billion (Sumitomo) to over $10 billion (Mitsubishi). All five stocks have risen in 2026, with Mitsubishi and Marubeni up approximately 20%, outperforming the Topix index, which is up 7%.\n\nBerkshire’s original investment cost was $13.8 billion, starting in 2019, and nearly tripled in value. This calculation excludes currency gains, as Berkshire hedged its yen exposure by issuing debt in Japanese currency, resulting in more than $2 billion of after-tax gains due to the yen depreciating about 40% against the dollar since 2020.\n\nThese companies operate in natural resources, infrastructure, investment, and trading, representing Berkshire’s third-largest equity holding behind Apple and American Express. Berkshire acquired the stakes at less than 10 times earnings, with subsequent profit growth and multiple expansion benefiting the investment.\n\nWarren Buffett noted in his shareholder letter that the companies increase dividends prudently, repurchase shares when appropriate, and have conservative executive compensation compared to U.S. peers. Berkshire plans to hold the stakes long term and may increase ownership above 10%, but not significantly higher.\n\nSince the Covid-19 pandemic, Berkshire has had few notable equity wins besides Alphabet, with some missteps and ill-timed sales. The Japanese trading companies stand out as a significant successful investment during this period."
    },
    {
      "heading": "Why Google’s Bad News Was Good News for Broadcom and Nvidia",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Broadcom's stock rose 2% following Alphabet's announcement of a significant increase in capital expenditure, from $91-$93 billion in 2025 to $175-$185 billion this year, primarily directed toward AI infrastructure and data centers. Alphabet plans extensive investments in AI chips, particularly its in-house Tensor Processing Units (TPUs), with Broadcom as a key partner developing these chips. Bank of America analysts estimate that Google accounts for over 80% of Broadcom’s AI compute sales. Approximately 60% of Google's capital spending is expected to focus on short-term assets, including TPUs, though specific AI chip spending was not detailed.\n\nJefferies analyst Blayne Curtis projects a potential $80 billion revenue opportunity for Broadcom by 2027, anticipating that Broadcom will supply 85%-90% of an estimated 6 million TPUs Google will use. Curtis believes Broadcom’s high-performance chips will maintain a dominant market share despite competition from Taiwan’s MediaTek, which J.P. Morgan analysts estimate could secure 30%-40% of the TPU market. However, supply expectations for Broadcom remain stable.\n\nMeanwhile, Nvidia stock dropped 1.3%, as its GPUs are increasingly seen as competitors to TPUs in AI computing, though Alphabet continues to offer both TPU and Nvidia GPU options to cloud customers. Alphabet CEO Sundar Pichai highlighted this diverse compute infrastructure during the company's earnings call."
    },
    {
      "heading": "Broadcom’s stock rises on Google’s spending plans, but Nvidia’s stock extends decline",
      "date": "2026-02-05",
      "tickers": [
        "GOOGL"
      ],
      "summary": "Alphabet’s Google increased its capital expenditure forecast for 2026 to between $175 billion and $185 billion, approximately double its spending in 2023. This rise signals continued investment in artificial intelligence, reflecting the company's commitment to AI-related developments. Despite this significant increase in spending, semiconductor stocks have not responded positively and remain affected by a broader technology sector selloff."
    },
    {
      "heading": "Estée Lauder Sank After Earnings. Better-Looking Days Are Ahead.",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Estée Lauder reported better-than-expected adjusted earnings of 87 cents per share for its fiscal second quarter, but the unadjusted figure, including restructuring costs, was 44 cents. The company also warned that tariffs could reduce fiscal 2026 profits by $100 million. Following the report, Estée Lauder’s stock dropped over 21%—its largest one-day decline in over 30 years—falling to $94.25 and turning the year-to-date gain into a 10% loss, while the S&P 500 remained flat.\n\nDespite an 80% rise in the stock over the past year, investors reacted negatively to ongoing high costs and a profit outlook dampened by tariff impacts. However, some analysts saw positives in the quarter. Organic sales growth accelerated in three of four regions and product categories, with China sales rising 13%, making it the leading contributor to growth. The company raised its organic sales growth forecast for the year to 1%-3%, up from a previous range of flat to 3%.\n\nAnalysts from Raymond James and TD Cowen noted stabilizing U.S. sales, improving margins, growth in China, and early benefits from new sales platforms like Amazon and TikTok Shop. While consistent sales growth may remain challenging, and investor skepticism persists, the stock is expected to find support near current levels.\n\nEstée Lauder’s turnaround appears ongoing but progressing more slowly than anticipated, with full-year forecasts considered conservative amid gradual improvements in key markets and segments."
    },
    {
      "heading": "Google Needed to Calm AI Fears.  What the Stock Market Got Instead.",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Software stocks are experiencing significant declines amid market uncertainty about artificial intelligence (AI). Alphabet, Google's parent company, announced it will invest up to $185 billion in AI this year—doubling last year’s expenditure and exceeding the combined total of the previous three years. Despite strong demand across Google’s services, investors remain concerned about the high costs of AI development and unclear returns, as well as the technology's broad but slow impact on the real economy.\n\nThe tech sector has lost over $1 trillion in value in the past week. The iShares Expanded Tech-Software ETF has dropped nearly 25% over six months. Analysts emphasize that the technology sector is no longer uniform, with AI casting uncertainty over software companies even as semiconductors hit record values. Capital is shifting away from certain tech stocks toward value stocks, energy, industrials, and materials, which have been among the top-performing sectors recently.\n\nEconomic data shows a mixed picture: while GDP growth forecasts may be conservative, labor market growth is weak, with limited private-sector hiring mainly in healthcare and education. Companies' heavy investment in AI appears to coincide with cautious hiring amid economic and geopolitical uncertainties, contributing to a “jobless boom.”\n\nThis dynamic complicates market assessment, fueling volatility. The Cboe VIX volatility index rose 25% recently, indicating expectations of larger daily S&P 500 swings. Investors await key upcoming data, including jobs reports, inflation figures, and Nvidia’s earnings, but for now, the tech selloff remains dominant amid the market’s complex response to AI and economic signals."
    },
    {
      "heading": "Google Needed to Calm AI Fears.  What the Stock Market Got Instead.",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Software stocks are experiencing a significant decline amid market uncertainty surrounding artificial intelligence (AI) and its impact on various sectors. Peripheral assets such as gold, silver, and Bitcoin have also seen notable February declines. Alphabet, Google's parent company, announced plans to invest up to $185 billion in AI this year, doubling last year’s spending and surpassing the total amount invested over the past three years. CEO Sundar Pichai emphasized strong demand across Google's services, but investors remain concerned about the high costs AI companies face without clear returns and the still-limited adoption of the technology across the broader economy.\n\nSoftware stocks have been hit hardest, losing over $1 trillion in value in the past week, with the iShares Expanded Tech-Software ETF down nearly 25% over six months. This contrasts with record highs seen in semiconductor stocks. Investors are increasingly selective within technology, rotating towards value stocks and sectors linked to economic growth like energy, industrials, and materials. The S&P 500 Value index is up 3.9% year-to-date, outpacing the 1.8% decline in the Growth index, while the overall S&P 500 is up 0.35%.\n\nEconomic data presents a mixed picture. While some analysts argue Wall Street's GDP growth forecasts are too pessimistic, labor market data reveals weak private-sector hiring, with gains concentrated in healthcare and education. This suggests a “jobless boom,” with firms investing heavily in AI but reluctant to expand headcount amid tariffs and economic uncertainty.\n\nThis situation highlights the unevenness of the current economy, complicating Federal Reserve policy and dampening consumer spending among lower-income groups. Market volatility has increased, with the VIX index rising 25% over five days, signaling expectations of larger daily swings in the S&P 500. Upcoming economic data, inflation readings, and earnings reports, particularly from Nvidia, will be closely watched, but the tech sector selloff remains dominant for now."
    },
    {
      "heading": "How Apple’s stock has become a surprise winner during the $1.2 trillion tech wipeout",
      "date": "2026-02-05",
      "tickers": [
        "AAPL"
      ],
      "summary": "Tech stocks have recently declined, but Apple (AAPL) has shown positive performance amid this trend. As of Thursday morning, Apple's shares have increased by 6% for the week, while the Nasdaq Composite Index (COMP) has decreased by 3% over the same period. On Wednesday, Apple outperformed the Nasdaq by 4 percentage points, marking its largest one-day outperformance versus the index in over a year, based on Dow Jones Market Data. Apple is the only stock among the \"Magnificent Seven\" group of major tech companies to be in positive territory this week."
    },
    {
      "heading": "Snap Stock Gets Upgraded After Earnings. Not All of Wall Street Is So Optimistic.",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Snap Inc., the parent company of Snapchat, saw its stock downgraded despite an analyst upgrade following its latest quarterly results. B. Riley analyst Naved Khan upgraded Snap shares to Buy from Neutral with a $10 price target, citing progress in developing new revenue streams. Snap reported a 71% increase in paid subscribers year-over-year to 24 million, partly driven by newly introduced charges for memory storage, a service that had previously been free since Snapchat’s 2016 launch. This move toward revenue diversification is significant, as Snap currently relies heavily on advertising revenue, competing with larger firms like Meta and TikTok.\n\nHowever, Snap's stock fell 11% to $5.28 after the company’s fourth-quarter advertising revenue of $1.48 billion slightly missed Wall Street estimates of $1.49 billion. Daily active users declined, which Snap attributed to reduced marketing spend aimed at improving margins and profitability. Additionally, Snap provided guidance for first-quarter revenue below analyst expectations.\n\nOther analysts expressed caution. Canaccord Genuity’s Maria Ripps lowered her price target to $7 from $9, maintaining a Hold rating due to muted advertising revenue growth and economic uncertainties that could affect ad spending. Wells Fargo’s Ken Gawrelski cut his price target to $8 from $10 with an Equal-Weight rating, citing the difficulty smaller firms face in competing with megacap tech companies like Meta, Alphabet, and Amazon, which invest heavily in advertising technology.\n\nOverall, while Snap shows progress in strategic initiatives to diversify and grow revenue, concerns about advertising revenue growth and competitive pressures have impacted investor sentiment."
    },
    {
      "heading": "Why SpaceX Is the Loser in Its Merger With xAI",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "SpaceX has acquired Elon Musk’s AI company, xAI, forming a combined entity Musk describes as a “vertically-integrated innovation engine” focused on advanced AI development, including deploying AI data centers in space to overcome terrestrial constraints. SpaceX, known for its reusable rockets and near-monopoly in Western launch services, has been highly profitable, with estimated EBITDA margins up to 50%—well above the aerospace industry average of around 20%. Its Starlink division reportedly became profitable in 2024.\n\nIn contrast, xAI operates in the competitive, capital-intensive AI market and is currently unprofitable with limited revenue compared to peers like OpenAI, which generated an estimated $13 billion revenue in 2025 but also incurred significant losses. Analysts suggest xAI required SpaceX’s resources more than the reverse, making SpaceX shareholders face higher risk with the merger.\n\nElon Musk, the largest shareholder of both companies, remains supportive. Meanwhile, original Twitter (now X) shareholders stand to benefit significantly. Musk acquired Twitter for $44 billion in 2022, a value that investors writedown by about 80% by 2024. In March 2025, xAI bought Twitter for the same price, and the combined company’s valuation rose to approximately $113 billion. With SpaceX paying an estimated $250 billion for xAI, former Twitter investors have effectively more than doubled their investment within just over four years. SpaceX is expected to seek a valuation increase ahead of a planned 2026 IPO."
    },
    {
      "heading": "How the AI Trade Went From Market Savior to Saboteur",
      "date": "2026-02-05",
      "tickers": [
        "NVDA",
        "AMZN"
      ],
      "summary": "Artificial intelligence (AI), a key driver of recent stock market gains, is now causing investor concern due to its significant funding needs and potential disruption across various tech and other sectors. The Nasdaq Composite, which is tech-heavy, experienced sharper declines than broader indices like the S&P 500 amid these worries. \n\nConcerns intensified following reports that Nvidia’s $100 billion deal to supply AI company OpenAI might face delays, although Nvidia countered these claims, noting the funding deadline extends to later in the year. Additionally, competition fears arose around AI models such as Anthropic’s Claude, which offers services potentially threatening companies like LegalZoom, Thomson Reuters, and ServiceNow.  \n\nBroader investor anxiety centers on how AI firms will secure enormous investments, with OpenAI committing to $1 trillion in spending. Increased competition among major tech firms (\"Magnificent 7\") is driving up AI infrastructure costs, suggesting that investors should not assume all Big Tech companies will benefit equally from AI advances.  \n\nAI’s rapid development raises concerns about the potential obsolescence of entire sectors, which could negatively impact earnings for the Nasdaq and S&P 500 despite productivity gains from AI. Software stocks, which represent over 40% of the Information Technology sector, recently suffered their worst performance relative to the broader market in five years, reflecting rising fears of disruption, layoffs, and credit stress linked to AI's impact.  \n\nDespite the nervousness, analysts recommend diversification rather than exiting tech sectors entirely. Semiconductor and semiconductor equipment companies are seen as relatively resilient due to sustained demand for advanced chips. Consumer discretionary sectors and cyclical industries such as industrials, financials, materials, and energy may also outperform, as their core businesses are less threatened by AI-driven disruption.  \n\nRetail-focused exchange-traded funds (ETFs) are suggested as alternatives for exposure to consumer discretionary trends, offering safer bets compared to tech-heavy options tied to dominant firms like Amazon. Analysts conclude that if economic growth remains steady, the broader market can remain stable even if tech stocks face pressure from AI-related challenges."
    },
    {
      "heading": "These Stocks Are Today’s Movers: Alphabet, Qualcomm, Broadcom, AMD, Strategy, Novo Nordisk, Amazon, and More",
      "date": "2026-02-05",
      "tickers": [
        "GOOGL",
        "AMD",
        "AMZN",
        "LLY"
      ],
      "summary": "Stocks declined on Thursday, extending a three-day selloff in technology shares following Alphabet’s earnings report. Alphabet’s shares dropped 1.3% after beating Q4 earnings and revenue expectations but projecting significantly higher capital expenditures of $175 billion to $185 billion through 2026, surpassing analyst forecasts. The company is investing heavily in AI cloud computing to meet strong demand.\n\nChipmakers saw mixed reactions: AMD fell 3.8% after a sharp 17% loss on Wednesday, while Broadcom gained 3%. Nvidia declined slightly by 0.2% after earlier gains. Qualcomm shares slid 7.5% despite beating fiscal Q1 earnings and revenue forecasts, citing a Q2 revenue outlook below consensus due to memory supply shortages affecting handset customer demand.\n\nOther notable movers included Align Technology, up 8.9%, following better-than-expected Q4 results and higher gross margins. UK-based Arm Holdings rose 7.8% after reporting stronger adjusted Q3 earnings, though it forecast slower revenue growth due to seasonality. Chinese electric vehicle maker NIO’s shares increased 9.9%, driven by its positive Q4 adjusted operating profit projection.\n\nStrategy, a major corporate Bitcoin holder, plunged 14%, correlated with a significant drop in cryptocurrency prices. Bristol Myers Squibb gained 3.6% after surpassing Q4 earnings estimates and offering an optimistic full-year outlook despite declines in legacy drug revenues. Cardinal Health rose 8.9% after raising its fiscal year guidance on solid Q2 revenue.\n\nHims & Hers fell 1.1% after announcing a lower-priced compounded version of the weight-loss drug Wegovy, prompting a 7% drop in Novo Nordisk shares over regulatory concerns. Estee Lauder shares plunged 21% following earnings in line with expectations but cautioning about tariff-related profitability risks for fiscal 2026.\n\nAmazon shares fell 3.8% ahead of its Q4 earnings report, with Wall Street expecting a rise in profits and sales, particularly in its AWS cloud segment.\n\nOverall, technology and healthcare sectors showed volatility amid mixed earnings results and forward guidance."
    },
    {
      "heading": "Tesla Stock Falls. Play the Odds of Musk Merging It With SpaceX.",
      "date": "2026-02-05",
      "tickers": [
        "TSLA"
      ],
      "summary": "Prediction markets, such as Polymarket, allow investors to bet on various outcomes, including a potential merger between Tesla and SpaceX. Currently, the odds for a Tesla-SpaceX merger being announced by June 30 stand at 17%. This implies that a bet of 17 cents would pay out $1 if the merger occurs, otherwise the bettor loses the stake. Interest in merging Musk’s companies into an AI-focused conglomerate has increased recently. In late 2023, Tesla shareholders showed interest in Tesla investing in xAI, which Tesla did by acquiring a $2 billion stake in January. SpaceX then acquired xAI ahead of its planned midyear IPO, aiming to use funds to develop a space-based AI data center.\n\nThe three companies share AI-related objectives: xAI’s Grok chatbot competes with OpenAI and Alphabet, Tesla focuses on AI for robotics and autonomous vehicles, and SpaceX’s satellite-based computing could provide cost-effective computing and AI training capacity. Despite these synergies, a SpaceX IPO appears more imminent and better planned than a merger with Tesla. Investors have placed about $56,000 in total bets on Polymarket regarding the merger, a relatively small amount for financial markets, suggesting limited confidence.\n\nInvestors may also use Polymarket to gauge sentiment shifts on Tesla and other topics. At the time of reporting, Tesla shares were down 2% at $397.82, while the S&P 500 and Dow Jones were down 1% and 0.6%, respectively. The previous day saw a 3.8% drop in Tesla stock amid a broader decline in tech stocks, with the Nasdaq and Nvidia falling 1.5% and 3.4%."
    },
    {
      "heading": "A Strategic Buying Opportunity Is Emerging for Tesla Stock",
      "date": "2026-02-05",
      "tickers": [
        "TSLA"
      ],
      "summary": "Tesla reported earnings on January 29, which disappointed investors and caused the stock to decline by 3.5% on the day. Following this, Tesla shares briefly entered bear market territory, falling more than 20% below their 52-week high of $500, reached on December 22. The stock found support near the $400 level, just above its 200-day simple moving average, marking the first test of this long-term trend line since September when Tesla broke above a symmetrical triangle pattern. This recent dip below $400 was short-lived, similar to a pullback in November, and a rebound toward $500 by the end of the first quarter is considered possible.\n\nHistorically, the $400 level has been significant for Tesla. The stock first approached this level in November 2021, forming a doji candle indicative of a potential trend reversal. Following that, Tesla’s shares declined to near $100 in January 2023 before recovering. The $400 level was also tested in December 2024 and January 2025, resulting in a double top, but Tesla has since closed above $400 for five consecutive months. This suggests the previous resistance at $400 may now be acting as a support level.\n\nThe current technical setup is viewed as offering a favorable risk/reward, with a potential entry near $400 and a suggested stop-loss below $370. Doug Busch, senior technical analyst at Barron’s Investor Circle, presents this analysis as part of his technical stock assessments."
    },
    {
      "heading": "These 10 industrial stocks look ripe as investors rotate toward the sector",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "As of Wednesday, the S&P 500 index was up 0.5% year-to-date for 2026, excluding dividends, despite notable declines in some heavily weighted components. Microsoft, which constitutes 5.2% of the SPDR S&P 500 ETF Trust (SPY) with a market capitalization of $706 billion, had experienced a 14.4% drop in its stock price year-to-date. The SPY ETF tracks the S&P 500 index and is weighted by market capitalization. Early Thursday trading continued the week’s trend of declines in precious metals and bitcoin."
    },
    {
      "heading": "Why Alphabet’s stock is falling despite booming cloud growth",
      "date": "2026-02-05",
      "tickers": [
        "GOOGL"
      ],
      "summary": "Alphabet reported a 48% increase in cloud revenue, reflecting strong growth in its cloud business. However, despite this positive financial indicator, Alphabet's stock declined by about 3% on Thursday morning. This drop appears to be linked to investor concerns over the company's rapidly increasing spending on artificial intelligence. Although several analysts view Alphabet as a notable example of a company leveraging AI investment to achieve significant financial gains, the market remains cautious. Investor worries center on the expectation that Alphabet’s capital expenditures may nearly double in the current year, raising questions about the sustainability and timing of returns from this increased investment."
    },
    {
      "heading": "Why Microsoft’s stock just lost a big fan in the wake of Alphabet’s earnings",
      "date": "2026-02-05",
      "tickers": [
        "GOOGL",
        "MSFT"
      ],
      "summary": "Following Alphabet’s recent earnings report highlighting strong growth in its cloud business, Stifel analyst Brad Reback downgraded Microsoft’s stock rating from buy to hold. Reback cited the absence of near-term catalysts that might drive an increase in Microsoft’s share price as the primary reason for his revision. The downgrade reflects a reassessment of Microsoft’s short-term growth prospects in light of Alphabet’s robust cloud performance."
    }
  ],
  "Reuters": [
    {
      "heading": "Anthropic releases AI upgrade as market punishes software stocks",
      "date": "2026-02-05",
      "tickers": [
        "AMZN",
        "GOOGL",
        "NVDA"
      ],
      "summary": "Anthropic, a San Francisco-based AI startup backed by Amazon and Google’s parent company Alphabet, announced the release of its improved AI model, Claude Opus 4.6, an upgrade from its November Opus 4.5 version. The new model offers enhanced performance on longer tasks and shows improvements specifically in coding and finance applications. Anthropic highlighted the model's ability to process up to 1 million tokens in a single prompt, matching recent capabilities claimed by Google, and previewed its potential to speed up work by distributing tasks among multiple autonomous agents through its programming tool Claude Code.\n\nPositioned as a disruptor in the software industry, Anthropic is advancing its technology ahead of a much-anticipated initial public offering, competing directly with companies like Google and OpenAI. Its AI products, particularly embraced by software developers for coding, are also being marketed to businesses through tools such as Claude Cowork, which aims to assist white-collar workers by handling computer tasks.\n\nThe rapid deployment of AI technologies from Anthropic and others has contributed to declines in traditional software stocks, with shares of firms like Salesforce, Workday, and Thomson Reuters dropping about 3% on the day of the announcement, continuing a recent downward trend. However, some industry leaders, including Nvidia's CEO Jensen Huang, have downplayed fears of disruption, suggesting established software companies’ specialized products, large data resources, and AI integrations will sustain their market positions.\n\nScott White, Anthropic’s head of product for enterprise, emphasized that the company seeks to work alongside existing software tools to enhance their usefulness rather than replace them outright. He described Claude Cowork as “the front door to getting hard work done,” highlighting its integrative role."
    },
    {
      "heading": "Bayer says its experimental blood thinner cuts risk of stroke recurrence by 26%",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Bayer announced that its experimental blood thinner, asundexian, reduced the risk of stroke recurrence by 26% in a Phase III trial called Oceanic-Stroke. The study compared a combination of standard antiplatelet therapy and asundexian against antiplatelet therapy alone in over 12,000 patients with prior stroke or related brain blood vessel blockages. The trial also showed favorable bleeding risk data. Bayer plans to seek regulatory approval for asundexian based on these results. This development supports CEO Bill Anderson’s efforts to improve the company’s performance amid ongoing litigation and financial challenges. Bayer's stock has recently improved following the U.S. Supreme Court decision to review lawsuits over its Roundup weedkiller and the initial positive announcement of asundexian’s trial results. The success of this trial contrasts with a previous unsuccessful Bayer study involving a larger stroke-risk group without prior stroke. Competitors Novartis, Bristol Myers Squibb, and Johnson & Johnson have yet to report comparable late-stage stroke prevention trial results."
    },
    {
      "heading": "Chevron names new heads of strategy, trading, business development",
      "date": "2026-02-05",
      "tickers": [
        "CVX"
      ],
      "summary": "Chevron Corp announced senior leadership changes effective in 2026, involving retirements and internal promotions. Frank Mount, president of corporate business development, will retire in November after 33 years, with Jake Spiering, current director of investor relations, succeeding him on August 1. Jeanine Wai will become director of investor relations on April 1. Patricia Leigh, president of supply and trading, will retire in July after 35 years, with Molly Laegeler, currently chief strategy officer, taking over on March 1 to oversee supply, logistics, and trading. Kevin Lyon, leading the Hess integration, will replace Laegeler as chief strategy officer on the same date. Bruce Niemeyer, president of shale and tight, will retire in October after 26 years, with Gerbert Schoonman succeeding him on April 1; Niemeyer will stay on as senior executive advisor until October. These changes occur amid Chevron’s ongoing integration of Hess assets and a volatile energy market characterized by fluctuating oil prices and increased investor focus on capital discipline and returns."
    },
    {
      "heading": "Cigna beats quarterly estimates, provides muted outlook",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Cigna reported fourth-quarter adjusted earnings per share of $8.08, exceeding analyst expectations of $7.88, supported by strong performance in its pharmacy benefits unit, Evernorth, whose revenue rose 20% to $36.3 billion. The company’s shares increased 3% in early trading following the earnings release. Despite the positive quarterly results, Cigna issued a cautious 2026 outlook, with adjusted profit per share forecasted at a minimum of $30.25, slightly below the consensus estimate of $30.36, and revenue expected around $280 billion, under analyst projections of $283.86 billion. The company anticipates annual medical loss ratios between 83.7% and 84.7%, with a first-quarter ratio projected below 81%, reflecting ongoing cost pressures, particularly from individual and family plans. Cigna has been reducing its exposure to Medicare Advantage and Affordable Care Act plans, focusing more on pharmacy benefits and employer-sponsored health plans. The company noted that the elimination of rebates in its pharmacy business will pressure profits over the next two years due to customer transitions to a new pricing model. Additionally, Cigna settled a Federal Trade Commission lawsuit concerning insulin pricing, agreeing to changes to lower costs for patients and insurers; this settlement is not expected to affect the 2027 outlook. CFO Ann Dennison emphasized cautious financial assumptions amid persistent elevated medical costs."
    },
    {
      "heading": "Coca-Cola to discontinue frozen products in US and Canada",
      "date": "2026-02-05",
      "tickers": [
        "KO"
      ],
      "summary": "Coca-Cola announced it will discontinue its frozen product line, including Minute Maid frozen items, in the U.S. and Canada by the first quarter of 2026 due to changing consumer preferences. The company aims to focus on product categories that align better with current consumer demand, such as its growing juice segment and premium offerings like Fairlife milk, as well as zero-sugar beverages. This decision comes amid a challenging regulatory environment for packaged foods in the U.S. and evolving market dynamics, including increased demand for low-calorie options and a shift toward local products in markets like India and China. Coca-Cola also plans to introduce a cane sugar version of its flagship soda in glass bottles in the U.S. The company’s new CEO, Henrique Braun, appointed in December, is guiding these strategic adjustments amid a shifting consumer landscape."
    },
    {
      "heading": "ConocoPhillips targets $1 billion cost cuts in 2026; profit misses on weaker oil prices",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "ConocoPhillips reported a fourth-quarter adjusted profit of $1.02 per share, below the analyst estimate of $1.11, due to weaker crude prices. Its average realized price fell 19% to $42.46 per barrel of oil equivalent, partly offset by a 6.3% increase in production to 2.32 million barrels per day. The company forecasts 2026 production between 2.33 million and 2.36 million barrels per day. Benchmark Brent crude prices averaged $63.13 per barrel in the quarter, down 11.3% year-over-year amid oversupply concerns and tariffs.\n\nIn response to falling oil prices, ConocoPhillips plans to reduce capital and operating costs by $1 billion in 2026, building on over $1 billion in cost synergies from its $22.5 billion acquisition of Marathon Oil. The company aims to return 45% of cash from operations to shareholders. It closed $3.2 billion in asset sales in 2025 and remains on track to sell $5 billion in assets by the end of 2026. Additionally, a workforce reduction of 20% to 25% is underway as part of a broader restructuring. The company faces investor scrutiny over the timing of free cash flow improvements and shareholder returns.\n\nCEO Ryan Lance also discussed ongoing efforts to recover funds from legal judgments related to its former operations in Venezuela and engagement with the U.S. administration on policy matters concerning the country. Unlike Chevron, which continues to operate in Venezuela under new agreements, ConocoPhillips exited and pursued arbitration after nationalization of the industry between 2004 and 2007. Following the earnings report, ConocoPhillips shares declined 3% in afternoon trading."
    },
    {
      "heading": "CVS Health to drop Amgen and Lilly's bone disease treatments from some drug lists",
      "date": "2026-02-05",
      "tickers": [
        "CVS",
        "LLY",
        "UNH"
      ],
      "summary": "CVS Health announced it will replace Amgen's Prolia and Eli Lilly's Forteo bone disease treatments with lower-cost alternatives on some preferred drug lists starting April 1. Its pharmacy benefit management unit, Caremark, will add biosimilars such as Ospomyv (from CVS unit Cordavis) and Celltrion's Stoboclo as alternatives to Prolia. It will also include generic versions of Forteo, including Bonsity and Tymlos, on major national commercial formularies. CVS stated this change will reduce prescription costs by over 50% compared to branded drugs. Its biosimilar formulary strategy has saved customers and members $1.5 billion to date.\n\nKey U.S. patents for Prolia expired in 2025, and primary patents for Forteo expired in 2019. Amgen reported global Prolia sales of approximately $1.05 billion in 2025. This move follows Caremark's 2024 decision to exclude AbbVie’s Humira from its lists, favoring biosimilars, with around 96% of Humira users switching accordingly.\n\nBiosimilars differ from conventional generics because they are not exact copies, given the complexity of biotech drugs derived from living cells. Pharmacy benefit managers (PBMs) like Caremark act as intermediaries for employers and health plans, negotiating drug prices and creating insurance formularies. CVS Caremark, Cigna's Express Scripts, and UnitedHealth Group's Optum Rx collectively control about 80% of the U.S. prescription drug market."
    },
    {
      "heading": "German cartel office bans Amazon from using price controls",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Germany's cartel office has banned Amazon from imposing price caps on third-party sellers in its German online marketplace. This marks the first time the office has claimed that Amazon earned several million euros through anti-competitive practices. Cartel office president Andreas Mundt stated that Amazon competes directly with other sellers on its platform, and influencing their pricing is only allowed in exceptional cases such as price gouging. Due to Amazon's continued use of its pricing policies, the office, empowered by 2023 reforms, is demanding an initial payment of 59 million euros ($69.54 million) from Amazon. The company has one month to appeal. Rocco Braeuniger, Amazon Germany's country manager, said the firm plans to challenge the decision and maintain normal operations, warning that forcing uncompetitive or abusive prices could harm the shopping experience. Separately, in October, German regulators began investigating China's Temu for potential pricing influence over third-party vendors on its platform."
    },
    {
      "heading": "Germany to require streaming platforms to invest in local production",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Germany will implement new regulations requiring streaming platforms and TV broadcasters to reinvest a minimum of 8% of their annual revenue generated in the country into the local film industry. If these companies invest 12% or more, they will be exempt from some regulatory requirements, such as producing films in the German language. The initiative aims to enhance Germany’s position as a film-making hub by supporting jobs, value creation, and creative quality in the sector.\n\nThe government will also nearly double annual funding for domestic film production to 250 million euros (approximately $295.2 million). These measures come amid rising production costs linked to labor, energy, and materials, despite increased demand from streaming platforms. Germany’s approach aligns with similar regulations in at least a dozen other European countries, including France and Italy, which require streaming services to invest in local content.\n\nThe new rules are expected to be formalized into law by the German cabinet before early April. Details regarding penalties for non-compliance have not yet been disclosed. This policy change coincides with the Berlin Film Festival, where industry representatives will convene to discuss developments in the sector."
    },
    {
      "heading": "Rival bidders pursue Lukoil assets despite Carlyle deal, sources say",
      "date": "2026-02-05",
      "tickers": [
        "CVX"
      ],
      "summary": "Lukoil is in the process of selling its global assets by a February 28 deadline set by the U.S. Treasury, following sanctions imposed on Lukoil and Rosneft to encourage a peace deal in Ukraine. Although Lukoil initially agreed to sell the portfolio, valued at around $22 billion, to U.S. private equity firm Carlyle on January 29, multiple other parties remain involved in negotiations. Among these are Chevron, in partnership with Quantum Energy Partners, and a consortium led by investment bank Xtellus Partners, which is collaborating with American billionaire Todd Boehly and UAE’s Allied Investment Partners. The consortium has proposed paying with frozen Lukoil shares held by U.S. investors rather than cash.\n\nThe sale excludes Lukoil’s assets in Kazakhstan. Carlyle is reportedly exploring partnerships with Abu Dhabi-based Mubadala, XRG, IHC, and the U.S. Development Finance Corporation. However, the U.S. Treasury’s Office of Foreign Assets Control (OFAC) has rejected bids from other interested parties including commodity trader Gunvor and Xtellus. The transaction still requires approvals from OFAC, the Kremlin, and the Russian central bank. Lukoil confirmed ongoing talks with various potential buyers. The outcomes remain uncertain as the deal has not yet been finalized."
    },
    {
      "heading": "Snowstorms boost US weekly jobless claims; job openings hit more than five-year low",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Last week, initial U.S. unemployment benefit claims rose unexpectedly by 22,000 to 231,000, the largest increase since early December, largely due to severe winter weather affecting large parts of the country. The four-week moving average of claims increased by 6,000 to 212,250. Continuing claims, representing ongoing unemployment benefits, rose 25,000 to 1.844 million. These short-term disruptions did not indicate a broad weakening in the labor market, with layoffs remaining low.\n\nIn December, job openings dropped by 386,000 to 6.542 million, reaching the lowest level since September 2020 and below economists’ expectations. The professional and business services sector saw two-thirds of this decline, with 257,000 fewer vacancies, partly attributed to the influence of artificial intelligence causing businesses to pause hiring. Other sectors with notable reductions included retail, financial activities, healthcare, and arts and entertainment. The job openings rate fell to 3.9%, down from 4.2% in November.\n\nHiring rose by 172,000 to 5.293 million, supported by gains in healthcare, social assistance, accommodation, and food services, although hiring slowed in professional and business services. The hires rate edged up to 3.3%. The quits rate, an indicator of worker confidence, remained stable at 2.0%, with increased resignations in retail but declines in professional services. The layoffs rate held steady at 1.1%.\n\nOverall, economists view the labor market as stable but cautious, reflecting ongoing uncertainties from import tariffs and technological shifts like AI. The upcoming January employment report is expected to confirm this steady labor market condition. The Federal Reserve maintained interest rates at 3.50%-3.75%, likely continuing this stance through mid-year amid the current labor market data."
    },
    {
      "heading": "Spotify to let users buy physical books on app through Bookshop.org partnership",
      "date": "2026-02-05",
      "tickers": [],
      "summary": "Spotify announced it will start selling physical books on its streaming platform through a partnership with online retailer Bookshop.org, expanding beyond its existing audiobooks business. The new feature will roll out in the U.S. and UK later this spring, with Bookshop.org managing pricing, inventory, and fulfillment. Spotify will earn an affiliate fee on in-app purchases.\n\nSince launching its audiobooks service two years ago, Spotify's Premium Audiobooks offering has expanded to 22 markets, with an English catalog exceeding 500,000 titles. The company reported a 36% increase in new audiobook listeners and a 37% rise in listening hours year-over-year.\n\nThe physical book sales initiative comes amid a broader slowdown in physical book sales industry-wide, as more consumers shift to e-books. News Corp noted declining book orders last year, and library book distributor Baker & Taylor ceased operations in January.\n\nSpotify also introduced \"Page Match,\" a feature allowing users to scan a page from a physical or e-book within the app to jump to the corresponding point in the audiobook. This tool will launch with most English-language titles and be fully available by February 23.\n\nAdditionally, Spotify raised its monthly premium subscription price by $1 to $12.99 in the U.S., Estonia, and Latvia. Following the announcement, Spotify’s shares fell 4.5%, after gaining nearly 30% in the previous year."
    },
    {
      "heading": "UPS, Amazon boost US planned layoffs in January, Challenger survey shows",
      "date": "2026-02-05",
      "tickers": [
        "AMZN"
      ],
      "summary": "In January 2026, planned layoffs in the U.S. surged to 108,435, a 205% increase from the previous January and the highest for any January in 17 years, according to Challenger, Gray & Christmas. This level parallels cuts seen near the end of the Great Recession in 2009. The rise reflects employers’ less optimistic economic outlook for 2026 and is primarily driven by losses of business contracts and uncertain market conditions.\n\nThe transportation sector led with 31,243 planned cuts, largely due to United Parcel Service’s announcement to eliminate up to 30,000 jobs and close 24 facilities as part of a shift towards more profitable operations and reduced package deliveries for Amazon. The technology sector planned 22,291 layoffs, mostly from Amazon’s plan to cut 16,000 corporate jobs. Despite these cuts, such layoffs have not significantly influenced unemployment claims data.\n\nHealthcare also saw notable job reduction plans, partly due to lower reimbursements from federally funded Medicaid and Medicare programs. The primary reasons for layoffs were contract losses, market and economic conditions, restructuring, and closures of stores or departments. Artificial intelligence was cited in 7% of planned layoffs but its exact impact remains unclear.\n\nHiring plans were weak, with only 5,306 new job intentions announced, the lowest January figure since 2009, mainly in the insurance industry."
    },
    {
      "heading": "US software shares sink further on mounting fears over AI disruption",
      "date": "2026-02-05",
      "tickers": [
        "MSFT",
        "GOOGL"
      ],
      "summary": "Shares of U.S. software and data services companies declined for a seventh consecutive session on February 5, 2024, driven by investor concerns about the disruptive impact of rapidly advancing artificial intelligence (AI) tools on the sector. The S&P 500 software and services index fell 3.1%, wiping out roughly $1 trillion in market value since January 28. Major tech firms hit hardest included ServiceNow (down 6%), Salesforce (down 5%), and Microsoft (down 3%).\n\nCanada-based Thomson Reuters dropped 9% despite raising its dividend and reporting mostly in-line fourth-quarter results, after investors expressed worries that Anthropic’s Claude AI plug-in could challenge its legal business. The company acknowledged benefits from AI investments but signaled uncertainty about AI's long-term impact on earnings.\n\nGoldman Sachs highlighted that near-term earnings will be critical to gauge sector resilience amidst AI uncertainty. The ongoing selloff, which has deterred typical dip-buyers, has pushed the software index about 20% below its 200-day moving average, the lowest since June 2022. Market strategists noted a broader rotation away from technology toward value sectors like consumer staples, energy, and industrials, previously underperformers.\n\nShort interest in mid- to large-cap software firms, especially in cybersecurity and SaaS, has increased significantly over the past three months, reflecting growing bearish sentiment. Hedge funds have sharply reduced exposure to software but remain net long. The decline also affected firms linked to software, such as asset managers with private credit loans tied to the sector; for example, Blue Owl’s software exposure makes up 8% of its assets under management.\n\nInternationally, reactions were mixed: London Stock Exchange Group, RELX, and Wolters Kluwer shares rose, while India’s software exporters index edged down after a recent steep drop. Alphabet’s announcement to nearly double capital expenditures intensified concerns over AI investment returns and contributed to the broader tech selloff.\n\nMarket volatility increased across equities, commodities, and digital assets, attributed in part to forced unwinding of leveraged positions. The Cboe Volatility Index (VIX) rose to a two-month high before easing slightly. Precious metals and bitcoin also declined following earlier sharp drops.\n\nOverall, the evolving AI landscape is fueling uncertainty, prompting significant sector rotation and heightened market volatility."
    },
    {
      "heading": "Wall Street tumbles as AI worries weigh",
      "date": "2026-02-05",
      "tickers": [
        "MSFT",
        "GOOGL",
        "AMZN",
        "NVDA"
      ],
      "summary": "On February 5, Wall Street declined, with the Nasdaq falling to its lowest level since November, driven by losses in major tech companies including Microsoft, Amazon, and Alphabet. Alphabet’s shares dropped 4.2% after it announced plans to nearly double its capital expenditure to $185 billion by 2026, part of a broader push by Big Tech to invest over $500 billion in AI this year. Microsoft fell 3.2%, Palantir 6%, Oracle 5.6%, and Amazon slid 4% ahead of its earnings report, as investors scrutinized AI-related spending and its impact on future profits. Nvidia, a key AI hardware supplier, saw its shares largely unchanged.\n\nInvestor sentiment has turned cautious amid concerns about the large capital expenditures on AI without clear revenue gains so far. There is growing anxiety that AI advancements could reduce demand for traditional software, potentially squeezing profit margins across the sector. Software and data services stocks declined further, with ServiceNow down 5.5% and Salesforce 4.8%, contributing to a 3.2% fall in the S&P 500 software and services index for a seventh consecutive down session.\n\nQualcomm’s shares dropped 7.2% after forecasting second-quarter earnings below expectations. The CBOE volatility index briefly reached its highest level in over two months, reflecting increased market uncertainty. Meanwhile, investors have shifted focus toward relatively cheaper stocks, with the S&P 500 value index down slightly but still positive for the week, while the growth index fell over 4%.\n\nThe overall S&P 500 index declined 0.96% to 6,816.32, the Nasdaq dropped 1.12% to 22,648.66, and the Dow Jones fell 0.95% to 49,029.78. Most S&P 500 sectors were lower, led by materials (-2.69%) and consumer discretionary (-2.25%). Despite some mixed earnings results—Snap’s shares fell nearly 10% despite beating revenue estimates, Estee Lauder declined 20% following a weak forecast, Tapestry rose 10% with an upgraded profit outlook, and Hershey gained 8.8% after strong annual profits—the market trend remained negative.\n\nLabor market data showed an unexpected rise in new unemployment claims and a drop in job openings to a five-year low, adding to economic uncertainty. Decliners outpaced advancers on the S&P 500 by a 2.1-to-1 ratio. The index recorded 44 new highs and 9 new lows, while the Nasdaq registered 103 new highs against 365 new lows."
    }
  ]
}