{
  "WhiteHouse": [
    {
      "title": "United States-India Joint Statement",
      "date": "2026-02-06",
      "summary": "The United States and India have agreed on a framework for an Interim Agreement on reciprocal trade as part of ongoing Bilateral Trade Agreement (BTA) negotiations started in February 2025. The key provisions include:\n\n- India will eliminate or reduce tariffs on U.S. industrial goods and various food and agricultural products such as dried distillers’ grains, tree nuts, fruit, soybean oil, wine, and spirits.\n- The U.S. will impose an 18% reciprocal tariff on certain Indian-origin goods, including textiles, leather, plastics, organic chemicals, home décor, artisanal products, and machinery. Upon the agreement's completion, the U.S. will remove reciprocal tariffs on goods such as generic pharmaceuticals, gems, diamonds, and aircraft parts.\n- The U.S. will remove tariffs on certain Indian aircraft and parts previously imposed for national security reasons; similarly, India will grant preferential tariff rates on automotive parts related to its own national security tariffs.\n- India may receive negotiated benefits regarding generic pharmaceuticals pending U.S. investigations.\n- Both countries will provide preferential market access in sectors of interest and set rules of origin to ensure benefits mainly accrue to them.\n- They will address non-tariff barriers, including India's commitments to ease trade restrictions on U.S. medical devices, ICT goods, food, and agricultural products, and consider standards and testing requirements to facilitate trade.\n- Both countries may adjust commitments if tariff changes occur.\n- The U.S. will consider India's request to lower tariffs on Indian goods as BTA negotiations continue.\n- They will enhance economic security alignment and supply chain resilience through cooperation on investment reviews, export controls, and addressing third-party non-market policies.\n- India plans to purchase $500 billion of U.S. energy products, aircraft and parts, precious metals, technology products (including data center goods like GPUs), and coking coal over five years.\n- They will work on reducing barriers to digital trade and aim for strong digital trade rules within the BTA.\n- The framework will be implemented promptly, with efforts to finalize the Interim Agreement and conclude the broader BTA according to an agreed roadmap."
    },
    {
      "title": "Establishing an America First Arms Transfer Strategy",
      "date": "2026-02-06",
      "summary": "The President issued an executive order establishing the \"America First Arms Transfer Strategy.\" The order directs U.S. government agencies to use arms sales as a tool of foreign policy and to grow domestic defense production capacity. Key points include:\n\n- Prioritizing arms sales to support national security and industry reindustrialization.\n- Encouraging foreign partners to purchase American-made defense equipment to expand U.S. production and supply chains.\n- Streamlining and coordinating arms transfer processes across the Department of War, Department of State, and Department of Commerce.\n- Setting deadlines (within 60 to 120 days) for agencies to submit plans, sales catalogs, and recommendations to implement the strategy.\n- Establishing an interagency Task Force to oversee implementation and improve accountability and transparency.\n- Improving coordination on end-use monitoring, third-party transfers, and Congressional notifications related to arms sales.\n- Publishing quarterly performance metrics on Foreign Military Sales (FMS) and export license adjudications.\n- Clarifying that the order does not change legal authorities or create enforceable rights and is subject to appropriations.\n\nThe order was signed by President Donald J. Trump on February 6, 2026."
    },
    {
      "title": "Fact Sheet: President Donald J. Trump Establishes the America First Arms Transfer Strategy",
      "date": "2026-02-06",
      "summary": "On [date not specified], President Donald J. Trump signed an Executive Order establishing the America First Arms Transfer Strategy. The strategy aims to ensure that U.S. arms transfers support the American industrial base as a primary source for defense equipment for the United States and its partners.\n\nKey components of the strategy include:  \n- Building production capacity for weapons relevant to the National Security Strategy  \n- Supporting domestic reindustrialization and strengthening the defense industrial base  \n- Enhancing critical supply chains  \n- Prioritizing partners who invest in their own defense and hold strategic geographic importance  \n\nThe Executive Order directs the Secretaries of War, State, and Commerce to:  \n- Create a sales catalog of prioritized military platforms and systems  \n- Increase advocacy for arms transfers aligned with the strategy  \n- Coordinate closely with industry  \n\nA Promoting American Military Sales Task Force will be established to oversee the strategy’s implementation and monitor major defense sales.\n\nThe Order also calls for efforts to reduce bureaucratic delays in areas such as Enhanced End Use Monitoring, Third-Party Transfers, and Congressional Notifications. It requires quarterly publication of aggregate performance metrics on defense sales execution to improve transparency.\n\nThe strategy aims to leverage over $300 billion in annual defense sales to revitalize the U.S. defense industrial base and improve delivery speed of American-produced weapons to partners and allies.\n\nThe Executive Order builds on previous actions by President Trump in 2025 and 2026, including measures to modernize defense acquisitions, improve foreign defense sales speed and accountability, and restrict defense contractors from prioritizing stock buybacks over production and delivery commitments."
    },
    {
      "title": "Fact Sheet: President Donald J. Trump Addresses Threats to the United States by the Government of Iran",
      "date": "2026-02-06",
      "summary": "President Donald J. Trump signed an Executive Order that continues the national emergency related to Iran and establishes a process to impose tariffs on countries that buy goods or services from Iran. The Order permits the U.S. to add tariffs on imports from any country that directly or indirectly obtains goods or services from Iran. The President can modify the Order based on changes in circumstances or if Iran or affected countries take significant actions addressing the national emergency. The Secretary of State, Secretary of Commerce, and U.S. Trade Representative are authorized to implement the tariff system and related measures.\n\nThe White House states that Iran pursues nuclear capabilities, supports terrorism, develops ballistic missiles, and destabilizes the region, threatening U.S. security and allies. Iran is described as a leading state sponsor of terrorism, supporting proxy groups in the Middle East. The regime is said to spend resources on nuclear and missile programs while its population and infrastructure face difficulties. The administration describes Iran’s government as repressive and violent toward its own people, spreading extremism and undermining peace and stability efforts.\n\nPresident Trump reaffirms his commitment to preventing Iran from acquiring nuclear weapons. He withdrew from the Iran nuclear deal during his first term, imposed maximum pressure including designating Iran’s Islamic Revolutionary Guard Corps as a Foreign Terrorist Organization, and continues these policies. The release claims that in June, after failed negotiations, the President authorized Operation Midnight Hammer to destroy parts of Iran’s nuclear facilities. The administration deployed military forces to the region to encourage Iran to negotiate a nuclear deal or face stronger consequences.\n\nThe statement also notes recent U.S. actions against other regimes, including efforts to remove Venezuela’s Nicolás Maduro and tariffs on countries supplying oil to Cuba, emphasizing a stance against dictators and state sponsors of terrorism."
    },
    {
      "title": "Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer",
      "date": "2026-02-06",
      "summary": "The White House announced that President Donald J. Trump signed a proclamation temporarily increasing the U.S. tariff-rate quota for lean beef trimmings. This allows an additional 80,000 metric tons per year of lean beef trimmings from Argentina to be imported tariff-free, distributed in four quarterly shipments of 20,000 metric tons each. The Secretary of Agriculture, working with the U.S. Trade Representative, will monitor domestic beef supplies and imports and may recommend further actions as needed.\n\nThe announcement cited several factors contributing to reduced domestic beef supply, including a record low U.S. cattle herd of 86.2 million head as of January 2026, an 8.6% decline in beef cow inventory since 2020, drought, wildfires, and restrictions on cattle imports from Mexico due to livestock disease concerns. These conditions have contributed to high ground beef prices, reaching an average of $6.69 per pound in December 2025.\n\nThe release also referenced previous policy actions by the Trump administration aimed at supporting ranchers and reducing grocery prices, including tax cuts passed in July 2025, efforts to strengthen the beef industry announced in October 2025, and an executive order signed in December 2025 targeting price fixing and anti-competitive behavior in the food supply chain. The administration stated commitments to reducing risks for cattle producers and supporting the ranching industry."
    },
    {
      "title": "Fact Sheet: President Donald J. Trump Unleashes Commercial Fishing in the Atlantic",
      "date": "2026-02-06",
      "summary": "President Donald J. Trump signed a proclamation to reopen commercial fishing in the Northeast Canyons and Seamounts Marine National Monument, an area of 4,913 square miles off New England's coast. This area had been closed to commercial fishing since 2016 when it was established by President Obama, restrictions later lifted by Trump, then reinstated by President Biden in 2021. The proclamation aims to remove these fishing restrictions, citing existing laws that protect fish species in the area. It supports New England fishing communities and industries, including longline fishing and Maine lobster. This action is part of Trump's broader efforts to promote the U.S. fishing industry, which include similar moves in the Pacific, regulatory changes, tariffs on imports affecting the fishing sector, and halting offshore wind projects to protect fishing interests."
    },
    {
      "title": "Protecting the National Security and Welfare of the United States and its Citizens from Criminal Actors and Other Public Safety Threats",
      "date": "2026-02-06",
      "summary": "The President issued an executive order directing the Department of Homeland Security (DHS) and other agencies to enhance access to and exchange of criminal history record information (CHRI). DHS is tasked with protecting the U.S. borders from illegal entry and criminal threats, including foreign nationals violating immigration or criminal laws. The Attorney General will provide DHS with CHRI maintained by the Department of Justice to support DHS screening and vetting activities. DHS may also share felony conviction records with border security and immigration authorities of Visa Waiver Program countries, countries with relevant law enforcement agreements, and trusted allies for traveler and immigrant screening, based on reciprocal agreements with privacy safeguards. The order affirms that it does not alter existing legal authorities or rights, must comply with applicable law and funding, and that DHS will cover publication costs. The order was signed on February 6, 2026."
    },
    {
      "title": "Congressional Bill S. 3424 Signed into Law",
      "date": "2026-02-06",
      "summary": "On February 6, 2026, the President signed into law S. 3424, the Bankruptcy Administration Improvement Act of 2025. The law increases fees for Chapter 7 Bankruptcy trustees, extends quarterly fees for Chapter 11 Bankruptcy for five more years, and extends certain temporary bankruptcy judgeships for five additional years."
    },
    {
      "title": "Addressing Threats to the United States by the Government of Iran",
      "date": "2026-02-06",
      "summary": "The President has issued an executive order to address the national emergency related to the Government of Iran, originally declared in 1995 and expanded by subsequent orders due to threats posed by Iran to U.S. national security, foreign policy, and economy. The order directs the imposition of additional tariffs (e.g., 25%) on imported goods that come from countries that directly or indirectly purchase, import, or acquire goods or services from Iran.\n\nThe Secretary of Commerce will determine which countries engage in such trade with Iran and inform the Secretary of State. The Secretary of State, in consultation with other senior officials, will decide if and to what extent the tariffs should apply to those countries and make recommendations to the President, who will have final approval authority.\n\nThe order authorizes relevant government officials and agencies to implement and enforce these measures, monitor compliance, and adjust the order as needed based on ongoing developments, potential retaliations by foreign countries, or changes in Iran's behavior.\n\nThe order defines key terms related to Iran and Iranian goods and services, clarifies delegation of authorities, and states that it becomes effective on February 7, 2026. The order also provides for severability, ensuring that if one part is invalidated, the rest remain in effect."
    },
    {
      "title": "Unleashing American Commercial Fishing in the Atlantic",
      "date": "2026-02-06",
      "summary": "The proclamation states the following key facts:\n\n- In 2016, President Obama designated about 4,913 square miles of waters and submerged lands off the northeastern U.S. coast as the Northeast Canyons and Seamounts Marine National Monument under the Antiquities Act.\n- In 2020, President Trump issued a proclamation that removed restrictions on commercial fishing within the monument, citing existing federal laws that protect fish species and habitats.\n- In 2021, President Biden reinstated the commercial fishing prohibitions within the monument, citing potential harm from fishing activities.\n- After further review, the 2026 proclamation by President Trump revokes President Biden’s 2021 proclamation and restores the 2020 policy allowing commercial fishing within the monument.\n- The proclamation states that existing federal laws, including the Magnuson-Stevens Fishery Conservation and Management Act and other environmental statutes, provide protections for the monument’s resources and marine species.\n- The Northeast Canyons and Seamounts Marine National Monument will be managed under the 2020 proclamation allowing commercial fishing, overriding any conflicting terms in the original 2016 designation.\n- The proclamation was signed on February 6, 2026, by President Donald J. Trump."
    }
  ]
}