{
  "AAPL": [
    {
      "heading": "Tyler, The Creator is Apple Music’s Artist of the Year for 2025",
      "date": "2025-11-20",
      "summary": "SpongeBob: Patty Pursuit 2, a sequel to the game SpongeBob: Patty Pursuit, will launch on December 4 exclusively on Apple Arcade. The game features SpongeBob and Plankton working together to recover the Krusty Krab’s fry cook station, find Plankton’s missing inventions, and save Bikini Bottom. It supports local co-op play and includes various puzzle and boss challenges across locations from the SpongeBob series.\n\nApple Arcade will also release five new games soon: Glassbreakers: Champions of Moss on November 13 for Apple Vision Pro; and on December 4, PowerWash Simulator, Cult of the Lamb Arcade Edition, Subway Surfers+, and NARUTO: Ultimate Ninja STORM+.\n\nApple Arcade subscriptions cost £6.99 per month with a one-month free trial and are included in Apple One plans. The service supports play across multiple Apple devices and allows up to six family members unlimited access to its games."
    }
  ],
  "AMZN": [
    {
      "heading": "West Ham United teams up with AWS and Crayon to create revolutionary talent identification platform",
      "date": "2025-11-20",
      "summary": "Genspark, an AI startup serving over 20 million users, has chosen Amazon Web Services (AWS) as its preferred cloud provider. Using AWS infrastructure and AI tools, Genspark reduced development and operational costs and improved the performance of its AI products. The company leverages AWS services such as Amazon EC2 Spot Instances to cut GPU costs by 60-70% and Amazon Bedrock to lower model inference costs by 72%. Founded in 2023, Genspark offers AI tools including Super Agent, AI Slides, AI Sheets, and AI Designer. The company has raised $160 million in funding and reached $50 million in annual recurring revenue within five months."
    },
    {
      "heading": "Cohesity Establishes Strategic Collaboration Agreement with AWS to Advance AI-Powered Cyber Resilience at Scale",
      "date": "2025-11-20",
      "summary": "Genspark, a startup founded in 2023 that builds general-purpose AI agents and serves over 20 million users, has chosen Amazon Web Services (AWS) as its preferred cloud provider. Using AWS infrastructure and AI capabilities, Genspark has lowered development and operational costs while improving product performance. AWS services such as Amazon EC2 Spot Instances and Amazon Elastic Kubernetes Service help reduce GPU costs by up to 70% and enhance computing efficiency. Genspark also uses the Claude models through Amazon Bedrock to power its AI products, cutting model inference costs by 72%. The company participated in AWS programs that supported its product rollout and global expansion. Genspark has raised $160 million in funding, reached $50 million in annual recurring revenue within five months, and offers AI tools like Super Agent, AI Slides, and AI Designer."
    },
    {
      "heading": "OCC Enhances Operational Efficiency with AWS GenAI Solutions",
      "date": "2025-11-20",
      "summary": "Genspark, a startup founded in 2023 that builds general-purpose AI agents for over 20 million users, has chosen Amazon Web Services (AWS) as its preferred cloud provider. Using AWS infrastructure and generative AI tools, Genspark has lowered development and operational costs and improved its AI product performance. The company uses AWS technologies such as EC2 Spot Instances, Amazon EKS, and Amazon Bedrock to reduce GPU and model inference costs by up to 70% and 72%, respectively. Genspark's product suite includes the Super Agent, AI Slides, AI Sheets, AI Designer, and AI Developer. The company raised $160 million in funding within 18 months, including a $100 million Series A round in February 2025 at a $530 million valuation. Genspark participated in AWS programs like AWS Activate 2.0 and the AWS Startup Accelerator to support its product development and growth."
    }
  ],
  "NVDA": [
    {
      "heading": "NVIDIA Announces Upcoming Event for Financial Community",
      "date": "2025-11-20",
      "summary": "NVIDIA has developed RDMA for S3-compatible storage, a technology that uses remote direct memory access (RDMA) to speed up data transfers for AI workloads using object storage. This approach improves throughput, reduces latency, and lowers costs compared to traditional methods. NVIDIA provides client and server libraries optimized for NVIDIA GPUs and networking, with an open architecture for other vendors to adopt and contribute to. Key storage partners Cloudian, Dell Technologies, and HPE have integrated this technology into their products: Cloudian HyperStore, Dell ObjectScale, and HPE Alletra Storage MP X10000. NVIDIA’s RDMA for S3-compatible storage libraries are currently available to select partners and will be generally available in January via the NVIDIA CUDA Toolkit."
    },
    {
      "heading": "Into the Omniverse: How Smart City AI Agents Transform Urban Operations",
      "date": "2025-11-20",
      "summary": "NVIDIA has developed RDMA client and server libraries to accelerate S3-compatible object storage, improving data transfer speed and efficiency for AI workloads. This technology uses remote direct memory access (RDMA) to enhance throughput, reduce latency, and lower costs compared to traditional TCP protocols. The RDMA libraries run on AI GPU compute nodes and are initially optimized for NVIDIA hardware, but the open architecture allows other vendors to contribute and adopt the technology.\n\nStorage partners Cloudian, Dell Technologies, and HPE are integrating these RDMA libraries into their products—Cloudian HyperStore, Dell ObjectScale, and HPE Alletra Storage MP X10000—to provide faster, more scalable object storage solutions for AI. NVIDIA’s RDMA for S3-compatible storage libraries are currently available to select partners and will be generally available in January via the NVIDIA CUDA Toolkit. NVIDIA is also working with partners to standardize this technology."
    },
    {
      "heading": "The Largest Digital Zoo: Biology Model Trained on NVIDIA GPUs Identifies Over a Million Species",
      "date": "2025-11-20",
      "summary": "NVIDIA has developed RDMA for S3-compatible storage, a technology that uses remote direct memory access (RDMA) to speed up S3 API-based object storage, improving data transfer speeds and efficiency for AI workloads. This technology offers higher throughput, lower latency, and reduced costs compared to traditional TCP-based storage. NVIDIA provides RDMA client and server libraries optimized for NVIDIA GPUs and networking, with an open architecture allowing contributions from other vendors. Key storage partners—Cloudian, Dell Technologies, and HPE—are integrating this technology into their products (Cloudian HyperStore, Dell ObjectScale, and HPE Alletra Storage MP X10000). The RDMA libraries are currently available to select partners and will be generally available through the NVIDIA CUDA Toolkit in January. NVIDIA also introduced a new Object Storage Certification as part of its NVIDIA-Certified Storage program."
    },
    {
      "heading": "Ultimate Cloud Gaming Is Everywhere With GeForce NOW",
      "date": "2025-11-20",
      "summary": "NVIDIA has developed RDMA (remote direct memory access) client and server libraries to accelerate S3-compatible object storage, improving data transfer speeds and efficiency for AI workloads. This technology delivers higher throughput, lower latency, and reduced costs compared to traditional TCP-based storage access. Storage partners Cloudian, Dell Technologies, and HPE have integrated these RDMA libraries into their object storage products—Cloudian HyperStore, Dell ObjectScale, and HPE Alletra Storage MP X10000. The RDMA for S3-compatible storage libraries are currently available to select partners and will be generally available through the NVIDIA CUDA Toolkit in January. NVIDIA is collaborating with partners to standardize this technology and has introduced an NVIDIA Object Storage Certification program."
    }
  ],
  "BAC": [
    {
      "heading": "The Global Power of Sport: Bank of America Partners with Great Ethiopian Run to Expand Access to Endurance Sports",
      "date": "2025-11-20",
      "summary": "Bank of America is launching 401k Pay, a new digital solution that helps convert 401(k) assets into retirement income. Available November 17 at no extra cost to corporate plan sponsors and participants, 401k Pay integrates recordkeeping, flexible deposit options, and financial advice in one platform. It is offered to clients enrolled in Bank of America’s Personal Retirement Strategy program. The solution aims to assist employees in setting, depositing, and tracking retirement income. Bank of America developed 401k Pay in collaboration with corporate clients to address retirement income planning needs highlighted in its 2025 Workplace Benefits Report."
    }
  ],
  "HD": [
    {
      "heading": "The Home Depot Declares Quarterly Dividend of $2.30",
      "date": "2025-11-20",
      "summary": "The Home Depot is launching the \"Holiday Gift Edit,\" a set of curated Pinterest boards featuring popular holiday gifts like tools, smart home devices, appliances, and home decor. Starting October 28, customers can shop these items both in stores and online, with options for free delivery and same-day or next-day shipping on select products. The release highlights the return of the Grand Duchess Twinkling Balsam Fir Artificial Christmas Tree and introduces the new Breckenridge Twinkling Adaptive Lighting Fraser Fir Christmas Tree. The campaign targets Millennials and Gen Z shoppers, who are more likely to create holiday wish lists and buy gifts for themselves. Gift ideas and inspiration are available on The Home Depot’s Pinterest page and corporate website."
    }
  ],
  "INTC": [
    {
      "heading": "Intel Brings AI PCs to Arizona State University Football, Extends Innovation Legacy",
      "date": "2025-11-20",
      "summary": "Intel Corporation appointed Craig H. Barratt, Ph.D., age 63, as an independent member of its board of directors, effective immediately. Dr. Barratt has over 30 years of experience in the semiconductor and technology industries, including leadership roles as CEO of Atheros Communications, SVP at Intel, and senior positions at Google. He currently serves on the boards of Intuitive Surgical, Astera Labs, and several private companies. Dr. Barratt holds degrees from the University of Sydney and Stanford University."
    }
  ],
  "MS": [
    {
      "heading": "Morgan Stanley Sustainable Signals: Global Survey Shows Institutional Investors Maintain Positive Outlook on Sustainable Investing",
      "date": "2025-11-20",
      "summary": "Morgan Stanley Real Estate Investing (MSREI) and Global Student Accommodation (GSA) have acquired an off-market portfolio of eight student housing properties totaling 6,200 beds near top U.S. universities. The transaction, valued at over $1 billion, includes assets in seven states such as Virginia, Georgia, Pennsylvania, Texas, Florida, Oregon, and North Carolina. This deal expands MSREI and GSA's U.S. portfolio to 50 properties across 23 states with nearly 24,000 beds. Yugo will manage and rebrand the new assets. The properties have nearly 100% occupancy and are located near universities including the University of Virginia, University of Florida, Texas A&M, and Penn State."
    }
  ]
}