{
  "AAPL": [
    {
      "heading": "The biggest hits of Bad Bunny’s Apple Music Super Bowl LX Halftime Show",
      "date": "2026-02-09",
      "summary": "Apple Arcade will release **SpongeBob: Patty Pursuit 2** on December 4, featuring SpongeBob and Plankton working together to save Bikini Bottom. The game includes local co-op play and exploration of various locations from the show.\n\nAlongside this, five new games will launch soon on Apple Arcade:\n\n- **Glassbreakers: Champions of Moss** for Apple Vision Pro (November 13)\n- **PowerWash Simulator** (December 4), exclusive to Apple Arcade with special SpongeBob-themed content\n- **Cult of the Lamb Arcade Edition** (December 4), featuring exclusive new content\n- **Subway Surfers+** (December 4)\n- **NARUTO: Ultimate Ninja STORM+** (December 4)\n\nApple Arcade costs £6.99 per month with a one-month free trial and offers family sharing for up to six people. It is available on iPhone, iPad, Mac, Apple TV, and Apple Vision Pro, with game availability depending on device compatibility. New Apple device purchases include three months free."
    }
  ],
  "LLY": [
    {
      "heading": "Lilly to acquire Orna Therapeutics to advance cell therapies",
      "date": "2026-02-09",
      "summary": "Lilly has launched the Changing the Thread Collection™, a campaign featuring clothing embroidered with stories from people living with obesity to help reduce stigma and reframe obesity as a chronic disease. Tan France, stylist and advocate, partners with Lilly and its obesity medication Zepbound (tirzepatide) in this initiative. Zepbound is an FDA-approved injectable treatment for adults with obesity or overweight with related medical conditions, designed to be used alongside diet and exercise. The campaign aims to raise awareness about obesity, challenge bias, and encourage understanding and treatment of the disease. The press release also includes safety information and warnings about Zepbound, noting possible serious side effects and advising consultation with healthcare providers."
    }
  ],
  "PG": [
    {
      "heading": "Where Curiosity Meets Purpose: How Inventors Thrive at P&G",
      "date": "2026-02-09",
      "summary": "Procter & Gamble has launched Gemz, a new water-activated haircare brand developed over 14 years of research. Gemz features concentrated, single-dose shampoo and conditioner tiles that dissolve in water, offering 100% active ingredients for effective cleaning and conditioning. The hexagonal tiles are designed for easy grip, travel-friendly packaging, and customizable use with five shampoos and five conditioners that can be mixed to suit different hair needs. The product aims to reduce buildup, extend time between washes, and fit into busy, mobile lifestyles. The development involved innovative manufacturing techniques combining liquid processing with paper-making methods."
    }
  ]
}