{
  "AAPL": [
    {
      "heading": "Apple Sports adds golf to its lineup",
      "date": "2026-02-06",
      "summary": "Apple Arcade will release SpongeBob: Patty Pursuit 2 on December 4, featuring SpongeBob and Plankton working together to save Bikini Bottom. The game includes local co-op play and multiple Bikini Bottom locations. \n\nAlongside this, Apple Arcade is adding five new games soon: Glassbreakers: Champions of Moss on November 13, and on December 4, PowerWash Simulator, Cult of the Lamb Arcade Edition, Subway Surfers+, and NARUTO: Ultimate Ninja STORM+. \n\nPowerWash Simulator and Cult of the Lamb are launching on mobile for the first time with exclusive content. Sneaky Sasquatch recently added a farming town update.\n\nApple Arcade costs £6.99 per month with a one-month free trial, includes access across Apple devices, and supports up to six family members. It is also part of Apple One subscription plans. Availability depends on device compatibility and region."
    }
  ],
  "AMZN": [
    {
      "heading": "Amazon.com Announces Fourth Quarter Results",
      "date": "2026-02-05",
      "summary": "Genspark, a startup with over 20 million users, has chosen Amazon Web Services (AWS) as its preferred cloud provider. Using AWS infrastructure and AI services, Genspark has lowered development and operational costs while improving performance for its AI products. Founded in 2023, Genspark offers a range of AI tools including the Super Agent workspace and other agentic AI applications. The company uses AWS technologies like Amazon EC2 Spot Instances and Amazon EKS to reduce GPU costs by 60-70% and speed up image generation. Genspark also utilizes Amazon Bedrock and Claude models to enhance AI workflows and reduce model inference costs by 72%. The partnership with AWS, supported by programs like AWS Activate 2.0, has helped Genspark accelerate its product rollout and global growth. Genspark has reached $50 million ARR in five months and raised $160 million in funding, including a $100 million Series A at a $530 million valuation."
    },
    {
      "heading": "Fundamental Announces $255M in Funding and Publicly Launches its Most Powerful Large Tabular Model (LTM)",
      "date": "2026-02-05",
      "summary": "Genspark, a startup founded in 2023 that serves over 20 million users with general-purpose AI agents, has chosen Amazon Web Services (AWS) as its preferred cloud provider. Using AWS infrastructure, including EC2 Spot Instances, Amazon EKS, and Amazon Bedrock, Genspark has reduced costs by up to 72% and improved performance for its generative and agentic AI products. The company’s products include the Super Agent workspace, AI Slides, AI Sheets, and AI Designer. Genspark raised $160 million in 18 months, reaching a $530 million valuation in February 2025, and achieved $50 million annual recurring revenue within five months. Genspark also participated in AWS startup programs that supported its product development and global growth."
    }
  ],
  "NVDA": [
    {
      "heading": "GeForce NOW Celebrates Six Years of Streaming With 24 Games in February",
      "date": "2026-02-05",
      "summary": "NVIDIA has developed RDMA (remote direct memory access) client and server libraries to accelerate S3-compatible object storage, optimized for AI workloads. This technology enables faster data transfers, higher throughput, lower latency, and improved efficiency compared to traditional TCP-based storage access. The architecture is open for other vendors to adopt and contribute to. Key storage partners—Cloudian, Dell Technologies, and HPE—are integrating RDMA for S3-compatible storage into their products: Cloudian HyperStore, Dell ObjectScale, and HPE Alletra Storage MP X10000. NVIDIA's RDMA libraries are currently available to select partners and will be generally available via the NVIDIA CUDA Toolkit in January. The company has also introduced a new NVIDIA Object Storage Certification as part of its NVIDIA-Certified Storage program."
    }
  ],
  "BAC": [
    {
      "heading": "Bank of America Announces Full Redemption of Its Series DD Preferred Stock and Related Depositary Shares",
      "date": "2026-02-05",
      "summary": "Bank of America is launching 401k Pay on November 17, a new digital solution that helps convert 401(k) assets into retirement income. The service is available at no extra cost to corporate plan sponsors and participants who use Bank of America's employer-sponsored Personal Retirement Strategy program. 401k Pay offers 401(k) recordkeeping, flexible deposit options, and retirement income advice in one platform. It aims to help employees set, deposit, and track retirement income and addresses employee needs for retirement education and income planning."
    }
  ],
  "CVX": [
    {
      "heading": "Chevron Announces Senior Leadership Changes",
      "date": "2026-02-05",
      "summary": "Chevron Corporation announced its five-year plan to 2030, aiming to grow adjusted free cash flow and earnings per share by over 10% annually at a $70 Brent oil price. The company plans to reduce capital expenditures to $18-$21 billion per year, maintain a capital and dividend breakeven below $50 per barrel, and improve return on capital employed by more than 3% by 2030. Chevron expects to increase oil and gas production by 2%-3% annually through 2030, achieve $1.5 billion in synergies with Hess Corporation, and realize $3-$4 billion in structural cost reductions by the end of 2026. The company is also developing a large-scale power project for AI data centers in West Texas, with first power targeted in 2027. Chevron plans to continue dividend growth and share repurchases, expecting to buy back $10-$20 billion in shares annually through 2030."
    }
  ],
  "MS": [
    {
      "heading": "Morgan Stanley to Host 17th Annual Go Red Women’s Leadership Event in Collaboration with the American Heart Association",
      "date": "2026-02-05",
      "summary": "Morgan Stanley Real Estate Investing (MSREI) and Global Student Accommodation (GSA) have acquired an off-market portfolio of eight student housing properties in the U.S. for over $1 billion. The portfolio includes 6,200 beds near top universities in seven states, including the University of Virginia, University of Florida, Texas A&M, and Penn State University. This acquisition expands the partnership’s U.S. portfolio to 50 properties across 23 states with nearly 24,000 beds. Yugo has been appointed to manage and rebrand the assets. The deal marks MSREI and GSA’s entry into new markets such as Virginia, Georgia, and Pennsylvania, while increasing their presence in Texas, Florida, Oregon, and North Carolina."
    }
  ]
}